SceneEvent[8]={};
SceneEvent[8]={
				[200]=function()
					JY.SubScene=6
					JY.Base["人X1"],JY.Base["人Y1"]=57,34
					lib.ShowSlow(50,1);
					Init_SMap(1);
				end,
			}







--[[
if inrect(1,26,2,28) then
	JY.SubScene=6
	JY.Base["人X1"],JY.Base["人Y1"]=57,34
	lib.ShowSlow(50,1);
	Init_SMap(1);
else--if lib.GetS(0,0,1,0)==1230 and inrect(29,17,45,26) then
	--比武招亲
	lib.SetS(3,39,22,1,2)
    WAR={};
    WAR.Data={};
    WAR.Data["代号"]=0;
    WAR.Data["名称"]="测试战斗";
    WAR.Data["地图"]=0;
    WAR.Data["经验"]=0;
    WAR.Data["音乐"]=0;
	WAR.Data["自动选择参战人"  .. 1]=0;
	WAR.Data["我方X"  .. 1]=24;
	WAR.Data["我方Y"  .. 1]=28;
	WAR.Data["敌人"  .. 1]=1;
	WAR.Data["敌方X"  .. 1]=23;
	WAR.Data["敌方Y"  .. 1]=26;
	WarMain(999,0)
	if true then return end
	lib.SetS(3,39,22,1,0)
	movesceneto(38,17)
	say("表哥，那边热闹得很，你说今天要陪我玩一整天，不许耍赖，陪我看看去",1)
	say("大丈夫一诺千金，你表哥我几时失言与人。（这侯通海怎地还不来接应我回王府= =）",0,1)
	say("真没羞，上次说好了我生日那天要教我武功，结果只送了我几本破秘籍，嘻嘻，不过本小姐大人有大量，看在这次你这么老实份上饶你一回，再不走可看不着热闹啦。",1)
	movesceneto()
	walkto(31,24)
	walkto(31,27)
	walkto(39,27)
	walkto(39,26)
	movesceneto(39,17)
	say("在下姓穆名易，山东人氏。路经贵地，一不求名，二不为利，只为小女年已及笄，尚未许得婆家。她曾许下一愿，不望夫婿富贵，但愿是个武艺超群的好汉，因此上斗胆比武招亲。凡年在三十岁以下，尚未娶亲，能胜得小女一拳一脚的，在下即将小女许配于他。在下父女两人，自南至北，经历七路，只因成名的豪杰都已婚配，而少年英雄又少肯于下顾，是以始终未得良缘。北京是卧虎藏龙之地，高人侠士必多，在下行事荒唐，请各位多多包涵。",100)
	say("原来是中原人比擂台的把式，表哥你看以我的本事上去能夺魁吗？",1,5)
	say("……",0,1)
	say("……",2,4)
	say("那个姑娘有何好看的，我看你魂都飞出来了，嘻嘻，不如我上去替表哥你将那个美人拿下来，送进宫里，如何？",1,5)
	say("庸脂俗粉而已，怎比得上表妹，看我去露两手。",0,1)
	say("每次有好玩的你都跟我抢，不过这次算你还会说话。",1,5)
	movesceneto()
	walkto(39,19)
	say("比武招亲的可是这位姑娘吗？",0,1)
	say("……",2,4)
	say("在下姓穆，公子爷有何见教？",100)
	say("我来试试",0,1)
	say("小人父女是江湖草莽，怎敢与公子爷放对？再说这不是寻常的赌胜较艺，事关小女终身大事，请公子爷见谅。",100)
	say("你们比武招亲已有几日了？",0,1)
	say("经历七路，已有大半年了。",100)
	say("难道竟然无人胜得了她？这个我却不信了。")
	say("小人父女是山野草莽之人，不敢与公子爷过招。咱们就此别过。（这人若是个寻常人家的少年，倒也和我孩儿相配。但他是富贵公子，此处是金人的京师，他父兄就算不在朝中做官，也必是有财有势之人。我孩儿若是胜过了他，难免另有后患；要是被他得胜，我又怎能跟这等人家结亲？）",100)
	say("切磋武艺，点到为止，你放心，我决不打伤打痛你的姑娘便是。这位姑娘，你只消打到我一拳，便算是你赢了，好不好？")
	say("比武过招，胜负自须公平。",2,4)
	say("（这公子爷娇生惯养，岂能真有甚么武功了？尽快将他打发了，我们这就出城，免得多生是非。）那么公子请吧。",100)
	say("你好ｎ",0)
	--lib.SetS(0,0,1,0,1)
end]]--