SceneEvent[81]={};--思过崖各事件
SceneEvent[81]={
				[1]=function()--令狐冲normal
					if GetFlag(1)<=lib.GetD(JY.SubScene,JY.CurrentD,4) then
						say("............",JY.Da);
						return;
					end
					local str={
									"我日后见到魔教中人，是否不问是非，拔剑便将他们杀了？",
									"难道魔教之中当真便无一个好人？但若他是好人，为甚么又入魔教？",
									"数百年来，我华山派不知道有多少前辈曾在这里坐过，令狐冲是今日华山派第一捣蛋鬼，自当在此坐坐。",
									"小师妹好多天都没来了，莫非着凉了？",
									};
					say(str[math.random(4)],JY.Da);
					lib.SetD(JY.SubScene,JY.CurrentD,4,GetFlag(1));
					if GetFlag(10006)==1 then
						if GetFlag(1)-lib.GetD(JY.SubScene,JY.CurrentD,4)<7 then
							say("大师兄，我给你送饭菜来了。");
							say("怎么小师妹没来啊，啊，谢谢，放这边就行了。",JY.Da);
							AddPersonAttrib(JY.Da,"友好",1);
							SetFlag(10006,0);
						else
							say("大师兄，我给你送饭菜来了。");
							say("怎么这么久才送来啊。",JY.Da);
							SetFlag(10006,4);
						end
					end
				end,
				[2]=function()	--令狐与承志
					say("大师兄，且休息一下，该吃饭了。");
					say("今日怎么是你来送饭？陆猴儿呢？",8);
					say("师傅听闻田伯光在我华山境内犯案，就率众人下山去练兵了。");
					SetS(57,30,13,3,-1);
					SetS(57,31,13,3,-1);
					if GetFlag(10008)==1 then
						say("原来如此……哈！你居然还准备了如此好酒！有心了！",8);
						say("（这是一个误会，不过，是一个美丽的误会）知道大师兄好此杯中之物，不敢不备啊。");
						say("哈哈，有你的～",8);
					else
						say("原来如此……",8);
					end
					Dark();
						SetS(81,15,21,1,3409*2);	--袁承志
						SetS(81,13,21,1,1719*2);
						SetS(81,13,20,1,1720*2);
					Light();
					say("此处是哪？我只记得从洞中出来之后便是一片树林，不知原来还有此等地方。",160);
					say("你是何人！为何私闯我华山禁地思过崖？",8);
					say("原来此处便是思过崖？真是闻名不如见面啊。我是华山弟子袁承志。",160);
					say("你是华山弟子？袁承志？不可能，我华山众弟子之间没有一个叫袁承志的。你究竟是何人！",8);
					say("大师兄，此人擅闯我华山禁地，又假装我华山弟子，只怕其心不良。不如我们将其拿下，以交师傅处置？");
					say("好，就这么办。",8);
					say("要动手？也好，刚好试试这金蛇剑法威力。",160);
					--fight
					ModifyWarMap=function()
						SetWarMap(15,21,1,0);
					end
					vs(8,25,23,160,17,21,500);
					Dark();
						SetS(81,18,19,1,2951*2);
						SetS(81,18,21,1,6187*2);
						getkey();
					Light();
					say("真是榆木脑袋。我从未见过使得如此之死板的华山剑法。",7);
					say("唉，华山的没落岂非此一时而已？",159);
					say("你们又是何人？连番闯我华山禁地究竟意欲何为！",8);
					say("华山之上，自然是华山之人。老夫穆人清。",159);
					say("老夫风清扬。",7);
					say("穆人清？风清扬？莫不是我华山清字辈的前辈？",8);
					say("哦？你居然知道我们？",7);
					say("徒孙令狐冲，拜见两位太师叔。",8);
					say("徒孙拜见两位太师叔。");
					say("拜见就不用了。对了小子，我问你，我这徒弟武功如何？",159);
					say("这位……师叔武功高强，合我二人之力堪乃与之一战。若是单打独斗，我不是对手。",8);
					say("敢直言自己不行，不错不错。看来剑法死板但是人还行。你且过来，我就教教你真正的华山剑法，该怎么使。",7);
					Dark();
					Light();
						for i=1,10 do
							AddPersonAttrib(8,"经验",5000);
							War_AddPersonLevel(8,true);
						end
					say("多谢太师叔指点！",8);
					say("风老头，你这几下子真的有用？不会只是装装样子，误人子弟吧？",159);
					say("冲儿，你再去请你师叔指教一番。",7);
					say("是，太师叔。袁师叔，请指教。",8);
					say("指教不敢当，切磋切磋而已。",160);
					--fight
					ModifyWarMap=function()
						SetWarMap(15,21,1,0);
						SetWarMap(18,19,1,0);
						SetWarMap(18,21,1,0);
					end
					vs(8,25,23,160,17,21,500);
					say("师叔剑法犹如灵蛇一般，往往从意想不到的角度攻来，我堪堪只能抵挡，连反攻一剑都做不到。",8);
					say("哪里。你将一套基础的华山剑法使得浑然天成，滴水不漏，我连攻你数十剑，居然均被挡下，你这华山剑法已然大成啊。",160);
					say("如此说来居然是平局？风老头只是指点几句就能打成平局？我不信。承志，我们走。三个月后，再来领教。",159);
					say("冲儿，你且随我练剑。三个月后，指教一下他们。",7);
					say("哼！谁指教谁还说不定呢！",159);
					say("令狐兄，那便三个月后再见了。只是，今日我所使剑法，乃不久前刚所得到的一路高深剑法，三个月后，自是与今日所使大不一样，还望令狐兄不要大意。",160);
					say("多谢相告。（只是我只会基本的华山剑法，弱真如他所说，那恐怕……）",8);
					say("冲儿，我自会传你一套剑法。三个月后，你须胜他。",7);
					say("多谢太师叔。",8);
					say("恭喜大师兄。");
					Dark();
						ModifyD(81,0,-2,-2,3,-2,-2,-2,-2,-2,-2,-2,-2);	--修改令狐练剑
						SetS(81,15,21,1,0);	--袁承志
						SetS(81,18,19,1,0);
						SetS(81,18,21,1,0);
						SetFlag(10009,GetFlag(1));
						SetFlag(10012,1);
					Light();
				end,
				[3]=function()	--日常切磋
					if GetFlag(10009)>0 and GetFlag(1)-GetFlag(10009)>=90 then	--比试
						if GetFlag(10012)==1 then
							Dark();
								SetS(81,15,21,1,3409*2);	--袁承志
								SetS(81,18,19,1,2951*2);
								SetS(81,18,21,1,6187*2);
							Light();
							say("令狐兄，请指教。",160);
							say("莫敢不从。",8);
							SetFlag(10013,1);
							--fight
							ModifyWarMap=function()
								SetWarMap(15,21,1,0);
								SetWarMap(18,19,1,0);
								SetWarMap(18,21,1,0);
							end
							local resule=vs(8,25,23,160,17,21,500);
							Dark();
								say_2("大师兄！大师兄！",13);
								say_2("承志，我们走。",159);
								say_2("你二人记住，不得向任何人透露我三人之事。",7);
								say_2("是！",8);
								say_2("是！");
								SetS(81,15,21,1,0);	--袁承志
								SetS(81,18,19,1,0);
								SetS(81,18,21,1,0);
								--陆大有
								SetS(81,17,19,1,2592*2)
							Light();
						else
							Dark();
								say("大师兄！大师兄！",13);
								--陆大有
								SetS(81,17,19,1,2592*2)
							Light();
						end
						say("大师兄！",13);
						say("你这猴儿，什么事这么急啊。",8);
						say("大师兄！大事不好了！嵩山派的领着剑宗上门，逼师傅交出掌门之位来了。",13);
						say("什么！岂有此理！我们快去！",8);
						Dark();
							SetS(81,17,19,1,0)
							ModifyD(81,0,-2,-2,-2,-2,-2,-2,-2,-2,-2,1,1);	--修改令狐
							SetFlag(10014,GetFlag(1)+5);
						Light();
						return;
					end
					--日常
						say("比剑之期将近，我需要努力啊。",JY.Da);
						local menu={
												{"聊天",nil,1},
												{"切磋",nil,1},
												{"锻炼",nil,1},
												{"状态",nil,1},
												{"没事",nil,1},
											};
						local r=ShowMenu(menu,5,0,0,0,0,0,1,0);
						if r==1 then
							RandomEvent(JY.Da);
						elseif r==2 then
								if JY.Person[0]["体力"]<30 then
									say("我看你气色不太好，还是先好好休息吧。",JY.Da);
									return;
								end
							say("好啊，咱俩来玩玩。",JY.Da);
							ModifyWarMap=function()
								SetWarMap(49,35,1,0);
							end
							local result=vs(0,25,23,JY.Da,17,21,500);
							Cls();
							ShowScreen();
							if result then
								say("好剑法！愚兄自愧不如。",JY.Da);
							else
								say("你的武功还不错，再加把劲吧。",JY.Da);
							end
							DayPass(1);
						elseif r==3 then
							E_learning(JY.Da);
						elseif r==4 then
							PersonStatus(JY.Da);
						elseif r==5 then
							--say("师弟若是无事，来聊聊天或者切磋下武功也好啊。",JY.Da);
						end
					
				end,
				[201]=function()	--桃谷六仙疗伤令狐冲
							SetS(81,22,26,1,4223*2);
							SetS(81,21,26,1,3398*2);
							SetS(81,23,26,1,3401*2);
							SetS(81,22,25,1,3399*2);
							SetS(81,22,27,1,3400*2);
							SetS(81,24,25,1,3401*2);
							SetS(81,24,27,1,3401*2);
					MoveSceneTo(22,26);
					say("令狐冲受伤了。",152);
					say("怎么治？",153);
					say("他被内力所伤，自然要用内力治疗。",154);
					say("不如我们将我们的内力注入，帮他疗伤？",155);
					say("那么如何注入呢？",156);
					say("不如我们各挑一条经脉注入？",157);
					say("这个方法不错。",156);
					say("就这么办好了。",155);
					say("但是最后怎么知道是谁的功劳呢？",154);
					say("不如等他好了我们问他？",153);
					say("嗯，那就先救醒他。",152);
					DrawStrBoxWaitKey("六人把内力注入令狐冲体内");
					Dark();
						say("啊……",8);
					Light();
					say("令狐冲醒了。",152);
					say("没醒没醒。",153);
					say("没醒他为什么会叫？",154);
					say("会叫也不一定是醒了。",155);
					say("那他究竟醒了没有？",156);
					say("喂！令狐冲，你醒了吗？",157);
					say("没有反应呢。",156);
					say("那就是没醒。",155);
					say("也有可能是他醒了故意不回答。",154);
					say("那我们把他撕成四块，看他回不回答。",153);
					say("撕成四块不就死了吗？死了自然回答不了。",152);
					say("（遭了，他们要把大师兄撕成四块！）师傅，师娘！大师兄在这！（咦！？那六个怪人呢？）");
					Dark();
						JY.SubSceneX,JY.SubSceneY=0,0;
							SetS(81,21,26,1,0);
							SetS(81,23,26,1,0);
							SetS(81,22,25,1,0);
							SetS(81,22,27,1,0);
							SetS(81,24,25,1,0);
							SetS(81,24,27,1,0);
						SetS(81,21,26,1,4258*2);
						SetS(81,22,25,1,2613*2);
						JY.Base["人X1"],JY.Base["人Y1"]=23,26;
					Light();
					say("冲儿！冲儿！你怎么样了冲儿！",2);
					say("师妹，别急，让我看看。……冲儿体内有六道一种真气横闯直撞，经脉乱作一团，只怕……",1);
					say("冲儿！嵩山派真可恶！",2);
					say("我观那六人不似嵩山之人。他们如此折磨冲儿究竟有何意图？",1);
					say("师兄，冲儿他还有救么？",2);
					say("性命无碍，只是这内力……容我再想想……你先把你大师兄扶回房。",1);
					say("是。");
					Dark();
						SetS(81,21,26,1,0);
						SetS(81,22,25,1,0);
						SetS(81,22,26,1,0);
						JY.SubScene=57;
						SetS(57,43,13,1,4323*2);
						JY.Base["人方向"]=0;
						JY.MyPic=GetMyPic();
						JY.Base["人X1"],JY.Base["人Y1"]=43,14;
					Light();
					say("师傅真这么说？",8);
					say("是的。大师兄你别急，好好养伤，师傅一定会有办法的。");
					say("但愿吧……",8);
					say("对了。华山九功，紫霞第一。我想紫霞神功一定可以帮你解决那些异种真气的。只是为何师傅不肯传你……是了。紫霞神功只传掌门。想来，师傅是希望大师兄早日振作，成为能肩负我华山的下任掌门，再传紫霞神功。大师兄切勿再颓废，不可浪费师傅的一片苦心啊。");
					say("言之有理。令狐冲受教了。我一定不会辜负师傅的期望的！",8);
					Dark();
						JY.Base["人方向"]=2;
						JY.MyPic=GetMyPic();
						JY.Base["人X1"],JY.Base["人Y1"]=38,17;
					Light();
				end,
				[11]=function()--
				end,
			}

						--say("")