
--设置全局变量CC，保存游戏中使用的常数
function SetGlobalConst()
    -- SDL 键码定义，这里名字仍然使用directx的名字
    VK_ESCAPE=27
    VK_Y=121
	VK_N=110
	VK_SPACE=32
	VK_RETURN=13

	SDLK_UP=273
	SDLK_DOWN=274
	SDLK_LEFT=276
	SDLK_RIGHT=275

	if CONFIG.Rotate==0 then
	    VK_UP=SDLK_UP;
	    VK_DOWN=SDLK_DOWN;
	    VK_LEFT=SDLK_LEFT;
	    VK_RIGHT=SDLK_RIGHT;
	else           --右转90度
	    VK_UP=SDLK_RIGHT;
	    VK_DOWN=SDLK_LEFT;
	    VK_LEFT=SDLK_UP;
	    VK_RIGHT=SDLK_DOWN;
	end


   -- 游戏中颜色定义
    C_STARTMENU=RGB(132, 0, 4)            -- 开始菜单颜色
    C_RED=RGB(216, 20, 24)                -- 开始菜单选中项颜色

    C_WHITE=RGB(236, 236, 236);           --游戏内常用的几个颜色值
    C_ORANGE=RGB(252, 148, 16);
    C_GOLD=RGB(236, 200, 40);
    C_BLACK=RGB(0,0,0);
	
	M_Black=RGB(0,0,0);
	M_Sienna=RGB(160,82,45);
	M_DarkOliveGreen=RGB(85,107,47);
	M_DarkGreen=RGB(0,100,0);
	M_DarkSlateBlue=RGB(72,61,139);
	M_Navy=RGB(0,0,128);
	M_Indigo=RGB(75,0,130);
	M_DarkSlateGray=RGB(47,79,79);
	M_DarkRed=RGB(139,0,0);
	M_DarkOrange=RGB(255,140,0);
	M_Olive=RGB(128,128,0);
	M_Green=RGB(0,128,0);
	M_Teal=RGB(0,128,128);
	M_Blue=RGB(0,0,255);
	M_SlateGray=RGB(112,128,144);
	M_DimGray=RGB(105,105,105);
	M_Red=RGB(255,0,0);
	M_SandyBrown=RGB(244,164,96);
	M_YellowGreen=RGB(154,205,50);
	M_SeaGreen=RGB(46,139,87);
	M_MediumTurquoise=RGB(72,209,204);
	M_RoyalBlue=RGB(65,105,225);
	M_Purple=RGB(128,0,128);
	M_Gray=RGB(128,128,128);
	M_Magenta=RGB(255,0,255);
	M_Orange=RGB(255,165,0);
	M_Yellow=RGB(255,255,0);
	M_Lime=RGB(0,255,0);
	M_Cyan=RGB(0,255,255);
	M_DeepSkyBlue=RGB(0,191,255);
	M_DarkOrchid=RGB(153,50,204);
	M_Silver=RGB(192,192,192);
	M_Pink=RGB(255,192,203);
	M_Wheat=RGB(245,222,179);
	M_LemonChiffon=RGB(255,250,205);
	M_PaleGreen=RGB(152,251,152);
	M_PaleTurquoise=RGB(175,238,238);
	M_LightBlue=RGB(173,216,230);
	M_Plum=RGB(221,160,221);
	M_White=RGB(255,255,255);
	

   -- 游戏状态定义
    GAME_START =0       --开始画面
    GAME_FIRSTMMAP = 1  --第一次显示主地图
    GAME_MMAP =2;       --主地图
    GAME_FIRSTSMAP = 3  --第一次显示主地图
    GAME_SMAP =4;       --场景地图
    GAME_WMAP =5;       --战斗地图
	GAME_DEAD =6;       --死亡画面
    GAME_END  =7;       --结束

   --游戏数据全局变量
   CC={};      --定义游戏中使用的常量，这些可以在修改游戏时修改之
	CC.Version='v0.20'
   CC.SrcCharSet=0;         --源代码的字符集 0 gb  1 big5，用于转换R×。 如果源码被转换为big5，则应设为1
   CC.OSCharSet=CONFIG.OSCharSet;         --OS 字符集，0 GB, 1 Big5
   CC.FontName=CONFIG.FontName;    --显示字体
   Font_Qiti=CC.FontName
   Font_Xihei=CC.FontName
   CC.FontNameSong="c:\\windows\\fonts\\simsun.ttc"
   CC.FontNameHei="c:\\windows\\fonts\\SIMHEI.TTF"
   CC.ScreenW=CONFIG.Width;          --显示窗口宽高
   CC.ScreenH=CONFIG.Height;
   CC.SL=0;
   --
   CC.Mem_Base={}
   CC.Mem_Person={}
   CC.Mem_Thing={}
   CC.Mem_Scene={}
   CC.Mem_Wugong={}
   CC.Mem_Shop={}

   --定义记录文件名。S和D由于是固定大小，因此不再定义idx了。
   CC.R_IDXFilename={[0]=CONFIG.DataPath .. "newgame.idx",
                     CONFIG.SavePath .. "save1\\r.idx",
					 CONFIG.SavePath .. "save2\\r.idx",
					 CONFIG.SavePath .. "save3\\r.idx",
					 CONFIG.SavePath .. "save4\\r.idx",
					 CONFIG.SavePath .. "save5\\r.idx",
					 CONFIG.SavePath .. "save6\\r.idx",};
   CC.R_GRPFilename={[0]=CONFIG.DataPath .. "newgame.grp",
                     CONFIG.SavePath .. "save1\\r",
					 CONFIG.SavePath .. "save2\\r",
					 CONFIG.SavePath .. "save3\\r",
                     CONFIG.SavePath .. "save4\\r",
					 CONFIG.SavePath .. "save5\\r",
					 CONFIG.SavePath .. "save6\\r",};
   CC.S_Filename={[0]=CONFIG.DataPath .. "allsin.grp",
                  CONFIG.SavePath .. "save1\\s",
				  CONFIG.SavePath .. "save2\\s",
				  CONFIG.SavePath .. "save3\\s",
                  CONFIG.SavePath .. "save4\\s",
				  CONFIG.SavePath .. "save5\\s",
				  CONFIG.SavePath .. "save6\\s",};

   CC.TempS_Filename=CONFIG.SavePath .. "allsinbk.grp";

   CC.D_Filename={[0]=CONFIG.DataPath .. "alldef.grp",
                   CONFIG.SavePath .. "save1\\d",
				   CONFIG.SavePath .. "save2\\d",
				   CONFIG.SavePath .. "save3\\d",
                   CONFIG.SavePath .. "save4\\d",
				   CONFIG.SavePath .. "save5\\d",
				   CONFIG.SavePath .. "save6\\d",};

   CC.PaletteFile=CONFIG.DataPath .. "mmap.col";

   CC.FirstFile=CONFIG.PicturePath .. "JYOLtitle.png";
   CC.DeadFile=CONFIG.PicturePath .. "dead.png";

   CC.MMapFile={CONFIG.DataPath .. "earth.002",
                CONFIG.DataPath .. "surface.002",
				CONFIG.DataPath .. "building.002",
		        CONFIG.DataPath .. "buildx.002",
				CONFIG.DataPath .. "buildy.002"};

   --各种贴图文件名。
   CC.MMAPPicFile={CONFIG.DataPath .. "mmap.idx",CONFIG.DataPath .. "mmap.grp"};
   CC.SMAPPicFile={CONFIG.DataPath .. "smap.idx",CONFIG.DataPath .. "smap.grp"};
   CC.EffectFile={CONFIG.DataPath .. "eft.idx",CONFIG.DataPath .. "eft.grp"};
   CC.FightPicFile={CONFIG.FightPath .. "fight%03d.idx",CONFIG.FightPath .. "fight%03d.grp"};  --此处为字符串格式，类似于C中printf的格式。

   CC.HeadPicFile={CONFIG.DataPath .. "hdgrp.idx",CONFIG.DataPath .. "hdgrp.grp"};
   CC.ThingPicFile={CONFIG.DataPath .. "thing.idx",CONFIG.DataPath .. "thing.grp"};
   CC.WarFile=CONFIG.DataPath .. "war.sta";
   CC.WarMapFile={CONFIG.DataPath .. "warfld.idx",
                  CONFIG.DataPath .. "warfld.grp"};


   CC.MIDIFile=CONFIG.SoundPath .. "game%02d.mid";
   CC.MP3File=CONFIG.MusicPath .. "JYOL_M%03d.mp3";
   CC.ATKFile=CONFIG.SoundPath .. "atk%02d.wav";
   CC.EFile=CONFIG.SoundPath .. "e%02d.wav";

   --定义记录文件R×结构。  lua不支持结构，无法直接从二进制文件中读取，因此需要这些定义，用table中不同的名字来仿真结构。
   CC.TeamNum=15;          --队伍人数
   CC.MyThingNum=200      --主角物品数量
   CC.Kungfunum=5		--角色武功数量
	CC.MaxKungfuNum=80
   CC.Base_S={};         --保存基本数据的结构，以便以后存取
   CC.Base_S["乘船"]={0,0,2}   -- 起始位置(从0开始)，数据类型(0有符号 1无符号，2字符串)，长度
   CC.Base_S["场景"]={2,0,2};
   CC.Base_S["人X"]={4,0,2};
   CC.Base_S["人Y"]={6,0,2};
   CC.Base_S["人X1"]={8,0,2};
   CC.Base_S["人Y1"]={10,0,2};
   CC.Base_S["人方向"]={12,0,2};
   CC.Base_S["船X"]={14,0,2};
   CC.Base_S["船Y"]={16,0,2};
   CC.Base_S["船X1"]={18,0,2};
   CC.Base_S["船Y1"]={20,0,2};
   CC.Base_S["船方向"]={22,0,2};

   for i=1,CC.TeamNum do
        CC.Base_S["队伍" .. i]={24+2*(i-1),0,2};
   end

   for i=1,CC.MyThingNum do
        CC.Base_S["物品" .. i]={54+4*(i-1),0,2};
        CC.Base_S["物品数量" .. i]={56+4*(i-1)+2,0,2};
   end
   CC.ToalPersonNum=2600;
    CC.SceneSize=56;   --每个场景数据占用字节
    CC.Scene_S={};
    CC.Scene_S["代号"]={0,0,2}
    CC.Scene_S["名称"]={2,2,14}
    CC.Scene_S["出门音乐"]={16,0,2}
    CC.Scene_S["进门音乐"]={18,0,2}
    CC.Scene_S["跳转场景"]={20,0,2}
    CC.Scene_S["进入条件"]={22,0,2}
    CC.Scene_S["外景入口X1"]={24,0,2}
    CC.Scene_S["外景入口Y1"]={26,0,2}
    CC.Scene_S["外景入口X2"]={28,0,2}
    CC.Scene_S["外景入口Y2"]={30,0,2}
    CC.Scene_S["入口X"]={32,0,2}
    CC.Scene_S["入口Y"]={34,0,2}
    CC.Scene_S["出口X1"]={36,0,2}
    CC.Scene_S["出口X2"]={38,0,2}
    CC.Scene_S["出口X3"]={40,0,2}
    CC.Scene_S["出口Y1"]={42,0,2}
    CC.Scene_S["出口Y2"]={44,0,2}
    CC.Scene_S["出口Y3"]={46,0,2}
    CC.Scene_S["跳转口X1"]={48,0,2}
    CC.Scene_S["跳转口Y1"]={50,0,2}
    CC.Scene_S["跳转口X2"]={52,0,2}
    CC.Scene_S["跳转口Y2"]={54,0,2}

    CC.PersonSize=488;   --每个人物数据占用字节
    CC.Person_S={};      --保存人物数据的结构，以便以后存取
    CC.Person_S["代号"]={0,0,2}
    CC.Person_S["头像代号"]={2,0,2}
    CC.Person_S["战斗动作"]={4,0,2}
    CC.Person_S["姓名"]={6,2,14}
    CC.Person_S["外号"]={20,2,14}
    CC.Person_S["性别"]={34,0,2}
    CC.Person_S["等级"]={36,0,2}
    CC.Person_S["经验"]={38,0,4}
    CC.Person_S["生命"]={42,0,2}
    CC.Person_S["生命最大值"]={44,0,2}
    CC.Person_S["生命Max"]={46,0,2}
    CC.Person_S["内力性质"]={48,0,2}
    CC.Person_S["内力"]={50,0,2}
    CC.Person_S["内力最大值"]={52,0,2}
    CC.Person_S["内力Max"]={54,0,2}
    CC.Person_S["体力"]={56,0,2}
    CC.Person_S["武器"]={58,0,2}
    CC.Person_S["防具"]={60,0,2}
	for i=1,5 do
		CC.Person_S["外功"..i]={60+2*i,0,2}
		CC.Person_S["外功经验"..i]={70+2*i,0,2}
	end
    CC.Person_S["内功"]={82,0,2}
    CC.Person_S["内功经验"]={84,0,2}
    CC.Person_S["轻功"]={86,0,2}
    CC.Person_S["轻功经验"]={88,0,2}
    CC.Person_S["特技"]={90,0,2}
    CC.Person_S["特技经验"]={92,0,2}
    CC.Person_S["攻击"]={94,0,2}
    CC.Person_S["防御"]={96,0,2}
    CC.Person_S["身法"]={98,0,2}
    CC.Person_S["力道"]={100,0,2}
    CC.Person_S["机敏"]={102,0,2}
    CC.Person_S["根骨"]={104,0,2}
    CC.Person_S["福缘"]={106,0,2}
    CC.Person_S["资质"]={108,0,2}
    CC.Person_S["拳掌"]={110,0,2}
    CC.Person_S["御剑"]={112,0,2}
    CC.Person_S["耍刀"]={114,0,2}
    CC.Person_S["枪棍"]={116,0,2}
    CC.Person_S["修为"]={118,0,2}
    CC.Person_S["中毒"]={120,0,2}
    CC.Person_S["内伤"]={122,0,2}
    CC.Person_S["流血"]={124,0,2}
    CC.Person_S["品德"]={126,0,2}
    CC.Person_S["友好"]={128,0,2}
    CC.Person_S["修炼点数"]={130,0,4}
	for i=1,CC.MaxKungfuNum do
		CC.Person_S["所会武功"..i]={132+2*i,0,2}
		CC.Person_S["所会武功经验"..i]={292+2*i,0,2}
	end
     for i=1,4 do
        CC.Person_S["携带物品" .. i]={452+2*i,0,2};
        CC.Person_S["携带物品数量" .. i]={460+2*i,0,2};
     end
    CC.Person_S["门派"]={470,0,2}
    CC.Person_S["身份"]={472,0,2}
    CC.Person_S["所在"]={474,0,2}
	CC.Person_S["登场"]={476,0,2}
	CC.Person_S["饮酒"]={478,0,2}
	CC.Person_S["赌博"]={480,0,2}
	CC.Person_S["切磋"]={482,0,2}
	CC.Person_S["闲聊"]={484,0,2}
	CC.Person_S["外出"]={486,0,2}
    --CC.Person_S["师承1"]={476,0,2}
    --CC.Person_S["师承2"]={478,0,2}
    --CC.Person_S["师承3"]={480,0,2}
	

    CC.ThingSize=102;   --每个人物数据占用字节
    CC.Thing_S={};
    CC.Thing_S["代号"]={0,0,2}
    CC.Thing_S["名称"]={2,2,14}
    CC.Thing_S["说明"]={16,2,40}
    CC.Thing_S["装备类型"]={56,0,2}--0拳1剑2刀3棍10防具
    CC.Thing_S["类型"]={58,0,2}--1任务2药物3秘籍4装备
    CC.Thing_S["加攻击"]={60,0,2}
    CC.Thing_S["加防御"]={62,0,2}
    CC.Thing_S["加轻功"]={64,0,2}
    CC.Thing_S["需使用人物"]={66,0,2}
    CC.Thing_S["需内力"]={68,0,2}
    CC.Thing_S["需攻击"]={70,0,2}
    CC.Thing_S["需轻功"]={72,0,2}
    CC.Thing_S["需拳掌"]={74,0,2}
    CC.Thing_S["需御剑"]={76,0,2}
    CC.Thing_S["需耍刀"]={78,0,2}
    CC.Thing_S["需枪棍"]={80,0,2}
    CC.Thing_S["需资质"]={82,0,2}
    CC.Thing_S["特效数量"]={84,0,2}
	for i=1,8 do
		CC.Thing_S["特效"..i]={84+i*2,0,2}
	end

      for i=1,5 do
        CC.Thing_S["练出物品" .. i]={168+2*(i-1),0,2};
        CC.Thing_S["需要物品数量" .. i]={178+2*(i-1),0,2};
     end

    CC.SceneSize=72;   --每个场景数据占用字节
    CC.Scene_S={};
    CC.Scene_S["代号"]={0,0,2}
    CC.Scene_S["名称"]={2,2,14}
    CC.Scene_S["出门音乐"]={16,0,2}
    CC.Scene_S["进门音乐"]={18,0,2}
    CC.Scene_S["跳转场景"]={20,0,2}
    CC.Scene_S["进入条件"]={22,0,2}
    CC.Scene_S["外景入口X1"]={24,0,2}
    CC.Scene_S["外景入口Y1"]={26,0,2}
    CC.Scene_S["外景入口X2"]={28,0,2}
    CC.Scene_S["外景入口Y2"]={30,0,2}
    CC.Scene_S["外景入口X3"]={32,0,2}
    CC.Scene_S["外景入口Y3"]={34,0,2}
    CC.Scene_S["入口X"]={36,0,2}
    CC.Scene_S["入口Y"]={38,0,2}
    CC.Scene_S["入口X2"]={40,0,2}
    CC.Scene_S["入口Y2"]={42,0,2}
    CC.Scene_S["入口X3"]={44,0,2}
    CC.Scene_S["入口Y3"]={46,0,2}
    CC.Scene_S["出口X1"]={48,0,2}
    CC.Scene_S["出口X2"]={50,0,2}
    CC.Scene_S["出口X3"]={52,0,2}
    CC.Scene_S["出口Y1"]={54,0,2}
    CC.Scene_S["出口Y2"]={56,0,2}
    CC.Scene_S["出口Y3"]={58,0,2}
    CC.Scene_S["跳转口X1"]={60,0,2}
    CC.Scene_S["跳转口Y1"]={62,0,2}
    CC.Scene_S["跳转口X2"]={64,0,2}
    CC.Scene_S["跳转口Y2"]={66,0,2}
    CC.Scene_S["跳转入口X"]={68,0,2}
    CC.Scene_S["跳转入口Y"]={70,0,2}

    CC.WugongSize=228;   --每个武功数据占用字节
    CC.Wugong_S={};
    CC.Wugong_S["代号"]={0,0,2}
    CC.Wugong_S["名称"]={2,2,14}
    CC.Wugong_S["说明"]={16,2,128}
    CC.Wugong_S["门派"]={144,0,2}
    CC.Wugong_S["等阶"]={146,0,2}
    CC.Wugong_S["思想"]={148,0,2}
    CC.Wugong_S["倾向"]={150,0,2}
    CC.Wugong_S["武功类型"]={152,0,2}
    CC.Wugong_S["出招音效"]={154,0,2}
    CC.Wugong_S["攻击距离"]={156,2,14}
    CC.Wugong_S["攻击范围"]={170,2,14}
    CC.Wugong_S["武功动画&音效"]={184,0,2}
    CC.Wugong_S["消耗内力点数"]={186,0,2}
    CC.Wugong_S["伤害"]={188,0,2}
    CC.Wugong_S["伤害修正"]={190,0,2}
    CC.Wugong_S["格挡"]={192,0,2}
    CC.Wugong_S["攻击"]={194,0,2}
    CC.Wugong_S["防御"]={196,0,2}
    CC.Wugong_S["身法"]={198,0,2}
    CC.Wugong_S["集气"]={200,0,2}
    CC.Wugong_S["修炼经验"]={202,0,2}
    CC.Wugong_S["需拳掌"]={204,0,2}
    CC.Wugong_S["需御剑"]={206,0,2}
    CC.Wugong_S["需耍刀"]={208,0,2}
    CC.Wugong_S["需枪棍"]={210,0,2}
    CC.Wugong_S["需内力"]={212,0,2}
    CC.Wugong_S["需资质"]={214,0,2}
    CC.Wugong_S["需武功1"]={216,0,2}
    CC.Wugong_S["需武功等级1"]={218,0,2}
    CC.Wugong_S["需武功2"]={220,0,2}
    CC.Wugong_S["需武功等级2"]={222,0,2}
    CC.Wugong_S["需武功3"]={224,0,2}
    CC.Wugong_S["需武功等级3"]={226,0,2}


   CC.ShopSize=42;   --每个小宝商店数据占用字节
   CC.Shop_S={};
   CC.Shop_S["代号"]={0,0,2};
   CC.Shop_S["名称"]={2,2,14};
   CC.Shop_S["入门时间"]={16,0,2};
   CC.Shop_S["武学氛围"]={18,0,2};
   CC.Shop_S["据点"]={20,0,2};
   
	CC.ShichengSize=158;
	CC.Shicheng_S={};
	CC.Shicheng_S["代号"]={0,0,2};
	CC.Shicheng_S["名称"]={2,2,14};
	CC.Shicheng_S["说明"]={16,2,128};
	for i=1,7 do
		CC.Shicheng_S["武功"..i]={142+i*2,0,2};
	end
   --[[
   for i=1,5 do
      CC.Shop_S["物品" .. i]={0+2*(i-1),0,2};
      CC.Shop_S["物品数量" .. i]={10+2*(i-1),0,2};
      CC.Shop_S["物品价格" .. i]={20+2*(i-1),0,2};
   end
   ]]--
  --其他常量
   CC.MWidth=480;       --主地图宽
   CC.MHeight=480;      --主地图高

   CC.SWidth=64;     --子场景地图大小
   CC.SHeight=64;

   CC.DNum=200;       --D*每个场景的事件数

   CC.XScale=CONFIG.XScale;    --贴图一半的宽高
   CC.YScale=CONFIG.YScale;

   CC.Frame=66;     --每帧毫秒数
   CC.SceneMoveFrame=CC.Frame*2;           --场景移动帧速，用于场景移动事件
   CC.PersonMoveFrame=CC.Frame*2;          --主角移动速度，用于主角移动事件
   CC.AnimationFrame=CC.Frame*3;           --动画显示帧速，用于显示动画事件

   CC.WarAutoDelay=450;                   --自动战斗时显示头像的延时

   CC.DirectX={0,1,-1,0};  --不同方向x，y的加减值，用于走路改变坐标值
   CC.DirectY={-1,0,0,1};

   CC.MyStartPic=2501;      --主角走路起始贴图
   CC.BoatStartPic=3715;    --船起始贴图

   CC.Level=72;                  ---人物等级和每等级经验
   CC.Exp={    50,    150,     300 ,500   , 750 ,
               1050,  1400,   1800 ,2250  , 2750 ,
               3850,  5050,   6350 ,7750  , 9250 ,
               10850, 12550, 14350 ,16750 , 18250 ,
               21400, 24700, 28150 ,31750 , 35500 ,
	           39400, 43450, 47650 ,52000 , 60000  ,
			   80000,110000,150000,200000,250000,
			   300000,400000,500000,600000,700000,
			   800000,900000,1000000,1100000,1200000,
			   1300000,1400000,1500000,1600000,1700000,
			   1800000,1900000,2000000,2100000,2200000,
			   2300000,2400000,2500000,2600000,2700000,
			   2800000,2900000,3000000,3100000,3200000,
			   3300000,3400000,3500000,3600000,3700000,
			   3800000,3900000,4000000,4100000,4200000};

    CC.MMapBoat={};    --主地图船可以进入的贴图
	local tmpBoat={ {0x166,0x16a},{0x176,0x17c},{0x1ca,0x1d0},{0x1fa,0x262},{0x3f8,0x3fe},};
    for i,v in ipairs(tmpBoat) do      --把这些数据变换成数组，其中有值就是可以进入
        for j=v[1],v[2],2 do
            CC.MMapBoat[j]=1;
        end
    end

    CC.SceneWater={};    --场景人不能进入的贴图
    local tmpWater={ {0x166,0x16a},{0x176,0x17c},{0x1ca,0x1d0},{0x1fa,0x262},{0x332,0x338},
                     {0x346,0x346},{0x3a6,0x3a8},{0x3f8,0x3fe},{0x52c,0x544},};
    for i,v in ipairs(tmpWater) do      --把这些数据变换成数组，其中空项就是可以进入的贴图
        for j=v[1],v[2],2 do
            CC.SceneWater[j]=1;
        end
    end

    CC.WarWater={};    --战斗地图人不能进入的贴图
    local tmpWater={ {0x166,0x16a},{0x176,0x17c},{0x1ca,0x1d0},{0x1fa,0x262},{0x332,0x338},
                     {0x346,0x346},{0x3a6,0x3a8},{0x3f8,0x3fe},{0x52c,0x544},};
    for i,v in ipairs(tmpWater) do      --把这些数据变换成数组，其中空项就是可以进入的贴图
        for j=v[1],v[2],2 do
            CC.WarWater[j]=1;
        end
    end

	CC.PersonSave=	{	[0]=1,
						0,1,2,3,4,5,6,7,8,9,
					}
    --离队人员列表: {人员id，离队调用函数}      ----如果有新的离队人员加入，直接在这里增加
    CC.PersonExit={{1,950},{2,952},{9,954},{16,956},{17,958},
                   {25,960},{28,962},{29,964},{35,966},{36,968},
                   {37,970},{38,972},{44,974},{45,976},{47,978},
                   {48,980},{49,982},{51,984},{53,986},{54,988},
                   {58,990},{59,992},{61,994},{63,996},{76,998},  }

    --所有可加入人员离队需要清除的D*事件，清除后这些人就找不到了。得到武林帖指令使用
    CC.AllPersonExit={ {0,0},{49,2},{4,1},{44,0},{44,1},{37,5},{30,0},{59,0},{40,3},{56,1},{1,7},{1,8},{1,10},
                       {40,7},{40,8},{77,0},{54,0},{62,3},{62,4},{60,2},{60,15},{52,1},{61,0},{61,8},{78,0},
                       {18,0},{18,1},{69,0},{69,1},{45,0},{52,2},{42,6},{42,7},{8,8},{7,6},{80,1}, };

    CC.BookNum=14;               --天书个数
    CC.BookStart=144;            --14天书起始物品id

    CC.MoneyID=174;              --金钱物品id

    CC.Shemale={ [78]=1,[91]=1}   --需要自宫的书的id

   CC.Effect={[0]=10,14,17,9,13,                    --eft.idx/grp贴图各个武功效果贴图个数
                 17,17,17,18,19,						--NND,不止第一帧有问题，中间还有个也有问题。另外从金水复制过来的，也有两帧有问题
                 19,15,13,10,10,
                 15,21,16,9,11,
                 8,9,8,8,7,
                 8,8,9,12,19,
                 11,14,12,17,8,
                 11,10,13,10,19,
                 14,17,19,14,21,
                 16,13,18,14,17,
                 17,16,7,12,40,
				 16,9,15,15,31,
				 38,24,26,24,20,
				 12,17,14,14,10,
				 10,18,31,12,7,
				 6,7,28,16,7,
				 16,20,15,13,15,
				 11,11,11,20,20,
				 20,17,17,17,9,
				 8,8,17,10,11,
				 8,29,6,13,31,
				 --
				 14,4,13,13,15,
				 --Blast
				 11,11,11,11,8,
				 12,12,10,11,11,
				 7,10,9,7,10,
				 8,7,8,10,10,
				 8,11,10,9,12,
				 12,10,10,12,8,
				 9,8,18,10,13,
				 7,11,7,11,9,
				 8,12,7,6,9,
				 7,7,16,6,16,
				 12,11,21,18,10,
				 12,9,7,9,12,
				 9,8,8,7,12,
				 7,7,8,6,8,
				 10,41,15,8,11,
				 13,11,14,14,11,
				 13,13,10,9,10,
				 12,8,8,14,11,
				 17,44,24,19,14,
				 25,12,20,24,18,
				 --
				 13,10,7,5,18,9,8,14,9,11,
				 13,9,10,7,11,16,7,10,8,9,
				 19,10,11,13,11,
				 --
				 7,11,16,16,10,15,15,16,11,12,
				 11,9,10,10,7,10,10,11,
				 --
				 35,13,12,28,20,18,7,18,12,
				 --
				 10,13,23,10,10,9,10,9,9,11,18,21,10,
				 --
				 11,10,9,9,8,9,9,8,9,14,13,9,14,9,16,9,9,12,7,8,15,9,13,19,16,8,9,17,16,14,11,16,12,11,12,14,8,11,15,
				 --
				 10,12,7,22,10,11,
				 --
				 11,7,10,10,13,8,11,7,15,8,10,10,20,23,9,13,14,12,7,14,10,11,14,8,10,12,14,9,8,10,10,8,16,19,14,12,13,16,15,12,13,
				 --
				 7,7,7,12,12,8,6,12,13,19,10,12,13,8,14,14,9,8,9,9,11,12,16,11,7,19,18,13,10,11,13,6,10,10,16,12,9,13,11,16,10,26,18,9,27,17,20,19,19,20,9,8,12,7,9,8,8,8,9,8,9,18,16,9,17,16,30,16,19,13,11,18,10,14,20,14,16,9,9,20,19,16,15,9,11,15,25,33,19,25,22,8,10,10,8,9,9,9,11,9,8,9,11,
				 --
				 6,7,8,7,6,13,8,8,6,6,6,7,12,6,16,8,8,7,12,10,8,10,10,6,6,7,8,7,12,9,9,11,7,7,27,8,8,27,16,16,17,9,8,15,17,13,12,12,20,17,12,20,15,16,
				 --
				 12,7,14,16,10,12,12,
				 --Ice
				 9,11,9,22,12,14,11,15,10,15,14,8,11,13,13,13,7,13,12,18,15,10,9,19,18,
				 --Misc
				 12,6,10,8,6,7,8,8,8,9,7,6,7,11,10,7,8,42,12,9,10,9,7,21,8,14,13,13,12,12,11,14,6,9,8,7,9,9,12,8,7,16,13,11,10,11,14,32,16,11,16,7,9,11,16,15,16,16,15,8,11,22,20,20,
				 --Slash
				 12,8,8,6,7,8,9,19,6,6,18,6,10,8,9,14,7,10,9,13,10,8,11,15,15,16,8,9,8,10,7,8,12,8,10,13,5,9,9,6,11,8,10,6,6,7,9,8,9,9,11,
				 --Spark
				 24,10,11,10,25,16,19,14,13,15,16,24,
				 --Toxic
				 16,9,10,13,13,20,14,13,16,8,13,0,16,16,
				 --Water
				 9,12,6,16,23,7,7,21,6,9,
				 --Wind
				 28,18,10,15,7,10,11,7,9,13,13,13,6,7,16,8,6,12,14,12,16,14,14,12,9,9,10,8,14,
				 };
	CC.NEft_Offset=	{
[101]={-71,-131},
[102]={-80,-134},
[103]={-113,-178},
[104]={-114,-176},
[105]={-73,-141},
[106]={-77,-140},
[107]={-74,-112},
[108]={-71,-144},
[109]={-71,-137},
[110]={-20,-93},
[111]={-31,-103},
[112]={-44,-127},
[113]={-39,-141},
[114]={-21,-104},
[115]={-39,-125},
[116]={-50,-159},
[117]={-23,-83},
[118]={-39,-94},
[119]={-38,-139},
[120]={-74,-148},
[121]={-36,-109},
[122]={-49,-179},
[123]={-11,-94},
[124]={-21,-127},
[125]={-23,-128},
[126]={-29,-85},
[127]={-18,-74},
[128]={-20,-77},
[129]={-32,-82},
[130]={-28,-83},
[131]={-24,-79},
[132]={-26,-69},
[133]={-36,-94},
[134]={-48,-107},
[135]={-31,-106},
[136]={-40,-124},
[137]={-29,-77},
[138]={-52,-92},
[139]={-53,-106},
[140]={-49,-180},
[141]={-33,-91},
[142]={-62,-153},
[143]={-23,-106},
[144]={-60,-81},
[145]={-59,-59},
[146]={-65,-102},
[147]={-85,-38},
[148]={-33,-95},
[149]={-38,-163},
[150]={-46,-128},
[151]={-44,-123},
[152]={-41,-113},
[153]={-28,-98},
[154]={-47,-78},
[155]={-73,-118},
[156]={-56,-114},
[157]={-71,-166},
[158]={-28,-214},
[159]={-53,-111},
[160]={-64,-243},
[161]={-58,-263},
[162]={-57,-248},
[163]={-31,-265},
[164]={-24,-97},
[165]={-40,-88},
[166]={-30,-48},
[167]={-55,-82},
[168]={-30,-111},
--
[169]={-49,-74},
--
[170]={-52,-94},
[171]={-77,-115},
[172]={-62,-70},
[173]={-68,-59},
[174]={-77,-59},
[175]={-63,-97},
[176]={-70,-158},
[177]={-55,-106},
[178]={-84,-130},
[179]={-30,-102},
[180]={-56,-169},
[181]={-71,-245},
[182]={-61,-174},
[183]={-91,-214},
[184]={-85,-240},
[185]={-94,-126},
[186]={-52,-108},
[187]={-80,-116},
[188]={-85,-112},
[189]={-59,-127},
[190]={-66,-132},
[191]={-101,-225},
[192]={-22,-163},
[193]={-80,-272},
[194]={-22,-183},
[195]={-18,-194},
[196]={-73,-251},
[197]={-80,-253},
[198]={-132,-187},
[199]={-76,-220},
[200]={-70,-217},
[201]={-111,-202},
[202]={-128,-293},
[203]={-77,-239},
[204]={-68,-243},
[205]={-69,-296},
[206]={-72,-244},
[207]={-46,-229},
[208]={-111,-179},
[209]={-154,-188},
[210]={-40,-88},
[211]={-19,-91},
[212]={-42,-76},
[213]={-38,-94},
[214]={-25,-66},
[215]={-37,-124},
[216]={-50,-109},
[217]={-46,-128},
[218]={-20,-100},
[219]={-13,-99},
[220]={-18,-93},
[221]={-60,-104},
[222]={-33,-119},
[223]={-23,-113},
[224]={-66,-121},
[225]={-111,-72},
[226]={-55,-131},
[227]={-169,-434},
[228]={-56,-164},
[229]={-57,-111},
[230]={-38,-138},
[231]={-97,-135},
[232]={-44,-163},
[233]={-55,-137},
[234]={-104,-203},
[235]={-5,-83},
[236]={-12,-84},
[237]={-10,-87},
[238]={-17,-93},
[239]={-21,-100},
[240]={-26,-99},
[241]={-32,-96},
[242]={-56,-91},
[243]={-24,-89},
[244]={-50,-88},
[245]={-28,-94},
[246]={-37,-101},
[247]={-39,-116},
[248]={-14,-89},
[249]={-24,-89},
[250]={-59,-104},
[251]={-124,-144},
[252]={-37,-94},
[253]={-48,-251},
[254]={-51,-159},
[255]={-47,-324},
[256]={-74,-325},
[257]={-57,-157},
[258]={-77,-204},
[259]={-60,-121},
[260]={-45,-115},
[261]={-98,-130},
[262]={-78,-69},
[263]={-22,-160},
[264]={-40,-134},
[265]={-27,-175},
[266]={-37,-155},
[267]={-20,-98},
[268]={-86,-55},
[269]={-55,-75},
[270]={-65,-164},
[271]={-38,-209},
[272]={-72,-214},
[273]={-71,-220},
[274]={-70,-119},
[275]={-4,-66},
[276]={-10,-71},
[277]={-36,-74},
[278]={-19,-89},
[279]={-38,-59},
[280]={-15,-88},
[281]={-12,-70},
[282]={-29,-95},
[283]={-27,-96},
[284]={-19,-67},
[285]={-70,-119},
[286]={-37,-80},
[287]={-44,-78},
[288]={-30,-86},
[289]={-30,-95},
[290]={-33,-110},
[291]={-41,-123},
[292]={-82,-222},
[293]={-34,-177},
[294]={-39,-104},
[295]={-42,-94},
--
[296]={0,0},
--
[297]={-80,-124},
[298]={-45,-116},
[299]={-53,-88},
[300]={-60,-114},
[301]={-42,-150},
[302]={-47,-105},
[303]={-37,-98},
[304]={-34,-100},
[305]={-104,-163},
[306]={-68,-206},
[307]={-65,-104},
[308]={-80,-95},
[309]={-265,-293},
[310]={-50,-137},
[311]={-64,-196},
[312]={-51,-132},
[313]={-40,-113},
[314]={-37,-59},
[315]={-57,-86},
[316]={-47,-131},
[317]={-86,-103},
[318]={-102,-172},
[319]={-142,-240},
[320]={-18,-87},
[321]={-18,-93},
[322]={-22,-85},
[323]={-24,-98},
[324]={-28,-98},
[325]={-28,-101},
[326]={-24,-104},
[327]={-34,-104},
[328]={-23,-114},
[329]={-40,-107},
[330]={-37,-106},
[331]={-25,-91},
[332]={-65,-124},
[333]={-50,-123},
[334]={-40,-125},
[335]={-33,-116},
[336]={-75,-110},
[337]={-65,-100},
[338]={-49,-105},
[339]={-33,-106},
[340]={-51,-117},
[341]={-36,-101},
[342]={-38,-106},
[343]={-20,-171},
[344]={-62,-152},
[345]={-25,-139},
[346]={-26,-249},
[347]={-35,-248},
[348]={-21,-204},
[349]={-23,-193},
[350]={-64,-151},
[351]={-31,-313},
[352]={-23,-108},
[353]={-20,-131},
[354]={-106,-206},
[355]={-77,-237},
[356]={-72,-248},
[357]={-36,-207},
[358]={-100,-216},
[359]={-45,-216},
[360]={-54,-105},
[361]={-12,-95},
[362]={-7,-102},
[363]={-10,-93},
[364]={-12,-88},
[365]={-7,-101},
[366]={-57,-86},
[367]={-30,-95},
[368]={-24,-94},
[369]={-19,-98},
[370]={-13,-104},
[371]={-11,-83},
[372]={-26,-98},
[373]={-16,-91},
[374]={-13,-57},
[375]={-35,-75},
[376]={-30,-104},
[377]={-28,-58},
[378]={-40,-121},
[379]={-30,-97},
[380]={-30,-103},
[381]={-41,-100},
[382]={-36,-93},
[383]={-67,-115},
[384]={-39,-109},
[385]={-73,-112},
[386]={-29,-103},
[387]={-25,-105},
[388]={-69,-112},
[389]={-81,-98},
[390]={-34,-92},
[391]={-36,-99},
[392]={-81,-119},
[393]={-58,-121},
[394]={-61,-90},
[395]={-53,-101},
[396]={-60,-129},
[397]={-96,-171},
[398]={-113,-132},
[399]={-110,-129},
[400]={-47,-109},
[401]={-46,-144},
[402]={-24,-108},
[403]={-39,-115},
[404]={-135,-164},
[405]={-49,-137},
[406]={-69,-120},
[407]={-100,-169},
[408]={-133,-166},
[409]={-49,-128},
[410]={-49,-119},
[411]={-44,-115},
[412]={-35,-99},
[413]={-55,-107},
[414]={-62,-138},
[415]={-12,-218},
[416]={-15,-168},
[417]={-43,-149},
[418]={-50,-245},
[419]={-60,-113},
[420]={-33,-178},
[421]={-45,-127},
[422]={-35,-108},
[423]={-57,-177},
[424]={-66,-323},
[425]={-68,-192},
[426]={-34,-206},
[427]={-22,-130},
[429]={-69,-286},
[430]={-13,-152},
[431]={-22,-102},
[432]={-33,-103},
[433]={-41,-85},
[434]={-27,-48},
[435]={-18,-78},
[436]={-36,-103},
[437]={-18,-90},
[439]={-63,-133},
[440]={-58,-152},
[441]={-23,-105},
[442]={-50,-141},
[443]={-46,-112},
[444]={-90,-124},
[445]={-71,-134},
[446]={-62,-154},
[447]={-74,-171},
[448]={-37,-129},
[449]={-73,-165},
[450]={-46,-126},
[451]={-26,-129},
[452]={-7,-83},
[453]={-55,-140},
[454]={-62,-129},
[455]={-36,-111},
[456]={-27,-110},
[457]={-29,-108},
[458]={-37,-132},
[459]={-47,-128},
[460]={-50,-132},
[461]={-29,-142},
[461]={-16,-143},
[462]={-39,-98},
[463]={-59,-163},
[464]={-45,-98},
[465]={-24,-86},
[466]={-25,-97},
[467]={-44,-109},
[468]={-29,-95},
[469]={-42,-102},
[470]={-46,-90},
[471]={-30,-89},
[472]={-29,-93},
[473]={-53,-98},
[474]={-70,-103},
[475]={-28,-108},
[476]={-44,-190},
[477]={-72,-133},
[478]={-54,-134},
[479]={-27,-105},
[480]={-41,-115},
[481]={-39,-105},
[482]={-45,-111},
[483]={-31,-102},
[484]={-25,-95},
[485]={-51,-140},
[486]={-55,-116},
[487]={-71,-109},
[488]={-113,-129},
[489]={-58,-124},
[490]={-46,-109},
[491]={-33,-126},
[492]={-34,-96},
[493]={-35,-95},
[494]={-50,-117},
[495]={-50,-119},
[496]={-60,-167},
[497]={-63,-130},
[498]={-39,-108},
[499]={-87,-165},
[500]={-106,-174},
[501]={-77,-146},
[502]={-59,-128},
[503]={-75,-142},
[504]={-74,-134},
[505]={-53,-165},
[506]={-71,-149},
[507]={-47,-107},
[508]={-52,-118},
[509]={-49,-109},
[510]={-69,-125},
[511]={-63,-114},
[512]={-58,-121},
[513]={-68,-128},
[514]={-109,-156},
[515]={-57,-146},
[516]={-102,-162},
[517]={-218,-174},
[518]={-41,-106},
[519]={-47,-106},
[520]={-65,-107},
[521]={-50,-139},
[522]={-46,-136},
[523]={-54,-155},
[524]={-42,-124},
[525]={-14,-97},
[527]={-42,-107},
[528]={-33,-95},
[529]={-52,-126},
[530]={-17,-101},
[531]={-34,-101},
[532]={-30,-103},
[533]={-24,-94},
[534]={-68,-97},
[535]={-23,-78},
[536]={-32,-93},
[537]={-38,-108},
[538]={-11,-87},
[539]={-34,-110},
[540]={-38,-99},
[541]={-21,-127},
[542]={-24,-60},
[543]={-80,-145},
[544]={-37,-119},
[545]={-26,-103},
[547]={-30,-153},
[548]={-34,-142},
[549]={-12,-92},
[550]={-17,-71},
[551]={-20,-85},
[552]={-21,-92},
[553]={-29,-79},
[554]={-32,-46},
[555]={-29,-94},
[556]={-11,-88},
[557]={-12,-100},
[558]={-39,-99},
[559]={-22,-91},
[560]={-50,-110},
[561]={-21,-97},
[562]={-52,-115},
[563]={-26,-96},
[564]={-55,-68},
[565]={-26,-118},
[566]={-108,-152},
[567]={-40,-196},
[568]={-65,-51},
[569]={-58,-125},
[570]={-75,-111},
[571]={-87,-146},
[572]={-65,-131},
[573]={-45,-86},
[574]={-28,-86},
[575]={-174,-170},
[576]={-16,-125},
[577]={-48,-113},
[578]={-56,-129},
[579]={-48,-114},
[580]={-23,-124},
[581]={-76,-142},
[582]={-25,-97},
[583]={-33,-99},
[584]={-9,-80},
[585]={-11,-84},
[586]={-19,-85},
[587]={-18,-89},
[588]={-32,-98},
[589]={-37,-96},
[590]={-61,-123},
[591]={-35,-97},
[592]={-32,-117},
[593]={-30,-114},
[594]={-21,-107},
[595]={-26,-113},
[597]={-91,-131},
[598]={-60,-44},
[599]={-140,-184},
[600]={-21,-85},
[601]={-28,-85},
[602]={-37,-94},
[603]={-51,-105},
[604]={-51,-98},
[605]={-51,-120},
[606]={-51,-147},
[608]={-72,-123},
[609]={-67,-130},
[610]={-28,-96},
[611]={-64,-142},
[612]={-69,-331},
[613]={-74,-313},
[614]={-16,-97},
[615]={-15,-96},
[616]={-16,-116},
[617]={-55,-125},
[618]={-28,-108},
[619]={-30,-120},
[620]={-20,-139},
[621]={-39,-134},
[622]={-33,-65},
[623]={-29,-62},
[624]={-28,-82},
[625]={-27,-42},
[626]={-28,-72},
[627]={-33,-65},
[628]={-13,-76},
[629]={-47,-85},
[630]={-29,-93},
[631]={-9,-76},
[632]={-19,-41},
[633]={-46,-69},
[633]={-49,-88},
[634]={-56,-91},
[635]={-52,-100},
[636]={-18,-227},
[637]={-16,-180},
[638]={-61,-198},
[639]={-38,-139},
[640]={-50,-104},
[641]={-71,-91},
[642]={-53,-105},
[643]={-34,-150},
[644]={-42,-110},
[645]={-37,-44},
[646]={-79,-103},
[647]={-79,-58},
[648]={-76,-146},
[649]={-62,-150},
[650]={-84,-158},
[651]={-92,-118},
[652]={-94,-101},
[653]={-110,-161},
[654]={-39,-107},
[655]={-75,-138},
[656]={-14,-168},
[657]={-52,-92},
[658]={-39,-80},
[659]={-79,-102},
[660]={-46,-117},
[661]={-80,-130},
[662]={-62,-126},
[663]={-114,-74},
[664]={-97,-119},
[665]={-16,-83},
[666]={-19,-96},
[667]={-40,-102},
[668]={-42,-109},
[669]={-40,-118},
[670]={-31,-116},
[671]={-31,-121},
[672]={-15,-106},
[673]={-25,-87},
[674]={-23,-141},
[675]={-37,-163},
[676]={-63,-134},
[677]={-7,-81},
[678]={-11,-88},
[679]={-6,-73},
[680]={-18,-94},
[681]={-21,-83},
[682]={-20,-96},
[683]={-11,-74},
[684]={-23,-101},
[685]={-20,-167},
[686]={-16,-94},
[687]={-31,-106},
					};
    
	NEft_OffsetX={};
	NEft_OffsetY={};
	local ii=0
	for i=0,420 do
			for j=0,CC.Effect[i]-1 do
				if type(CC.NEft_Offset[i])~='table' then
					NEft_OffsetX[ii+j]=0;
					NEft_OffsetY[ii+j]=0;
				else
					NEft_OffsetX[ii+j]=CC.NEft_Offset[i][1];
					NEft_OffsetY[ii+j]=CC.NEft_Offset[i][2];
				end
			end
		ii=ii+CC.Effect[i]
	end
	
	CC.ExtraOffense={{106,57,100},             --武功武器配合增加攻击力， 依次为：武器物品id，武功id，攻击力增加
                   {107,49,50},
                   {108,49,50},
                   {110,54,80},
                   {115,63,50},
                   {116,67,70},
                   {119,68,100},}

    CC.NewPersonName="Tom.Hu";                --新游戏的数据
    CC.NewGameSceneID=70;                      --场景ID
    CC.NewGameSceneX=19;                       --场景坐标
    CC.NewGameSceneY=20;
    CC.NewGameEvent=2;                       --新游戏场景执行事件。如果没有，则看新游戏坐标后面有没有事件。
    CC.NewPersonPic=3466;                      --开始主角pic
	CC.Debug=false;
	CC.PASCODE=	{	
								"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
								"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
								".","\\","?","*","+","-",
							}
	
	
	CC.Teacher={
							[1]="华山派十三代掌门人，在江湖中侠名远播，嫉恶如仇，甚得人心，博得「君子剑」的好评。",
							[2]="华山女侠，「君子剑」岳不群之妻。颇具美貌，为人正派，慷慨大义，不为权势所逼。",
							[3]="华山「剑宗」高手，在嵩山派的支持下，逼迫岳不群退出华山，却被岳不群大弟子·令狐冲击败，从此隐退不再出山。",
							[10]="华山派岳不群的第三个弟子。后在白马寺中被左冷禅手下所杀。",
							[14]="华山派掌门人岳不群和女侠宁中则的女儿，令狐冲最心爱的小师妹。",
							[27]="青城派掌门，为夺取「辟邪剑谱」而将福威镖局灭门。后死于林平之之手。",
							[49]="衡山派掌门，外号「潇湘夜雨」，莫大先生神出鬼没，一把胡琴奏的「潇湘夜雨」悲咽凄凉，令人难以忍泪。",
							[50]="衡山派高手，酷爱音律，擅长吹箫，传说其武功已不在其师兄莫大先生之下。",
							[51]="衡山派高手，外号「金眼雕」，曾以衡山派尊长的身份上华山问罪。",
							[66]="泰山派掌门，是五岳剑派少有的正人君子，嫉恶如仇，武功高强，内力深厚，但性子刚烈，缺乏应变能力。",
							[68]="泰山派，掌门天门道人师弟，在回雁楼被田伯光刺伤",
							[110]="嵩山派掌门，五岳盟主。虽然自称武林正道，但其人及其门派弟子，所作所为与禽兽无异，实为武林同道所不齿",
							[113]="嵩山派十三太保之一，外号「大嵩阳手」。血洗衡山·刘正风满门，后被「潇湘夜雨」莫大先生刺杀。",
							[131]="嵩山派第七太保，五岳并派之时，力举左冷禅为「五岳派」掌门",
							[149]="外号「万里独行」，江湖上恶名昭著的淫贼，后被不戒和尚所逼当了和尚，号「不可不戒」。其人恶行累累，性情却颇为磊落。",
							[173]="大理国皇帝，段正淳之兄，精通家传武学「一阳指」，后传位于段誉后避位为僧，法号「本尘」。",--段正明
							[177]="大理镇南王，性情风流，早年四处拈花惹草，结果私生的女儿成了儿子段誉的情人。嵩山大会上坚定支持萧峰，不失男子汉大丈夫气概。后因众情人被杀而自杀殉情。",--段正淳
							[178]="大理国镇南王妃。段正淳的元配、段誉的母亲。最后随段正淳自尽。",--刀白凤
							[194]="外号「修罗刀」、「幽谷客」，段正淳情妇之一，两人生有木婉清。后被慕容复所杀。",--秦红棉
							[195]="万劫谷谷主钟万仇之妻，未嫁前为段正淳之情妇，两人生有钟灵。后被慕容复所杀。",--甘宝宝
							--段正淳情妇之一，两人育有阿朱、阿紫。后被慕容复所杀。--阮星竹
							--未嫁前为段正淳情妇之一，两人生有王语嫣。后自愿死于慕容复剑下。--王夫人
							--丐帮副帮主马大元之妻，未嫁前为段正淳情妇之一。外表温顺，内里却是个不守妇道的淫妇，后被阿紫毁容，忧愤而死。--康敏
							[196]="大理国「镇南王」段正淳世子，由刀白凤所生，但生父是四大恶人中的段延庆。后继位大理国皇帝，登基时年号日新。为乔峰、虚竹义弟（排第三）。",
							[197]="段正淳与情妇甘宝宝之女，养有一只闪电貂，单恋段誉。在少室山乔峰故居与段誉重逢。",--钟灵
							[200]="段正淳与情妇秦红棉之女，初与段誉相恋。在被告知自己与段誉是同父异母的兄妹后，悲愤离去。后在西夏与段誉重逢。",--木婉清
							[261]="丐帮帮主，武林素称「北乔峰」，虚竹与段誉的义兄。因为是契丹后裔而被武林中人唾弃，后恢复契丹名萧峰。在阻止辽入侵宋后，自尽于雁门关。",--，在相救辽国皇帝耶律洪基以后被册封为南院大王，再后来又加封宋王，平南大元帅
							[281]="丐帮长老之一。君山丐帮大会时，对黄蓉被洪七公代为帮主，一开始不信，交手下来后由疑惑转为支持。",
							[320]="「姑苏慕容」收藏天下各门各派武学之地。",--还施水阁
							[321]="慕容复之父，与儿子同欲图谋兴复大业，城府极深。当年雁门关一役因其乱报谎言而起。后皈依佛门。",--慕容博
							[322]="与乔峰齐名的「南慕容」，十六国前燕王孙，父亲为慕容博，日夜图谋复国，机关算尽，不果，终至精神失常。",--慕容复
							[323]="慕容家将，外号「非也非也」,后为慕容复所杀。",--包不同
							[324]="慕容家将，外号「江南第二」，后在慕容复杀死包不同后离去。",--公冶乾
							[325]="慕容家将，外号「江南一阵风」，后在慕容复杀死包不同后离去。",--风波恶
							[326]="慕容家将，后在慕容复杀死包不同后离去。",--邓百川
							[327]="段正淳与情妇阮星竹之女，善易容，原为慕容复侍女，后与乔峰相爱，为阻止乔峰与段正淳冲突，甘愿舍身被乔峰失手打死",--阿朱
							[328]="为慕容复侍女，暗恋慕容复。最后看破红尘，在大理陪伴精神失常的慕容复。",--阿碧
							[330]="段正淳与情妇王夫人之女，表哥为慕容复。绝世美女，单恋表哥，被表哥弃之不顾，后与段誉相恋，知道段誉为其哥哥。",--王语嫣
							[378]="「崆峒五老」排行第三，修炼崆峒绝学「七伤拳」，功力深厚。",
							[409]="昆仑派高手，外号「一剑乾坤」。「屠狮大会」昆仑派掌门夫妇战死后，接任昆仑掌门。",
							[433]="「全真七子」之首，号「丹阳子」。武功高强，救危济困，行侠仗义，为人宽厚仁和。曾经传授郭靖「金雁功」，可以说是郭靖真正的启蒙恩师。",--马钰
							[434]="「全真七子」之一，号「玉阳子」。是一位文武双全、仗义疏财、生死与共的豪侠。郭靖「比武招亲」之时曾出手相救。",--王处一
							[435]="「全真七子」之一，武艺出众，号「长春子」。为救忠良之后，赌斗「江南七怪」，收徒杨康。",--丘处机
							[436]="「全真七子」之一，号「长生子」。是七子中最没存在感的一位。",--刘处玄
							[437]="「全真七子」之一，号「清静散人」。出家前乃马钰之妻。收徒程瑶迦。",--孙不二
							[438]="「全真七子」之一，号「长真子」。牛家村七子斗东邪之时，被「西毒」欧阳峰偷袭而亡。",--谭处端
							[439]="「全真七子」之一，号「广宁子」。为劫回杨过，误杀孙婆婆。",--郝大通
							[1801]="华拳门天字派高手，姬老三之子。",
							[1807]="韦陀门高手，和师兄万鹤声并称「韦陀双鹤」。中田归农奸计造成苗人凤双目失明，后悔不已，杀张飞雄，自废双目以慰苗大侠。",
						};
	
	
	
   CC.PersonAttribMax={};             --人物属性最大值
   CC.PersonAttribMax["经验"]=999999;
   CC.PersonAttribMax["修炼点数"]=99999;
   CC.PersonAttribMax["生命最大值"]=9999;
   CC.PersonAttribMax["生命MAX"]=9999;
   CC.PersonAttribMax["流血"]=100;
   CC.PersonAttribMax["中毒"]=100;
   CC.PersonAttribMax["内伤"]=100;
   CC.PersonAttribMax["内力最大值"]=9999;
   CC.PersonAttribMax["内力MAX"]=9999;
   CC.PersonAttribMax["体力"]=100;
   CC.PersonAttribMax["品德"]=100;
   CC.PersonAttribMax["友好"]=100;
   CC.PersonAttribMax["拳掌"]=100;
   CC.PersonAttribMax["御剑"]=100;
   CC.PersonAttribMax["耍刀"]=100;
   CC.PersonAttribMax["枪棍"]=100;
   CC.PersonAttribMax["暗器"]=100;
   CC.PersonAttribMax["修为"]=100;
   CC.PersonAttribMax["资质"]=100;
   CC.PersonAttribMax["力量"]=100;
   CC.PersonAttribMax["根骨"]=100;
   CC.PersonAttribMax["机敏"]=100;
   CC.PersonAttribMax["福缘"]=100;

    CC.WarDataSize=186;         --战斗数据大小  war.sta数据结构
    CC.WarData_S={};        --战斗数据结构
    CC.WarData_S["代号"]={0,0,2};
    CC.WarData_S["名称"]={2,2,10};
    CC.WarData_S["地图"]={12,0,2};
    CC.WarData_S["经验"]={14,0,2};
    CC.WarData_S["音乐"]={16,0,2};
    for i=1,6 do
        CC.WarData_S["手动选择参战人"  .. i]={18+(i-1)*2,0,2};
        CC.WarData_S["自动选择参战人"  .. i]={30+(i-1)*2,0,2};
        CC.WarData_S["我方X"  .. i]={42+(i-1)*2,0,2};
        CC.WarData_S["我方Y"  .. i]={54+(i-1)*2,0,2};
    end
    for i=1,20 do
        CC.WarData_S["敌人"  .. i]={66+(i-1)*2,0,2};
        CC.WarData_S["敌方X"  .. i]={106+(i-1)*2,0,2};
        CC.WarData_S["敌方Y"  .. i]={146+(i-1)*2,0,2};
    end

    CC.WarWidth=64;        --战斗地图大小
    CC.WarHeight=64;

	--显示主地图和场景地图坐标
	--如果显示坐标，则会增加cpu占用。机器速度慢的话可能会卡。这个在调试时有用。
	--注意: 如果设置了CONFIG.FastShowScreen=1，则场景视角范围超出后显示的坐标不正确。
	CC.ShowXY=1      --0 不显示 1 显示

	--以下为控制显示方式的参数

	--CC.RowPixel=4         -- 每行字的间距像素数

	CC.MenuBorderPixel=4  -- 菜单四周边框留的像素数，也用于绘制字符串的box四周留得像素
--[[
	if CONFIG.Type==0 then      --320*240显示方式
		CC.DefaultFont=16

		CC.StartMenuFontSize=16  --开始菜单字号

		CC.NewGameFontSize =16   --新游戏属性选择字号

		CC.MainMenuX=10;         --主菜单开始坐标
		CC.MainMenuY=10;

		CC.GameOverX=90;
		CC.GameOverY=65;

        CC.PersonStateRowPixel= 1;    --显示人物状态行间距像素

	elseif CONFIG.Type==1 then  --640*480显示方式
		CC.DefaultFont=24;

		CC.StartMenuFontSize=32;

		CC.NewGameFontSize =24;

		CC.MainMenuX=10;
		CC.MainMenuY=10;

		CC.GameOverX=255;
		CC.GameOverY=165;

        CC.PersonStateRowPixel= 4;  --显示人物状态行间距像素

	end
	]]--
	CC.FontBIG=math.modf(math.min(CC.ScreenW,CC.ScreenH)/12)	--最大，未使用	640x480时size=40
	CC.FontBig=math.modf(math.min(CC.ScreenW,CC.ScreenH)/15)	--较大，游戏开始菜单使用	640x480时size=32
	CC.Fontbig=math.modf(math.min(CC.ScreenW,CC.ScreenH)/20)	--通常字号，对话菜单等使用	640x480时size=24
	CC.Fontsmall=math.modf(math.min(CC.ScreenW,CC.ScreenH)/24)	--稍小字号	640x480时size=20
	CC.FontSmall=math.modf(math.min(CC.ScreenW,CC.ScreenH)/30)	--较小字号	640x480时size=16
	CC.FontSMALL=math.modf(math.min(CC.ScreenW,CC.ScreenH)/40)	--最小字号	640x480时size=12
	CC.RowPixel=math.modf(math.min(CC.ScreenW,CC.ScreenH)/100)         -- 每行字的间距像素数
	
    CC.StartMenuY=CC.ScreenH-3*(CC.FontBig+CC.RowPixel)-20;
	CC.NewGameY=CC.ScreenH-4*(CC.Fontbig+CC.RowPixel)-10;

	CC.MainMenuX=10;
	CC.MainMenuY=10;
	--[[CC.MainSize=math.min(
							(CC.ScreenH*0.9-150-CC.RowPixel*2-CC.RowPixel*11-8)/12,
							math.max(
										(CC.ScreenW*0.9-150)/24,
										(CC.ScreenW*0.9)/31
									)							
						);
	local mainw=CC.MainSize*27+CC.RowPixel*6+CC.MenuBorderPixel*13;
	CC.MainX_L=(CC.ScreenW-mainw)/2;
	CC.MainX=CC.MainX_L+(CC.MainSize*4+CC.RowPixel)+CC.MenuBorderPixel*2;
	CC.MainX_R=CC.MainX_L+(CC.MainSize*4+CC.RowPixel)*5+CC.MenuBorderPixel*2*5;
	CC.MainY=CC.ScreenH/20;
	CC.MainY2=CC.MainY+CC.MainSize+8+CC.MenuBorderPixel*2;]]--
	CC.MainSize=math.modf(CC.ScreenW/24);
	CC.MainX_L=math.modf((CC.ScreenW-CC.MainSize*20-CC.RowPixel*4-CC.MenuBorderPixel*10)/2);
	CC.MainX=CC.MainX_L+(CC.MainSize*6+CC.RowPixel)+CC.MenuBorderPixel*2;
	CC.MainY=(CC.ScreenH-CC.MainSize-CC.MenuBorderPixel*4-160-(CC.Fontsmall+CC.RowPixel)*11)/2;--CC.ScreenH/20;
	CC.MainY2=CC.MainY+CC.MainSize+4+CC.MenuBorderPixel*2;
	--子菜单的开始坐标
	CC.MainSubMenuX=CC.MainMenuX+4*CC.MenuBorderPixel+2*CC.Fontbig+5;       --主菜单为两个汉字
	CC.MainSubMenuY=CC.MainMenuY;

	--二级子菜单开始坐标
	CC.MainSubMenuX2=CC.MainSubMenuX+4*CC.MenuBorderPixel+4*CC.Fontbig+5;   --子菜单为四个字符

	CC.SingleLineHeight=CC.Fontbig+2*CC.MenuBorderPixel+5;  --带框的单行字符高

	------------------------以下为物品菜单参数
	if CONFIG.Type==0 then
		CC.ThingFontSize = 16;

		CC.ThingPicWidth=40;    --物品图片宽高
		CC.ThingPicHeight=40;

		CC.MenuThingXnum=5      --一行显示几个物品
		CC.MenuThingYnum=3      --物品显示几列

		CC.ThingGapOut=10;      --物品图像显示四周留白
		CC.ThingGapIn=5;        --物品图像显示中间间隔

	elseif CONFIG.Type==1 then

		CC.ThingFontSize = 24;  --

		CC.ThingPicWidth=40;    --物品图片宽高
		CC.ThingPicHeight=40;

		CC.MenuThingXnum=10      --一行显示几个物品
		CC.MenuThingYnum=5      --物品显示几列

		CC.ThingGapOut=10;      --物品图像显示四周留白
		CC.ThingGapIn=10;        --物品图像显示中间间隔
	end


    --场景视角范围。超出此范围则只移动主角，场景不移动了。也就是主角不在屏幕中央了
	if CONFIG.Type==0 then      --320*240显示方式
        CC.SceneXMin=12
        CC.SceneYMin=12
        CC.SceneXMax=45;
        CC.SceneYMax=45;
	elseif CONFIG.Type==1 then
        CC.SceneXMin=11
        CC.SceneYMin=11
        CC.SceneXMax=47;
        CC.SceneYMax=47;
	end

	CC.SceneFlagPic={2749,2846}    --场景贴图中旗帜的贴图编号。

	if CONFIG.FastShowScreen==0 then
        CC.ShowFlag=1;                 --0 不显示旗帜动画 1 显示。不显示旗帜动画可以增加场景中主角不动时的显示速度
		if CONFIG.Type==1 then
            CC.AutoWarShowHead=1;          --1 战斗时一直显示头像 0 不显示。如果设为1，则战斗时将重绘整个屏幕，会降低显示速度。
		else
		    CC.AutoWarShowHead=0;
		end
	else
        CC.ShowFlag=0;
		CC.AutoWarShowHead=0;
	end

    CC.LoadThingPic=1           --读取物品贴图方式 0 从mmap/smap/wmap中读取  1 读取独立的thing.idx/grp
	CC.StartThingPic=0          --物品贴图在mmap/smap/wmap中的起始编号。CC.LoadThingPic=0有效

	CC.MapSize=23
	CC.MapKind=1
end
--[[
0	华山派(57)
1	青城派(36)
2	衡山派(58)
3	泰山派(29)
4	恒山派(31)
5	嵩山派(27)
6  福威镖局(56)
]]--