function Shurufa(x,y)
	local pinyin=""				--ÓÃÓÚ±£´æÆ´Òô×Ö·û´®
	local word=""				--ÓÃÓÚ±£´æÒÑÊäÈëµÄÎÄ±¾
	while true do
		local tmp;
		pinyin,tmp=GetPinyin(x,y,word)
			if tmp~=nil then word=tmp end
			if pinyin=="finish" then break;
			elseif pinyin~=-1 and pinyin~="" then
				word=word..SeleteHanzi(x,y,word,pinyin)
			end
	end
return word
end


function SeleteHanzi(x,y,word,pinyin)--Ñ¡×Ö
	local T1=
{
de=
{
"µÄ","µØ","µÃ","µÂ","µ×","ï½"
},
di=
{
"µÄ","µØ","µÚ","Ìá","µÍ","µ×","µÖ","µÜ","µÏ","µİ","µÛ","µĞ","µÌ","µÙ","µŞ","µÎ","µÓ","µÔ","æ·","µÑ","é¦","İ¶","ÚĞ","µÒ","Û¡","àÖ","íÆ","Ûæ","Ú®","µÕ","ïá","íÚ","÷¾","Øµ","èÜ","ç°","Ùá","ôÆ","íû","êë"
},
yi=
{
"Ò»","ÒÔ","ÒÑ","Òâ","Òé","Òå","Òæ","ÒÚ","Ò×","Ò½","ÒÕ","ÒÀ","ÒÆ","ÒÂ","Òì","ÒÁ","ÒÇ","ÒË","ÒÅ","ÒÉ","Òã","Òê","Òà","Òß","ÒÛ","Òä","ÒÖ","ÒÒ","Òë","Òí","Òç","ÒÎ","ÒÊ","Òİ","ÒÏ","ÒÄ","ÒØ","âù","Òï","ÒÍ","Òá","ÒÌ","ìÚ","êİ","ÒÓ","ÒÙ","ÒÃ","ÒĞ","Òè","ÒÈ","ŞÈ","Òî","ŞÄ","éó","æä","Ò¼","â¢","ÒÜ","ß®","Ò¿","ì½","äô","åÆ","Øı","ñ´","Ú±","âø","ğê","Ü²","âÂ","á»","Ò¾","íô","ï×","Øî","÷ğ","ÒŞ","ßŞ","ôè","ŞÚ","çË","ß½","Ø×","ß×","áÚ","ôà","îÆ","éì","Üè","Ş²","òæ","ïî","àæ","ñ¯","ÜÓ","ã¨","àÉ","ğù","ì¥","Ù«","Ûü","Ûİ","ô¯","ôı","Øæ"
},
guo=
{
"¹ú","¹ı","¹û","¹ù","¹ø","¹ü","àş","ÎĞ","é¤","òå","ë½","ñø","Ûö","Şâ","â£","áÆ","òä","ßÃ","Ùå"
},
zai=
{
"ÔÚ","ÔÙ","ÔÖ","ÔØ","ÔÔ","×Ğ","Ô×","ÔÕ","áÌ","çŞ"
},
ren=
{
"ÈË","ÈÎ","ÈÏ","ÈÊ","ÈÌ","ÈÍ","ÈĞ","ÈÒ","â¿","ÈÑ","Üó","ïş","ÈÉ","Øğ","éí","ñÅ","İØ"
},
le=
{
"ÁË","ÀÖ","ÀÕ","Àß","ß·","÷¦","Øì","ãî"
},
liao=
{
"ÁË","ÁÏ","ÁÆ","ÁÉ","ÁÎ","ÁÄ","ÁÈ","ÁÅ","ÁÇ","çÔ","ÁÌ","ÁÃ","àÚ","ÁÊ","ÁÍ","å¼","Ş¤","â²","îÉ","ŞÍ","ğÓ"
},
you=
{
"ÓĞ","ÓÉ","ÓÖ","ÓÅ","ÓÎ","ÓÍ","ÓÑ","ÓÒ","ÓÊ","ÓÈ","ÓÇ","Ó×","ÓÌ","ÓÕ","ÓÆ","ÓÄ","ÓÓ","ÓÔ","èÖ","ÓË","öÏ","àó","ÓÏ","Øü","÷î","İ¬","éà","òö","ğà","ßÏ","òÊ","İµ","İ¯","îğ","å¶","ôí","ØÕ","ë»","÷ø","òø","ŞÌ","òÄ","Ù§"
},
zhong=
{
"ÖĞ","ÖØ","ÖÖ","ÖÚ","ÖÕ","ÖÓ","ÖÒ","ÖÙ","ÖÔ","Ö×","õà","Ú£","ÖÑ","âì","ïñ","ô±","ó®"
},
shi=
{
"ÊÇ","ÊĞ","Ê±","Êµ","ÊÂ","Ê®","Ê¹","ÊÀ","Ê©","Ê½","ÊÆ","ÊÓ","Ê¶","Ê¦","Ê·","Ê¾","Ê¯","Ê³","Ê¼","Ê¿","Ê§","ÊÊ","ÊÔ","Ê²","ÊÒ","ËÆ","Ê«","ÊÎ","Ö³","ÊÍ","Ê»","ÊÏ","ÊÅ","Êª","Ê´","Ê¨","ÊÄ","Ê°","Ê¬","³×","ÊË","ÊÁ","Ê¸","ÖÅ","ÊÌ","ÊÉ","ÊÈ","ÊÃ","Ğê","Êº","ÊÑ","éø","Ê­","óÂ","İª","îæ","ÚÖ","ìÂ","õ¹","öå","ó§","õ§","óß","Ûõ","ß±","İé","öõ","êÛ"
},
nian=
{
"Äê","Äî","Äğ","Õ³","Äë","Ø¥","Äí","Äì","Äé","Äè","öó","Ûş","öÓ","éı","ğ¤"
},
he=
{
"ºÍ","ºÏ","ºÓ","ºÎ","ºË","ºØ","ºÈ","ºÕ","ºÉ","ºĞ","º×","ÏÅ","ºÇ","ºÌ","ºÊ","ÛÖ","ºÖ","ºÔ","ºÒ","ãØ","ÛÀ","Ú­","ò¢","àÀ","ºÑ","êÂ","ôç","æü","òÂ","îÁ"
},
hu=
{
"ºÍ","»¤","»§","ºË","ºş","»¥","ºõ","ºô","ºú","Ï·","ºö","»¢","»¦","ºı","ºø","ºù","ºü","ºû","»¡","º÷","ä°","ğÀ","çú","ìè","»£","äï","ã±","ìï","àñ","õú","óË","õ­","â©","âï","ßü","ìæ","éÎ","ì²","ìÎ","ğÉ","Ùü","ğ­","á²","ğ×","ìÃ","éõ"
},
huo=
{
"ºÍ","»î","»ò","»õ","»ñ","»ğ","»ï","»ó","»ô","»ö","»í","àë","Ş½","ïÁ","ó¶","îØ","ñë","ïì","â·","Øå","ß«"
},
da=
{
"´ó","´ï","´ò","´ğ","Ëş","´î","í³","´ñ","àª","ßÕ","ŞÇ","÷²","ğã","÷°","ñ×","óÎ","âò","æ§"
},
dai=
{
"´ó","´ú","´ø","´ı","´û","´÷","´ü","´õ","´ô","´ş","á·","´ö","µ¡","´ù","÷ì","ß°","Ü¤","çª","çé","ß¾","åÊ","ææ"
},
ye=
{
"Òµ","Ò²","Ò¹","Ò¶","Ò°","Òº","Ò±","Ò³","Ò¯","Ò®","Ğ°","ÑÊ","Ò¬","»©","ìÇ","Ò´","×§","Ò·","êÊ","ÚË","Ò¸","Ò­","ŞŞ","ØÌ","Úş","îô"
},
bu=
{
"²»","²¿","²½","²¼","²¹","²¶","±¤","ÆÒ","²·","²º","²¾","²¸","²À","îĞ","ß²","ê³","åÍ","êÎ","õ³","îß"
},
wei=
{
"Îª","Î»","Î¯","Î´","Î¬","ÎÀ","Î§","Î¥","Íş","Î°","Î£","Î¶","Î¢","ÒÅ","Î¨","Î½","Î±","Î¿","Î²","Îº","Î¤","Î¸","Î·","á¡","Î¹","Î¡","Î®","Îµ","Î³","Î«","Î¾","Î¼","Î©","Ş±","Î­","ì¿","Û×","æ¸","ÚÃ","çâ","áË","Î¦","ÙË","åÔ","â«","àí","İÚ","Úó","ğô","â¬","ä¶","áÍ","è¸","ìĞ","ôº","àø","ãÇ","ä¢","ãí","Úñ","öÛ","ê¦"
},
fa=
{
"·¢","·¨","·£","·¦","·¥","·§","·¤","íÀ","ÛÒ","·©"
},
hui=
{
"»á","»Ø","»Ó","»ã","»İ","»Ô","»Ö","»Õ","»æ","»Ù","»Û","»Ò","»ß","»Ü","»Ú","»²","»à","À£","Üö","êÍ","åç","»ä","»å","çõ","¶é","Ú¶","Ş¥","»Ş","÷â","»â","Üî","à¹","èí","»×","ä§","ä«","ò³","í£","ó³","ßÔ","ãÄ","çÀ","ßÜ"
},
kuai=
{
"»á","¿ì","¿é","¿ê","ëÚ","Øá","¿ë","ä«","Û¦","áö","ßà"
},
gong=
{
"¹¤","¹«","¹²","¹©","¹¦","ºì","¹±","¹¥","¹¬","¹®","¹¨","¹§","¹°","¹ª","¹­","¹¯","ò¼","çî","ö¡","ëÅ"
},
jing=
{
"¾­","¾©","¾«","¾³","¾º","¾°","¾¯","¾¹","¾®","¾ª","¾¶","¾²","¾¢","¾´","¾»","¾µ","¾¦","¾§","¾£","¾¤","¾¸","ãş","ã½","¾¨","¾¥","ëæ","İ¼","ëÖ","Úå","ìº","¾¬","ö¦","¾·","ÙÓ","åÉ","æº","ëÂ","ØÙ","åò","â°"
},
shang=
{
"ÉÏ","ÉÌ","ÉĞ","ÉË","ÉÍ","ÌÀ","ÉÑ","ÉÊ","ÉÎ","Ûğ","õü","éä","ìØ","ç´"
},
yao=
{
"Òª","Ô¼","Ò©","Ñû","ÌÕ","Ò¡","Ò«","Ñü","Ò£","Ò¦","Ò¤","Ñş","Ò§","Ò¢","Ô¿","Ò¥","ëÈ","Ø²","½Ä","ßº","Å±","Ñı","çÛ","èÃ","Ò¨","ñº","ê×","ğÎ","Ø³","ôí","áæ","é÷","ï¢","÷¥","áÊ","çò"
},
ge=
{
"¸ö","ºÏ","¸÷","¸ï","¸ñ","¸è","¸ç","¸Ç","¸ô","¸î","¸ó","¸ê","¸ğ","¸ë","¸é","ÒÙ","¸ì","ô´","¸í","¸õ","÷À","¸ò","¿©","ÛÙ","ïÓ","ò¢","Øî","íÑ","àÃ","Øª","ëõ","æü","ñË","ë¡","Üª","ÛÁ","ò´"
},
chan=
{
"²ú","µ¥","²û","²ø","²ô","ìø","²ü","²ù","²õ","²ó","äı","ó¸","²ö","âã","æ¿","åî","êè","âÜ","ÚÆ","²÷","å¤","æö","åñ","ïâ","õğ","İÛ","Ùæ"
},
zhe=
{
"Õâ","Õß","×Å","Õã","ÕÛ","ÕÜ","Õá","ÕÚ","ÕŞ","éü","èÏ","Õà","ñŞ","òØ","Õİ","ğÑ","ÚØ","ô÷","ß¡","íİ"
},
chu=
{
"³ö","´¦","´¡","³õ","³ı","´¢","Ğó","´¥","³ş","³ø","³û","´£","³÷","³ú","ñÒ","³ü","³ù","âğ","ç©","´¤","Û»","òÜ","÷í","èÆ","õé","Ø¡","éË","ãÀ","èú"
},
xing=
{
"ĞĞ","Ê¡","ĞÔ","ĞÎ","ĞÍ","ĞË","ĞÇ","ĞÌ","ĞÒ","ĞÕ","ĞÑ","ĞÏ","ĞÓ","ĞÈ","ĞÉ","ã¬","Üş","Úê","ĞÊ","â¼","ß©","íÊ","Üô"
},
hang=
{
"ĞĞ","º½","º¼","Ïï","º»","¿Ô","çñ","ãì","ç¬","ñş"
},
heng=
{
"ĞĞ","ºâ","ºá","ºã","ºà","ºß","çñ","èì","Ş¿"
},
zuo=
{
"×÷","×ö","×ù","×ó","×ø","×ò","×ô","×Á","Ôä","´ê","´é","ìñ","×õ","ßò","àÜ","âô","óĞ","Úè","ëÑ"
},
sheng=
{
"Éú","Ê¡","Éù","Éı","Ê¤","Ê¢","³Ë","Ê¥","Ê£","Éü","Éş","óÏ","Éû","áÓ","êÉ","äÅ","íò"
},
jia=
{
"¼Ò","¼Ó","¼Û","¼Ù","¼Ñ","¼Ü","¼×","¼Î","¼Ö","¼İ","¼Ş","¼Ğ","¼Ú","¼Ø","ÇÑ","Ğ®","åÈ","Ù¤","¼Õ","ä¤","¼Ï","ê©","¼Ô","ğè","ïØ","óÕ","çì","áµ","ëÎ","ØÅ","ôÂ","Û£","İç","ñÊ","ğı","îò","õÊ","òÌ","í¢"
},
jie=
{
"¼Ò","½á","½â","¼Û","½ç","½Ó","½Ú","½ì","½é","½×","½Ö","½è","½Ü","½à","½Ø","½ã","½Ò","½İ","½Ù","½ä","½Ô","½ß","½Û","½ë","¿¬","½Õ","½Ş","½å","Ş×","½æ","Úµ","íÙ","àµ","ò¡","ò»","æİ","æ¼","ğÜ","èî","Ú¦","½ê","ÙÊ","ôÉ","à®","öÚ","÷º"
},
cheng=
{
"³É","³Ì","³Ç","³Ğ","³Æ","Ê¢","³Ë","³Ï","³Ê","³Í","³Å","³Î","³Ó","³È","³Ò","³Ñ","îª","Ø©","îõ","Ûô","ëó","àá","òÉ","èß","îñ","õ¨","ñÎ","èÇ"
},
dao=
{
"µ½","µÀ","µ¼","µº","µ¹","µ¶","µÁ","µ¾","µ¸","µ¿","µ·","ß¶","µ»","ìâ","ë®","ôî","àü","âá"
},
ri=
{
"ÈÕ"
},
min=
{
"Ãñ","Ãô","Ãö","ãÉ","Ãó","ãı","áº","Ãõ","çë","Ãò","ö¼","çÅ","çä","íª","Üå","÷ª"
},
lai=
{
"À´","À³","Àµ","íù","áâ","ô¥","äµ","êã","äş","ñ®","áÁ","ïª"
},
wo=
{
"ÎÒ","ÎÕ","ÎÑ","ÎÖ","ÎÔ","ÎÎ","ÎĞ","ÎÓ","ä×","á¢","ÎÏ","à¸","ÙÁ","İ«","ö»","ë¿","íÒ"
},
dui=
{
"¶Ô","¶Ó","¶Ø","¶Ò","¶Ñ","íÔ","í¡","í­"
},
jin=
{
"½ø","½ğ","½ñ","½ü","½ö","½ô","¾¡","½ò","½ï","½û","½õ","¾¢","½ú","½÷","½î","½í","½ş","½ó","½ù","èª","½ı","çÆ","êî","İÀ","âË","İ£","àä","âÛ","æ¡","éÈ","êá","ñÆ","Úá"
},
duo=
{
"¶à","¶È","¶á","¶ä","¶ã","îì","ßÍ","¶é","¶æ","ÍÔ","¶â","¶è","¶ß","õâ","¶å","¶Ş","¶ç","èŞ","ç¶","ãõ","ñÖ","ßá"
},
quan=
{
"È«","È¨","È¯","Èª","È¦","È­","È°","È®","îı","È¬","Ú¹","Üõ","È©","òé","È§","ç¹","óÜ","÷Ü","ãª","éú","î°"
},
jian=
{
"½¨","¼ä","¼ş","¼û","¼á","¼ì","½¡","¼à","¼õ","¼ò","¼è","¼ù","¼æ","¼ø","¼ü","½¥","¼í","½£","¼â","¼ç","½¢","¼ö","¼ı","Ç³","¼ô","¼ó","¼î","¼ë","¼é","¼ß","¼ğ","¼ñ","¼å","¼ú","½¦","¼÷","½§","¼ã","ÚÉ","½¤","ïµ","¼ê","íú","åÀ","å¿","ëì","İÑ","ôå","ê¯","ë¦","óÈ","êù","¼ï","÷µ","êğ","èÅ","äÕ","öä","àî","ñĞ","õİ","Şö","çÌ","ğÏ","İó","ÚÙ","ÙÔ","ê§","õÂ","é¥"
},
ta=
{
"Ëû","Ëü","Ëı","ÍØ","Ëş","Ì¤","Ëú","é½","í³","äğ","Ì¡","àª","Ì¢","Ì£","õÁ","åİ","îè","÷£","äâ","ãË"
},
kai=
{
"¿ª","¿­","¿®","¿¬","âı","¿«","ïÇ","îø","âé","Ûî","ØÜ","ï´","İÜ"
},
men=
{
"ÃÇ","ÃÅ","ÃÆ","ŞÑ","ìË","í¯","îÍ"
},
chang=
{
"³¡","³¤","³§","³£","³¥","²ı","³ª","³©","³«","³¢","³¦","³¨","ÌÈ","²ş","æ½","ÉÑ","áä","êÆ","âê","æÏ","İÅ","öğ","ãÑ","Øö","ÜÉ","ë©","ã®","ÛË"
},
zhan=
{
"Õ¹","Õ½","Õ¼","Õ¾","Õ¸","Õ³","Õ¿","Õ´","Õ°","²ü","Õ²","Õ¶","Õµ","Õ·","ÕÀ","Õ±","Õ»","Õº","ì¹","ÚŞ","Şø"
},
li=
{
"Àí","Á¦","Àû","Á¢","Àï","Àî","Àú","Àı","Àë","Àø","Àñ","Àö","Àè","Á§","À÷","Àå","Á£","Àò","Àæ","Á¥","Àõ","Àó","Á¤","Àç","Àì","Á¨","Àê","Ş¼","î¾","Àé","Àğ","íÂ","Àô","å¢","Àş","æê","äà","Àù","İ°","ï®","óÒ","ó»","òÃ","Á¡","ö¨","Ù³","Àü","õ·","èİ","Ûª","Ùµ","èÀ","à¬","åÎ","æ²","ğ¿","ìå","à¦","ÛŞ","ğİ","òÛ","÷ó","áû","Øª","ôÏ","İñ","ß¿","õÈ","ğß","çÊ","öâ","÷¯","æË","îº","ã¦","ÜÂ","óö","éö"
},
xin=
{
"ĞÂ","ĞÄ","ĞÅ","Ñ°","ĞÁ","ĞÀ","Ğ½","Ü°","öÎ","Ğ¾","Ğ¿","ĞÃ","ê¿","ĞÆ","ì§","Ø¶","ïâ"
},
fang=
{
"·½","·Å","·¿","·À","·Ã","·Ä","·¼","·Â","·»","·Á","·¾","Úú","ô³","áİ","èÊ","öĞ","îÕ"
},
zhu=
{
"Ö÷","Êõ","×¡","×¢","Öú","Êô","Öğ","Öø","Öş","×¤","Öì","Öé","×£","Öí","Öî","Öù","Öñ","Öı","Öê","Öõ","Öö","Öü","Öó","Öò","ñÒ","Öë","Öô","îù","ä¨","óÃ","Öû","ä¾","Øù","èÌ","Ùª","Öï","Üï","óç","ìÄ","õî","ôã","äó","Û¥","éÆ","ô¶","éÍ","ğñ","÷æ","ğæ"
},
qi=
{
"Æó","Æä","Æğ","ÆÚ","Æø","Æß","Æ÷","Æû","Ææ","Æë","Æô","Æì","Æå","ÆŞ","Æú","Æç","ÆÛ","Æï","Æõ","Æù","Ø½","Æá","Æİ","Æñ","»ü","áª","çù","ÆÜ","¼©","ç÷","Æü","Æò","Æö","Æî","Æé","ç²","ì÷","õè","Æí","Æà","ä¿","è½","Æê","÷è","Ûß","á«","í¬","ÜÎ","Ù¹","Æè","Üù","êÈ","İİ","Æã","İÂ","æë","÷¢","ôë","Æı","Ş­","á¨","ñı","ØÁ","íÓ","Æâ","ãà","ôì","İ½","àÒ","òÓ","éÊ","ì¥","Ü»","èç","òà"
},
zi=
{
"×Ê","×Ô","×Ó","×Ö","×É","×Ì","×Ğ","×Ë","×Ï","×È","×Î","×Í","×Ñ","è÷","öö","×Õ","æ¢","Ö¨","ïö","í§","æÜ","ö¤","×Ò","ïÅ","ê¢","ôô","ö·","êß","íö","ç»","ßÚ","óÊ","ÚÑ","áÑ","÷Ú","Üë","ôÒ","õş","ñè"
},
xue=
{
"Ñ§","Ñª","Ñ©","Ï÷","Ñ¦","Ñ¨","Ñ¥","ÚÊ","àå","÷¨","õ½","í´"
},
bao=
{
"±¨","±£","°ü","±¦","±©","°û","±¡","±¬","ÅÚ","±¥","±§","±¤","°ş","±«","ÆØ","İá","ÆÙ","±ª","ÅÙ","°ı","±¢","æß","°ú","ìÒ","ñÙ","õÀ","ğ±","öµ"
},
zhi=
{
"ÖÆ","Ö®","ÖÎ","ÖÊ","Ö°","Ö»","Ö¾","ÖÁ","Ö¸","Ö¯","Ö§","Öµ","Öª","Ê¶","Ö±","ÖÂ","Ö´","ÖÃ","Ö¹","Ö²","Ö½","ÖÇ","Ö³","ÖÈ","Ö¼","Ö·","ÖÍ","ÊÏ","Ö¦","Ö¥","Ö¬","ÖÄ","Ö­","Ö«","Ö¿","ÖÉ","õ¥","ÖÀ","ÖÅ","ÖË","èÎ","Ö¶","ÜÆ","ÖÏ","åë","Ö¨","Öº","ÖÌ","Ö©","Û¤","èä","ïô","ìí","Úì","ğë","òÎ","àù","è×","õÜ","áç","ëÕ","èÙ","êŞ","ìó","õô","ğº","Şı","éò","Ø´","éù","åé","ö£","ôê","õÅ","Ûú","íé","âå","æï","ëù","õÙ"
},
zheng=
{
"Õş","Õı","Ö¤","Õù","Õû","Õ÷","Ö£","¶¡","Ö¢","Õõ","Õô","Õö","ï£","óİ","Õü","Ö¡","á¿","Õú","Úº","Õø","áç","îÛ"
},
ji=
{
"¼Ã","»ú","Æä","¼¼","»ù","¼Ç","¼Æ","Ïµ","¸ï","ÆÚ","¼Ê","¼°","¼¯","¼¶","¼¸","¸ø","»ı","¼«","¼º","¼Í","¼´","¼Ì","»÷","¼È","¼¤","¼¨","¼±","Ææ","¼ª","¼¾","Æë","¼²","¼£","¼¦","¼Á","¼­","¼®","¼Ä","¼·","»ø","¼½","Ø½","¼Å","ôß","¼¹","õÒ","¼¡","»ü","¼É","¼¢","¼À","¼©","¼¬","í¶","¼³","»û","¼§","½å","ñ¤","æ÷","î¿","¼Ë","¼¥","ğ¢","¼»","¼Â","¼µ","á§","ß´","¼¿","öê","Úµ","é®","Üù","êª","»ş","ö«","ïú","êé","÷ä","çÜ","çá","óÅ","ê÷","Ü¸","ßó","åì","÷Ù","ê«","Ù¥","ÙÊ","óÇ","õÕ","İğ","ØÀ","ßÒ","êå","áÕ","ò±","Şá","ì´","éê","öİ","ØŞ","ä©","Ø¢","ÛÔ","Şª","ÜÁ","ßâ"
},
yong=
{
"ÓÃ","ÓÀ","Óµ","ÓÂ","Ó¿","Ó¾","Ó¹","Ù¸","Ó»","Ó¶","Ó½","Óº","ğ®","ïŞ","Ó·","çß","Ó¼","ÓÁ","ã¼","ÛÕ","Ó¸","÷«","Ü­","÷Ó","à¯"
},
tong=
{
"Í¬","Í¨","Í³","Í¯","Í´","Í­","Í°","Í©","Í²","Í®","¶±","Ù¡","äü","Í±","Íª","íÅ","Í«","âú","á¼","ÙÚ","¶²","àÌ","Ûí","Üí"
},
yu=
{
"ÓÚ","Óë","Óı","Óà","Ô¤","Óò","Óè","Óö","Óï","Óş","Óñ","Óã","Óê","Óæ","Ô£","¹È","Óú","Óé","Óû","Óõ","Óß","Óî","Óğ","Óâ","Ô¥","Óô","Ô¢","Óü","Ó÷","Óù","Ô¡","Óä","Óí","Óá","Îµ","ÓÜ","ÓŞ","Óå","Î¾","ÓÙ","Óİ","Óì","Óø","Öà","Ô¦","è¤","Ø®","Ø¹","îÚ","Óç","Óó","ìÙ","ğö","ÓØ","ìÏ","êÅ","ì¶","ô§","ÓÛ","í²","óÄ","İÇ","åı","ëé","àô","ÚÍ","êì","Şí","ö¹","ÚÄ","Ù¶","âÅ","â×","æ¥","ğõ","å÷","ì£","ëò","ğÖ","ãĞ","áÎ","ö§","ğÁ","İÒ","àö","òâ","Øñ","æú","ñ¾","ñÁ","âÀ","İ÷","áü","ô¨","òõ","ìÛ"
},
gao=
{
"¸ß","¸æ","¸ã","¸å","¸à","¸â","¸ä","¸Ş","¸á","ï¯","ê½","Û¬","Øº","Ú¾","Ş»","¸İ","çÉ","éÂ","éÀ"
},
zhang=
{
"³¤","ÕÅ","ÕÂ","ÕÏ","ÕÇ","ÕÆ","ÕÊ","ÕÍ","ÕÃ","ÕÉ","ÕÌ","ÕÄ","ÕÁ","ÕË","ÕÈ","è°","áÖ","Øë","ÕÎ","ó¯","â¯","á¤","Ûµ","æÑ"
},
xian=
{
"ÏÖ","ÏÈ","ÏØ","¼û","Ïß","ÏŞ","ÏÔ","ÏÕ","Ï×","ÏÊ","Ï´","ÏÜ","ÏË","Ïİ","ÏĞ","ÏÍ","ÏÉ","ÏÎ","ÏÆ","ÏÌ","ÏÓ","ÏÛ","ÏÒ","ÏÙ","ğï","æµ","ÏÏ","ÏÚ","õ£","Ï³","Ùş","ÏÑ","åß","ôÌ","ÏÇ","ÜÈ","ò¹","õÑ","á­","Şº","ìŞ","ğÂ","ë¯","İ²","ö±","õĞ","áı","ìì","óÚ"
},
ben=
{
"±¾","±¼","±½","±¿","º»","êÚ","ï¼","ÛÎ","ÛĞ"
},
yue=
{
"ÔÂ","Ëµ","Ô¼","Ô½","ÀÖ","Ô¾","ÔÄ","ÔÀ","ÔÁ","ÔÃ","Ô»","Ô¿","èİ","îá","éĞ","å®","Ùß","ë¾"
},
ding=
{
"¶¨","¶©","¶¥","¶¡","¶¦","¶¢","¶¤","¶§","¶£","Øê","îú","î®","ôú","à¤","íÖ","ëë","ğÛ","çà","ñô"
},
hua=
{
"»¯","»ª","»®","»°","»¨","»­","»¬","»©","»í","æè","èë","»«","îü","í¹"
},
dong=
{
"¶¯","¶«","¶­","¶¬","¶´","¶®","¶³","¶°","¶±","ßË","á¼","ë±","¶²","ëØ","íÏ","Ûí","ğ´","á´","ëË"
},
pin=
{
"Æ·","Æ¶","Æ¸","Æµ","Æ´","Æ»","ŞÕ","ò­","æ°","æÉ","é¯","êò"
},
chong=
{
"ÖØ","ÖÖ","³ä","³å","Ó¿","³ç","³æ","³è","âç","ã¿","ô©","Üû","ï¥","ô¾"
},
guan=
{
"¹Ø","¹Ü","¹Û","¹İ","¹Ù","¹á","¹Ú","¹ß","¹à","¹Ş","İ¸","ÂÚ","¹×","ñæ","ÙÄ","ğÙ","÷¤","îÂ","Şè","äÊ"
},
fen=
{
"·Ö","·İ","·×","·Ü","·Û","·Õ","·Ò","·ß","·à","·Ø","·Ú","·Ù","·Ó","·Ô","·Ş","èû","çã","÷÷","å¯","ÙÇ","ö÷"
},
wai=
{
"Íâ","Íá"
},
qu=
{
"Çø","È¥","È¡","ÇÒ","Çú","Ç÷","Çş","È¤","Çı","Çü","Çû","áé","È¢","ìî","öÄ","Ğç","á«","È£","êï","ëÔ","òĞ","ñ³","Çù","ÜÄ","ãÖ","Ú°","Û¾","Ş¡","Ş¾","ë¬","÷ñ","ó½","è³","ôğ","ğ¶","íá"
},
ou=
{
"Çø","Å·","Å¼","Å¹","Å»","Åº","Ú©","Å¸","ê±","Å½","ñî","âæ"
},
neng=
{
"ÄÜ"
},
she=
{
"Éè","Éç","Éã","Éæ","Éä","ÕÛ","Éá","Éß","Éà","Éİ","Éå","Éâ","ÉŞ","ÙÜ","÷ê","ì¨","î´","ØÇ","ß¡","â¦","äÜ"
},
hou=
{
"ºó","ºò","ºñ","ºî","ºï","ºí","ºğ","åË","óó","ô×","÷¿","áá","ö×","ğú","Ü©"
},
jiu=
{
"¾Í","¾¿","¾Å","¾Æ","¾Ã","¾È","¾É","¾À","¾Ë","¾Ä","¾Î","¾¾","¾Ì","¾Â","¾Á","¾Ê","èÑ","ôñ","ğ¯","ğÕ","¾Ç","à±","ãÎ","èê","ÙÖ","÷İ"
},
deng=
{
"µÈ","µÇ","µË","µÆ","³Î","µÊ","µÉ","µÅ","àâ","íã","áØ","ïë","ô£","ê­"
},
ti=
{
"Ìå","Ìá","Ìâ","Ìæ","Ìİ","Ìß","Ìè","ÌŞ","Ìã","Ìä","Ìë","Ìê","Ìé","Ìà","ÙÃ","ã©","åÑ","Ìç","Üè","õ®","ç°","ğÃ","ç¾","ñÓ"
},
xia=
{
"ÏÂ","ÏÄ","Ï¿","ÏÃ","Ï½","Ï¼","Ïº","ÏÁ","ÏÅ","ÏÀ","Ï¾","åÚ","Ï¹","Ï»","è¦","»£","ßÈ","÷ï","íÌ","óÁ","áò","ğı","èÔ"
},
wan=
{
"Íò","Íê","Íí","Íå","Íæ","Íë","Íç","Íì","Íä","Âû","Íè","İ¸","Íî","Íğ","Íñ","Íó","òê","Íï","Íé","Ãä","çş","îµ","Íã","Øà","æı","çº","ëä","İÒ","Ü¹"
},
mo=
{
"Íò","ÎŞ","Ã»","Ä£","Ä©","Ã°","Äª","Ä¦","Ä«","Ä¬","Ä¥","Ãş","Ä®","Âö","Ä¤","Ä§","Ä­","Ä°","Ä¨","Ä¯","Ä¢","Ä¡","İë","âÉ","ÜÔ","ºÙ","ÚÓ","ï÷","ºÑ","æÆ","ïÒ","éâ","ñò","ñ¢","õö","õø"
},
yuan=
{
"Ôª","Ô±","Ôº","Ô­","Ô´","Ô¶","Ô¸","Ô°","Ô®","Ô²","Ôµ","Ô¬","Ô¹","Ô¨","Ô·","Ô©","æÂ","Ô³","Ô«","ãä","Ü«","Ûù","Ô§","Ô¯","ğ°","è¥","à÷","ë¼","Ü¾","ö½","éÚ","ó¢","íó","óî","Şò"
},
qian=
{
"Ç°","Ç§","Ç®","Ç©","Ç±","Ç¨","Ç·","ÏË","Ç£","Ç³","Ç²","Ç«","Ç¬","Ç¦","Ç¸","Ç­","Ç´","Ç¶","Ù»","Ç¯","Üç","ò¯","Çµ","Ç¥","å¹","Úä","Şç","îÔ","Ç¤","Ü·","êù","óè","İ¡","Çª","ÜÍ","ã¥","ç×","Ùİ","í©","å½","ëÉ","á©","åº","óé","ã»","èı"
},
mian=
{
"Ãæ","ÃŞ","Ãâ","Ãà","Ãå","Ãã","Ãß","Ãá","Ãä","ëï","äÅ","äÏ","ãæ","íí"
},
nong=
{
"Å©","Å¨","Åª","Å§","Ù¯","ßæ"
},
shuo=
{
"Ëµ","Êı","Ë¶","Ë¸","Ë·","îå","åù","éÃ","İô","Ş÷"
},
shui=
{
"Ëµ","Ë®","Ë°","Ë­","Ë¯"
},
yun=
{
"Ô±","ÔË","¾ù","ÔÆ","ÔÊ","ÔĞ","ÔÌ","ÔÏ","ÔÍ","ÔÅ","ÔÎ","ÔÈ","Ü¿","ÔÉ","ç¡","ìÙ","ÔÇ","ã¢","è¹","Û©","ëµ","éæ","ã³","êÀ","áñ"
},
er=
{
"¶ø","¶ş","¶û","¶ù","¶ú","åÇ","¶ü","¶ı","·¡","îï","çí","Ù¦","ğ¹","öÜ"
},
wu=
{
"Îñ","Îï","ÎŞ","Îå","Îä","Îç","Îâ","Îè","Îé","ÎÛ","ÎÚ","Îó","Íö","¶ñ","Îİ","Îî","Îò","Îá","Îí","Îß","Îà","Îğ","Î×","Îê","Îë","Îã","ÎÜ","ÎØ","ÎÙ","Úù","Îæ","ğÍ","Ø£","æÄ","åü","ì¶","Îì","ğÄ","ä´","òÚ","ßí","æğ","Øõ","ìÉ","ÜÌ","öÈ","âĞ","÷ù","êõ","âä","ÛØ","âè","ğí","åÃ","è»","å»","Úã"
},
dian=
{
"µç","µã","µê","µä","µì","µé","µâ","µí","µî","µæ","µß","µá","ñ²","áÛ","µë","µà","ñ°","çè","µè","õÚ","µå","îä","ô¡","Ûã","Úç"
},
wen=
{
"ÎÄ","ÎÊ","ÎÅ","ÎÈ","ÎÂ","ÎÆ","ÎÇ","ÎÃ","ö©","ÎÉ","ÎÁ","ãë","ØØ","è·","ãÓ"
},
ke=
{
"¿É","¿Æ","¿Ë","¿Í","¿Ì","¿Î","¿Å","¿Ê","¿Ç","¿Â","¿Ã","ºÇ","¿À","ã¡","¿Á","¿È","¿Ä","çæ","ïı","î§","äÛ","éğ","ñ½","à¾","ğâ","òò","á³","ò¤","÷Á","ç¼","ë´","æì","îİ","ï¾"
},
zong=
{
"×Ü","×Û","×Ú","×İ","×Ù","×Ø","ôÕ","××","ÙÌ","èÈ","ëê"
},
gai=
{
"¸Ä","¸Ã","¸Ç","¸Å","¸È","¸Æ","Ø¤","½æ","êà","Ûò","Úë","ê®"
},
san=
{
"Èı","É¢","É¡","Èş","ôÖ","âÌ","ë§"
},
hao=
{
"ºÃ","ºÅ","ºÁ","ºÀ","ºÄ","ºÆ","ºÂ","ğ©","ê»","¸ä","İï","º¾","å°","º¿","å©","òº","ºÑ","ò«","àÆ","Ş¶","àã"
},
si=
{
"Ë¾","ËÄ","Ë¼","Ë¹","Ê³","Ë½","ËÀ","ËÆ","Ë¿","ËÇ","ËÂ","²Ş","ËÁ","Ëº","ãô","ËÅ","ËÃ","ìë","ØË","æá","Ë»","ïÈ","Ù¹","ËÈ","òÏ","ßĞ","ñê","óÓ","ğ¸","çÁ","äù","æ¦","ãá","ÛÌ","Ùî"
},
cong=
{
"´Ó","´Ô","´Ò","´Ï","´Ğ","´Ñ","çı","äÈ","æõ","ÜÊ","è®"
},
ping=
{
"Æ½","ÆÀ","Æ¾","Æ¿","·ë","ÆÁ","Æ¼","Æ»","Æ¹","Æº","èÒ","æ³","Ù·","öÒ"
},
dang=
{
"µ±","µ³","µµ","µ´","µ²","å´","í¸","ñÉ","ÛÊ","İĞ","ÚÔ"
},
tian=
{
"Ìì","Ìï","Ìí","Ìî","Ìğ","Ìñ","Ìó","µè","Ìò","ãÙ","ãÃ","éå","î±","Şİ"
},
nei=
{
"ÄÚ","ÄÇ","ÄÄ","ÄÙ"
},
xiao=
{
"Ğ¡","Ğ§","Ïú","Ïû","Ğ£","Ïş","Ğ¦","Ğ¤","Ï÷","Ğ¢","Ïô","äì","Ïõ","Ïü","Ğ¥","Ïù","Ïö","Ïı","Ïø","óã","åĞ","óï","æç","èÉ","ßØ","ç¯","òÙ","áÅ","èÕ","÷Ì"
},
mu=
{
"Ä¿","Ä£","Ä¾","Ä¶","Ä»","Ä¸","ÄÁ","ÄÂ","Ä·","Ä¹","Ä½","Ä²","Äµ","Ä¼","ÄÀ","ãå","Äº","Ä´","ÀÑ","îâ","ÜÙ","Øï","ë¤","Ûé"
},
hai=
{
"º£","»¹","º¦","º¢","º¥","¿È","º¡","ºÙ","º§","º¤","àË","ëÜ","õ°"
},
suo=
{
"Ëù","Ë÷","Ëõ","Ëø","É¯","Ëó","Ëö","àÂ","Ëô","ßï","æ¶","Ëò","ôÈ","êı","èø","àÊ","íü"
},
ru=
{
"Èë","Èç","Èé","Èå","Èè","Èê","Èã","Èì","Èæ","å¦","Èä","àé","çÈ","äá","ï¨","ä²","Ş¸","ñà","ò¬","İê"
},
liang=
{
"Á¿","Á½","Á¸","Á¼","Á¾","ÁÁ","Áº","Á¹","ÁÂ","Á»","ÁÀ","ö¦","õÔ","İ¹","é£","÷Ë","Ü®"
},
du=
{
"¶È","¶¼","¶À","¶½","¶Á","¶Ù","¶¾","¶É","¶Å","¶Â","¶Ä","¶Ã","¶Ç","¶Æ","äÂ","óÆ","à½","¶¿","¶Ê","ë¹","ó¼","èü","÷ò","Ü¶","÷Ç"
},
bei=
{
"±±","±»","±¸","±¶","±³","±­","±´","±²","±¯","±®","±Û","±°","ã£","±¹","İí","Úé","±µ","±·","ßÂ","±º","íÕ","ñØ","Ûı","÷¹","ØÃ","ğÇ","İÉ","Úı","öÍ"
},
huan=
{
"»¹","»·","»»","»¶","»¼","»º","»½","»À","»Ã","»¾","»¸","å¾","»Á","»Â","ä¡","ä½","»¿","Û¼","Û¨","à÷","âµ","öé","÷ß","İÈ","åÕ","äñ","ïÌ","çÙ","ß§"
},
dou=
{
"¶¼","¶·","¶Á","¶¹","¶¶","¶µ","¶¸","¶º","ñ¼","ò½","¶»","İú","óû"
},
shu=
{
"Êõ","Êé","Êı","Êô","Ê÷","Êä","Êø","Êö","Êğ","Êì","Êâ","Êß","Êæ","Êè","Êó","Êç","Êå","Êî","Êà","Êû","Óá","Êï","Êã","Êú","Êñ","Êí","Êá","Êù","Ë¡","Êë","ãğ","Êê","Êü","Êş","ÛÓ","Ù¿","äø","ç£","æ­","İÄ","Êò","ëò","ïø","ë¨","ì¯","Şó","Ø­"
},
ming=
{
"Ã÷","Ãû","Ãü","ÃË","Ãù","Ãú","Ú¤","Üø","äé","õ¤","î¨","Ãø","êÔ"
},
zhao=
{
"×Å","ÕÕ","ÕĞ","ÕÒ","ÕÙ","³¯","ÕÔ","Õ×","ÕÑ","ÕØ","ÕÖ","îÈ","ÕÓ","³°","×¦","Ú¯","ßú","èş","óÉ"
},
zhuo=
{
"×Å","Öø","½É","×À","×¿","×½","×Á","×Æ","×Ç","×Ã","×¾","×Â","äÃ","ïí","×Ä","åª","ìÌ","Ù¾","ßª","í½","èş","ÚÂ","ä·","ìú"
},
ci=
{
"´Î","´Ë","´Ê","´Ç","´Ì","´É","´Å","×È","´È","´Ä","´Í","ìô","ËÅ","´Æ","´Ã","ğË","ôÙ","ßÚ","Üë"
},
jiang=
{
"½«","Ç¿","½­","½±","½²","½µ","½®","½¯","½ª","½¬","½³","½´","½©","½°","ç­","çÖ","êñ","ôø","íä","ä®","Üü","ôİ","ñğ"
},
qiang=
{
"½«","Ç¿","ÇÀ","Ç½","Ç¹","Ç»","ïÏ","Çº","Ç¼","Ç¾","ñß","ôÇ","õÄ","éÉ","ãŞ","æÍ","ê¨","ìÁ","ïê","ïº","òŞ"
},
zeng=
{
"Ôö","Ôø","×Û","Ôù","Ô÷","ï­","êµ","îÀ","çÕ"
},
xiang=
{
"Ïò","Ïî","Ïà","Ïë","Ïç","Ïó","Ïì","Ïã","½µ","Ïñ","Ïí","Ïä","Ïé","Ïæ","Ïê","Ïğ","Ïï","Ïè","Ïå","Ïá","Ïâ","÷Ï","âÃ","ç½","æø","Ü¼","âÔ","öß","İÙ","ó­"
},
ying=
{
"Ó¦","Óª","Ó°","Ó¢","Ó­","Ó³","Ó²","Ó¯","Ó®","Ó±","Ó¤","Ó¥","Ó«","Ó¨","Ó£","çø","Ó¬","İÓ","İº","ò£","âß","Ó§","å­","éº","ó¿","Üş","Ó©","ğĞ","äŞ","İö","Û«","Üã","àÓ","è¬","Ùø","ñ¨","ëô","Şü","äë"
},
mei=
{
"ÃÀ","Ã»","Ã¿","Ãº","Ã·","Ã½","Ã¶","ÃÃ","Ã¼","÷È","Ã¹","ÃÕ","ÃÁ","ÃÄ","Ãµ","Ã¸","Ã¾","äØ","ÃÂ","İ®","ñÇ","é¹","ÃÓ","áÒ","ïÑ","ä¼","â­","ğÌ"
},
gui=
{
"¹æ","¹ó","¹é","¹ì","¹ğ","¹ñ","¹ç","¹í","¹è","¹å","¹ò","¹ê","¹ë","¹î","¹ï","È²","÷¬","èí","ğ§","öÙ","¹ô","êĞ","¿ş","æ£","êÁ","âÑ","óş","ØÛ","å³","ØĞ"
},
xie=
{
"Ğ©","½â","Ğ­","Ğ´","Ñª","Ò¶","Ğ»","Ğµ","Ğ¬","Ğ²","Ğ±","Ğ¯","Ğ¸","Æõ","Ğ¶","Ğ³","Ğ¹","Ğ·","Ğ°","Ğª","Ğº","Ğ¼","Ğ®","ÛÆ","é¿","Ğ«","ß¢","ÙÉ","Ùô","Ğ¨","ò¡","çÓ","åâ","å¬","ÛÄ","éÇ","Ş¯","ç¥","äÍ","âİ","â³","õó"
},
biao=
{
"±í","±ê","±ë","É×","ïÚ","ñÑ","±ì","ì­","ïğ","æ»","æô","ì©","è¼","÷Ô","÷§","ñ¦"
},
xi=
{
"Ïµ","Î÷","Ï¯","Ï¢","Ï£","Ï°","Îü","Ï²","Ï¸","Îö","Ï·","Ï´","Ï¤","Îı","Ïª","Ï§","Ï¡","Ï®","Ï¦","Îú","Îô","Îş","À°","Ï©","Îõ","Ï±","ÆÜ","Ï¥","Ï¶","Ï¬","õè","Îø","Ùâ","Ï¨","êØ","ìû","Üç","æÒ","çô","ŞÉ","Ï«","áã","ôË","Ï³","äÀ","Îû","ì¨","ìä","Îù","ó¬","Û­","ßñ","ğª","Úô","éØ","ä»","òá","Ï­","ôâ","ãÒ","ô¸","åï","İß","ó£","ôÑ","êê","ì¤","ÙÒ","õµ","÷û","ñÓ","ñ¶","â¾","ôª","ìù","İ¾","İû"
},
ban=
{
"°ì","°æ","°ë","°à","°ã","°å","°ä","°é","°á","°ß","°ç","°è","°â","°ê","Ûà","Úæ","°í","îÓ","ñ£","ô²","ñ­"
},
jiao=
{
"½Ì","½»","½Ï","Ğ£","½Ç","¾õ","½Ğ","½Å","½É","½º","½Î","½¼","½¹","½¾","½½","½·","½¸","Ù®","½¿","½Ã","½Á","½Ê","½Í","½Ë","½À","½È","½Ñ","õÓ","òÔ","½Ä","½Æ","æ¯","ğ¨","Üú","á½","½Â","õ´","öŞ","äĞ","áè","ğÔ","ÙÕ","àİ","Ü´","ŞØ","ë¸"
},
tiao=
{
"Ìõ","µ÷","Ìô","Ìø","Ìö","Ì÷","Üæ","ñ»","óÔ","Ù¬","ôĞ","÷Ø","ìö","ö¶","òè","öæ"
},
zui=
{
"×î","×ï","¶Ñ","×ì","×í","¾×","Ş©"
},
te=
{
"ÌØ","ìı","ß¯","ï«","í«"
},
shou=
{
"ÊÕ","ÊÖ","ÊÜ","Ê×","ÊÛ","ÊÚ","ÊØ","Êì","ÊÙ","Êİ","ÊŞ","á÷","ç·","ô¼"
},
bing=
{
"²¢","²¡","±ø","±ù","ÆÁ","±ı","±ş","±ü","±û","Şğ","±ú","éÄ","Ù÷","Úû"
},
an=
{
"³§","¹ã","°²","°¸","°´","°¶","°µ","°°","°±","°³","°·","ï§","ÚÏ","âÖ","÷ö","ğÆ","èñ","Ûû","áí","Şî"
},
kou=
{
"¿Ú","¿Û","¿Ü","ßµ","¿Ù","Ş¢","ÜÒ","íî","óØ"
},
diao=
{
"µ÷","µô","µñ","Äñ","µõ","µö","µó","õõ","µò","µï","öô","µğ","ï¢","îö"
},
zu=
{
"×é","×å","×ã","×æ","×â","×è","×ä","ÙŞ","×ç","ïß","İÏ"
},
lu=
{
"Â·","ÂÊ","ÂÉ","ÂÃ","Áù","Â½","Â¼","ÂÌ","ÂÇ","Â¶","Â³","Â¬","Â¯","ÂÄ","ÂÀ","ÂÁ","ÂÅ","Â¹","Â»","Â¸","Â«","Â®","Âµ","ÂÈ","ÂÆ","ÂË","Â´","ÂÂ","Â­","Â¿","ãò","Â±","Âº","ğØ","ê¤","éµ","Â²","è´","äõ","àà","ãÌ","ñÚ","Â¾","öÔ","Â°","éÖ","éñ","åÖ","äË","Ş¤","ß£","ğµ","èÓ","ëª","ëÍ","ïå","óü","ëö","ôµ","éû","ïù","Ûä"
},
guang=
{
"¹ã","¹â","¹ä","áî","ë×","ßÛ","èæ"
},
bi=
{
"±È","±Ø","±Ò","±Ê","±Ï","ÃØ","±Ü","±Õ","±Ù","±Ú","±×","±Ë","±Æ","±Ì","±Ç","±Û","±Î","·÷","ÃÚ","èµ","±Ó","±Ô","±Ğ","åö","Ø°","±É","±İ","ñÔ","êÚ","±Ö","±Í","ßÁ","ó÷","ÙÂ","îé","±Ñ","óÙ","İ©","Şµ","æ¾","ßÙ","õÏ","Ûı","å¨","ïõ","Üê","ã¹","î¢","åş","ÜÅ","óë","âØ","÷Â","î¯","ää","áù","İÉ","æÔ","ôÅ","ô°"
},
tou=
{
"Í¶","Í·","Í¸","Íµ","î×","÷»"
},
jue=
{
"¾ö","¾ø","½Ç","¾õ","½Å","¾ò","áÈ","¾÷","â±","¾ñ","¾ô","½À","¾ó","ØÊ","Ş§","¾ğ","çå","ÛÇ","õê","ÚÜ","ïã","àµ","àå","èö","àÙ","¾ï","éÓ","æŞ","õû","Øã","ìß"
},
nan=
{
"ÄÏ","ÄÑ","ÄĞ","éª","à«","àï","ôö","ëî","àî","òï"
},
na=
{
"ÄÏ","ÄÇ","ÄÉ","ÄÃ","ÄØ","ÄÄ","ÄÈ","ÄÆ","ÄÅ","Şà","ñÄ","ïÕ","ëÇ"
},
ling=
{
"Áì","Áî","Áí","Áã","Áé","Áä","Áê","Áë","Áè","Áá","Áå","Áâ","Àâ","Áæ","Áà","Áç","Üß","ñö","ôá","ãö","ê²","àò","ç±","ßÊ","èù","òÈ","Û¹","öì","èÚ"
},
qing=
{
"Çé","Çà","Çå","Çë","Ç×","Çá","Çì","Çã","Çê","Çä","Çç","Çâ","Çæ","Çè","óÀ","íà","òß","óä","öë","ôì","ÜÜ","÷ô","àõ","éÑ","ö¥"
},
shan=
{
"É½","µ¥","ÉÆ","ÉÂ","ÉÁ","ÉÀ","ÉÃ","ÉÇ","ÉÈ","É¼","Éº","ìø","É¾","ÉÅ","ÉÉ","ÉÄ","Û·","Õ¤","É¿","æ©","õÇ","÷­","æÓ","äú","Ú¨","ô®","É»","ğŞ","µ§","ëş","îÌ","Øß","óµ","ÜÏ","Ûï","æó"
},
che=
{
"³µ","³¹","³·","³ß","³¶","³º","³¸","Ûå","íº"
},
ju=
{
"³µ","¾Ö","¾İ","¾ß","¾Ù","¾Ó","¾ç","¾Ş","¾Û","¾à","¾ä","¾Ü","¾ã","¹ñ","¾Õ","¾Ğ","¾æ","½Û","¾å","¾Ø","¾Ï","¾Ô","¾â","¾á","¾×","öÄ","èÛ","Şä","¾Ú","Üì","éÙ","ì«","¾Ò","îÒ","ôò","õá","åá","è¢","ö´","é§","ÜÄ","ñÕ","é°","¾Ñ","ÙÆ","é·","ÜÚ","Úª","öÂ","ï¸","ñÀ","÷¶","êø","åğ","õ¶"
},
ran=
{
"È»","È¾","È¼","È½","ÜÛ","÷×","òÅ"
},
yin=
{
"Òò","Òı","Òø","Ó¡","Òô","ÑÌ","Òû","Òõ","Òş","Òö","Òó","Òù","Òü","Òñ","Ò÷","ñ«","Òú","Òğ","Ûß","Ûó","Û´","äÎ","ò¾","ë³","Ø·","ö¸","ñ¿","à³","î÷","ä¦","áş","â¹","ßÅ","ö¯","Üá","Ü§"
},
ba=
{
"°Ñ","°Ë","°Í","°Î","°É","°Ó","°Ö","°Ô","°Õ","°Å","°Ï","°Ç","°È","°Ğ","°Ì","°Ê","°Ò","öÑ","ôÎ","á±","å±","îÙ","°Æ","İÃ","÷É","ÜØ"
},
chi=
{
"³Ö","³Ô","³Ø","³Ù","³à","³Û","³ß","³â","³İ","³á","³×","³Õ","³Ü","³ã","³Ş","³Ú","ß³","à´","Ûæ","àÍ","Ü¯","ßê","Üİ","ôù","ë·","ó×","âÁ","õØ","ò¿","æÊ","÷Î","óø","ñİ","áÜ","ğ·","ó¤","ñ¡","í÷","ÙÑ"
},
dan=
{
"µ«","µ¥","Ê¯","µ£","µ¤","µ¨","µ©","µ¯","µ°","µ­","µ®","µª","µ¦","µ¢","éé","µ¬","ÙÙ","íñ","ğã","å£","µ§","à¢","óì","ñõ","İÌ","ğ÷","êæ"
},
cun=
{
"´å","´æ","´ç","¶×","ââ","ñå"
},
qiu=
{
"Çó","Çò","Çï","Çğ","Çñ","³ğ","Çõ","ôÃ","¹ê","Çô","åÙ","öú","ò°","òÇ","Çö","é±","äĞ","áì","åÏ","ÛÏ","Ù´","òø","êä","÷ü","ôÜ"
},
fu=
{
"¸®","·ş","¸±","¸º","¸»","¸´","¸£","·ò","¸¾","·ù","¸¶","·ö","¸¸","·û","¸½","¸¯","¸°","·ğ","¸¡","¸²","¸¨","¸µ","·ü","¸§","¸³","·ø","¸¹","¸¥","·ô","¸·","¸¤","¸¿","¸¦","·ú","¸«","æÚ","·ó","¸©","·÷","·ı","¸À","¸­","·õ","Ü½","¸¢","¸ª","¸¬","Üò","ğ¥","ç¦","¸¼","ß»","î·","ôï","òğ","Ùë","ÜÀ","òİ","õÆ","Ùì","äæ","òó","æâ","ç¨","ò¶","íÉ","èõ","êç","İÊ","õÃ","ÜŞ","ŞÔ","öÖ","âö","ïû","Û®","İ³","á¥","ìğ","åõ","íê","íë","öû"
},
yan=
{
"ÑĞ","ÑÏ","Ñé","Ñİ","ÑÔ","ÑÛ","ÑÌ","ÑØ","ÑÓ","ÑÎ","Ñ×","Ñà","ÑÒ","Ñç","ÑŞ","ÑÕ","Òó","Ñå","ÑÚ","ÑÍ","ÑÖ","ÑÜ","Ç¦","Ñã","ÑÊ","Ñá","Ñæ","Ñß","Ñâ","Ñä","ÑÉ","êÌ","éÜ","ÑÑ","ÑÙ","Ù²","ëç","åû","Ñè","Ùğ","óÛ","ìÍ","ÙÈ","ãÆ","æÌ","Û³","äÎ","ØÍ","ëÙ","çü","äÙ","ÑË","÷Ê","õ¦","Û±","âû","áÃ","Ü¾","ãÕ","Øß","÷ú","İÎ","÷Ğ","Úİ","ØÉ","î»","Úç"
},
jun=
{
"¾ü","¾ù","¿¡","¾ı","¾ş","¾ú","¿¢","¾û","¿¥","¹ê","¿£","¿¤","óŞ","ñä","÷å","ŞÜ"
},
yo=
{
"Óı","Ó´","à¡"
},
gan=
{
"¸É","¸Ğ","¸Ï","¸Ò","¸Ê","¸Î","¸Ë","¸Ó","Ç¬","¸Ì","ŞÏ","¸Í","¸Ñ","éÏ","í·","äÆ","ÜÕ","ß¦","ôû","ç¤","ãï","Ûá","êº","ğá","ä÷"
},
tuan=
{
"ÍÅ","ÍÄ","î¶","ŞÒ","åè"
},
zao=
{
"Ôì","Ôç","Ôâ","Ôæ","Ôë","Ôî","Ôï","Ôã","Ôä","Ôê","Ôå","Ôí","Ôè","Ôé","ßğ"
},
lian=
{
"Áª","Á¬","Á·","Á®","Á¶","Á³","Á«","Áµ","Á´","Á±","Á¯","Á°","Á²","çö","Á­","å¥","é¬","öã","éç","äò","ñÍ","ñÏ","ì¡","ŞÆ","ó¹","İü"
},
zhuan=
{
"×¨","×ª","´«","×¬","×©","×«","×­","ãç","âÍ","ßù","ò§"
},
shao=
{
"ÉÙ","ÉÜ","ÕÙ","ÉÕ","ÉÔ","ÉÛ","ÉÚ","ÉØ","ÉÓ","É×","ÉÒ","ÇÊ","ÉÖ","Üæ","Û¿","ô¹","óâ","è¼","òÙ","äû"
},
fei=
{
"·Ñ","·Ç","·É","·Ê","·Ï","·Æ","·Î","·È","·Ğ","·Ë","ì³","òã","åú","·Ì","ìé","ôä","ö­","·Í","ç³","ëè","ğò","ÜÀ","äÇ","ã­","áô","é¼","öî","óõ","ïĞ"
},
shen=
{
"Éî","²Î","Éí","Éñ","Ê²","Éó","Éê","Éõ","Éò","Éì","É÷","Éø","Éö","Éğ","İ·","Éë","Éô","Éï","Éé","ò×","ßÓ","é©","İØ","äÉ","Ú·","ÚÅ","ïò","ëÏ"
},
geng=
{
"¸ü","¸û","¾±","¸ı","¹¢","¹£","¹¡","¸ş","ßì","âÙ","ç®","öá"
},
kan=
{
"¿´","¿¯","¿±","¿°","¿²","¿³","Ù©","Ç¶","¼÷","î«","ãÛ","íè","ê¬","İ¨"
},
tai=
{
"Ì¨","Ì«","Ì¬","Ì©","Ì§","Ì¥","Ì­","îÑ","Ì¦","Ş·","ëÄ","õÌ","Û¢","öØ","ß¾","Ìª","ææ","ìÆ"
},
yang=
{
"Ñù","Ñø","Ñë","Ñô","Ñó","Ñï","Ñî","Ñò","Ñõ","Ñö","Ñí","Ñ÷","Ñú","Ññ","ãó","Ñê","í¦","Ñì","áà","Ñğ","âó","ì¾","ìÈ","÷±","òÕ"
},
lao=
{
"ÀÏ","ÀÍ","Âä","Âç","ÀÎ","ÀÌ","ÀÔ","ÀÓ","ÀÑ","ÀĞ","áÀ","ßë","ÀÒ","ÁÊ","ğì","õ²","îî","ï©","èá","ñì"
},
liu=
{
"Á÷","Áõ","Áù","Áô","Â½","Áø","Áö","Áò","Áï","Âµ","ä¯","Áñ","Áğ","Áó","åŞ","öÌ","æò","ç¸","ïÖ","ì¼","ìÖ","ğÒ","ï³"
},
hen=
{
"ºÜ","ºİ","ºŞ","ºÛ"
},
gei=
{
"¸ø"
},
chuang=
{
"´´","´²","´°","´³","´±","´¯","âë"
},
lun=
{
"ÂÛ","ÂÖ","Â×","ÂØ","ÂÚ","ÂÙ","ÂÕ","àğ"
},
bie=
{
"±ğ","±î","±ï","±ñ","õ¿"
},
bian=
{
"±ä","±ã","±ß","±à","±é","±ç","±Ş","±æ","±á","ØÒ","±â","±å","ãê","±è","ì®","í¾","ÜĞ","òù","öı","ÛÍ","ñ¹","óÖ","ìÔ","ñÛ","íÜ","âí","çÂ"
},
feng=
{
"·ç","·á","·â","·å","·î","·ï","·æ","·ë","·ê","·ì","·ä","·ã","·è","·í","·é","Ùº","ãã","Ûº","í¿","İ×","ßô"
},
pi=
{
"Åú","·ñ","Æ¤","»µ","±Ù","Æ¡","Æ¥","Åû","Æ£","Æ§","Åş","Å÷","Æ¢","Æ©","Åü","æÇ","Æ¨","Åı","Úü","ñÔ","Æ¦","ñ±","Úé","Ø§","èÁ","àè","Åù","ßÁ","ç¢","Åø","îë","äÄ","Û¯","Ûı","î¢","ÜÅ","ò·","ÛÜ","Ü±","î¼","òç","ñâ","õù","Øò","âÏ","ß¨","ê¶","Úğ"
},
cha=
{
"²é","²ì","²î","²è","²å","²æ","É²","²ç","é«","²í","²ï","²ê","àê","Ôû","æ±","è¾","ãâ","ñÃ","²ë","é¶","ïï","éß","âÇ","ïÊ","âª"
},
zha=
{
"²é","Ôú","Õ¨","Õ©","Ôş","Õ¢","Ôü","À¯","Õ¦","Õ§","Õ¥","é«","Ôı","Õ¤","Õ£","ßå","×õ","Ôû","à©","Õ¡","òÆ","ß¸","íÄ","Şê","ğä","ßî","÷ş"
},
lin=
{
"ÁÖ","ÁÙ","ÁÚ","ÁŞ","ÁÕ","Á×","ÁÜ","÷ë","ÁØ","ÁÛ","Áİ","åà","İş","Áß","ôÔ","á×","õï","âŞ","éİ","ßø","ê¥","ì¢","î¬","ãÁ"
},
zhuai=
{
"×ª","×§","Ò·"
},
huai=
{
"»®","»³","»µ","»´","»²","»±","õ×"
},
zhun=
{
"×¼","ÍÍ","×»","ëÆ","ñ¸"
},
xu=
{
"Ğè","Ğí","Ğø","Ğë","Ğò","Ğì","Ğî","Ğó","Ğé","Óõ","Ğ÷","Ğğ","Ğñ","Ğô","Ğæ","èò","Ğõ","Û×","Ğö","Ğç","ñã","Ğê","ä°","ìã","Ğï","Ú¼","íì","Ş£","äÓ","äª","çï","ÛÃ","ôÚ","í¹","õ¯"
},
chuan=
{
"´«","´¨","´¬","´©","´®","´­","´ª","â¶","îË","å×","ë°","çİ","ô­"
},
gou=
{
"¹¹","¹º","¹»","¾ä","¹µ","¹·","¹³","¹´","¹¶","¹¸","èÛ","óô","Øş","æÅ","Ú¸","á¸","ì°","çÃ","óÑ","÷¸","êí","åÜ"
},
bai=
{
"°Ù","°×","°Ü","°Ú","²®","°İ","°Ø","°Û","êş","Şã","°Ş"
},
cai=
{
"²Å","²É","²Æ","²Ä","²Ë","²Ê","²Ã","²Ì","²Â","²È","²Ç"
},
can=
{
"²Î","²Ğ","²Í","²Ó","²Ò","²Ï","è²","²Ñ","ôÓ","åî","æî","÷õ"
},
cen=
{
"²Î","á¯","ä¹"
},
zhen=
{
"Õò","Õæ","Õë","ÛÚ","Õñ","Õğ","Õä","Õó","Õï","Õì","Õé","Õê","Õí","èå","êâ","ìõ","Õç","Õå","çÇ","óğ","Õî","Õè","é»","ğ²","éô","ğ¡","äÚ","İè","ëÓ","é©","ëŞ","î³","ä¥"
},
tui=
{
"ÍÆ","ÍË","ÍÈ","ÍÊ","ÍÇ","ÍÉ","ß¯","ìÕ"
},
sai=
{
"Ë¼","Èü","Èû","Èù","àç","Èú"
},
zou=
{
"×ß","×Ş","×à","×á","ÚÁ","æã","Úî","Û¸","öí"
},
zhuang=
{
"×°","×´","×¯","×³","×²","×±","´±","×®","ŞÊ","Ù×"
},
ze=
{
"Ôğ","Ôò","Ôó","Ôñ","²à","Õ¦","ßõ","ØÆ","óå","ØÓ","óĞ","ô·","ê¾","åÅ","àı"
},
zhou=
{
"Öİ","ÖÜ","ÖŞ","ÖÛ","Öè","Öá","Öç","Öæ","Öà","Öå","Öâ","Öä","Öã","ëĞ","ç§","æû","æ¨","ßú","Öß","ôí","íØ","ô¦","ôü","İ§"
},
que=
{
"È·","È´","È±","È¸","Èµ","ãÚ","È³","È¶","È²","ã×","í¨"
},
mao=
{
"Ã³","Ã«","Ã¬","Ã°","Ã²","Ã¯","Ã©","Ã±","Ã¨","÷Ö","Ãª","í®","Ùó","êó","Ã®","Ã­","ë£","á¹","è£","ó±","Üâ","ì¸","ã÷","êÄ","î¦"
},
fan=
{
"·´","·¶","·¸","·±","·¹","·º","·­","·²","·µ","·¬","··","·³","·«","·®","·ª","·¯","èó","Ş¬","·°","á¦","î²","ŞÀ","õì","ìÜ"
},
xuan=
{
"Ñ¡","Ğû","È¯","Ğı","Ğü","Ğù","Ğú","Ğş","Ñ¤","äÖ","è¯","ìÅ","İæ","Ñ¢","äö","Ñ£","êÑ","ìÓ","îç","é¸","ãù","ÚÎ","ğç","íÛ","Şï","ïà","ÙØ"
},
ya=
{
"ÑÇ","Ñ¹","ÑÅ","ÑÀ","Ñº","Æ¥","Ñ¼","Ñ½","ÑÄ","ÑÂ","Ñ¿","ÑÆ","ÑÈ","Ñ»","æ«","ÑÃ","Ñ¾","ÑÁ","Ûë","Øó","ë²","èâ","çğ","Şë","íı","ğé","åÂ","á¬","í¼"
},
me=
{
"Ã´","÷á"
},
ma=
{
"Ã´","Âí","Âğ","Ä¦","Âé","Âë","Âè","Âê","Âï","Âî","Ä¨","Âì","ßé","ó¡","áï","è¿","æÖ"
},
wang=
{
"Íõ","Íû","Íù","Íø","Íü","Íö","Íú","Íô","Ã¢","Í÷","Íı","ã¯","Øè","éş","÷Í","ŞÌ"
},
ce=
{
"²ß","²â","²á","²à","²Ş","âü"
},
nu=
{
"Å®","Å¬","Å­","Å«","åó","îÏ","æå","ô¬","æÛ","æÀ","í¤"
},
tan=
{
"Ì¸","Ì½","Ì¹","Ì¯","µ¯","Ì¿","Ì³","Ì²","Ì°","Ì¾","Ì·","Ì¶","Ì¼","Ìº","Ì±","Ì´","Ìµ","Ì»","Ì®","ìş","ê¼","Û°","å£","îã","ïÄ","ïâ"
},
kuang=
{
"¿ö","¿ó","¿ò","¿ñ","¿õ","¿ô","¿ï","¿ğ","Ú÷","ÛÛ","ßÑ","êÜ","ŞÅ","Ú¿","Ú²","æş"
},
se=
{
"É«","Èû","Éª","É¬","ØÄ","ğ£","ï¤"
},
shai=
{
"É«","É¸","É¹"
},
lie=
{
"ÁĞ","ÁÒ","ÁÓ","ÁÑ","ÁÔ","Ùı","ßÖ","ôó","ä£","÷à","Ûø","Şæ","õñ"
},
gang=
{
"¸Û","¸Ö","¸Õ","¸Ú","¸Ù","¸Ô","¸Ü","¸×","¿¸","¸Ø","î¸","í°","óà"
},
kuan=
{
"¿î","¿í","÷Å"
},
la=
{
"À­","Âä","À¶","À¬","À°","À²","À±","À¯","À®","Øİ","ê¹","íÇ","åå","ğø"
},
gu=
{
"¹É","¹Å","¹Ë","¹Ê","¹Ì","¹Ä","¹Ç","¹À","¹È","¼Ö","¹Ã","¹Â","¹Í","¹¼","¹½","¹Á","¹¾","ßÉ","ïÀ","îÜ","ğÀ","¹¿","ãé","èô","ğó","áÄ","éï","ğ³","êô","¹Æ","Ú¬","ì±","÷½","İÔ","î¹","ØÅ","ëû","õı","î­","òÁ","ôş","êö","öñ"
},
gen=
{
"¸ù","¸ú","Ø¨","ôŞ","ßç","İ¢"
},
tu=
{
"ÍÁ","Í»","Í¼","Í¾","Í½","Í¿","ÍÂ","ÍÀ","ÍÃ","Íº","Í¹","İ±","îÊ","İË","Ü¢","õ©"
},
qun=
{
"Èº","È¹","åÒ"
},
su=
{
"ËÙ","ËØ","ËÕ","Ëß","Ëõ","ËÜ","Ëà","Ë×","ËŞ","ËÚ","Ëİ","ËÖ","Ùí","ãº","óù","öÕ","ËÛ","ÚÕ","ä³","İø","à¼","ö¢"
},
lei=
{
"Àà","ÀÛ","À×","ÀÕ","Àá","ÀÙ","Àİ","ÀÚ","ÀŞ","ÀØ","Àß","Ùú","ñç","ÀÜ","æĞ","çĞ","õª","àÏ","Ú³","éÛ"
},
xun=
{
"Ñ¶","Ñµ","Ñ¸","Ñ°","Ñ¯","Ñ­","Ñ®","Ñ²","Ñ´","Ñ«","Ñ·","Ñ¬","áß","¿£","Ñ³","Ñ±","öà","»ç","Ş¹","Ü÷","ä±","ä­","á¾","Û÷","Ùã","Û¨","õ¸","âş","ñ¿","Ş¦","êÖ","â´"
},
zhua=
{
"×¥","ÎÎ"
},
re=
{
"ÈÈ","Èô","ÈÇ"
},
mi=
{
"Ã×","ÃÜ","ÃØ","ÃÔ","ÃÖ","ÃÛ","ÃÕ","ÃÙ","ÃÒ","ÃÚ","ÃĞ","÷ç","â¨","Ú×","ßä","ÃÓ","åµ","ãè","ÃÑ","à×","åô","ëß","Ãİ","ìò","÷ã","ŞÂ","ØÂ","ôé","ôÍ"
},
pei=
{
"Åä","Åà","Åâ","Åå","Åã","Åæ","Åá","Åß","ö¬","ì·","àú","ÅŞ","õ¬","àÎ","ïÂ"
},
kao=
{
"¿¼","¿¿","¿¾","¿½","îí","èà","åê","êû"
},
duan=
{
"¶Ï","¶Î","¶Ì","¶Ë","¶Í","¶Ğ","ìÑ","é²","óı"
},
luo=
{
"Âä","ÂŞ","Âç","Âå","Âß","Âİ","Âà","Âæ","ÂÜ","Âã","äğ","ÀÓ","Şû","Ââ","¿©","Âá","çó","ŞÛ","Üı","íÑ","öÃ","é¡","ïİ","ñ§","ãø","ëá","â¤","ÙÀ","Ùù"
},
e=
{
"¶î","¶í","¶ñ","¶ì","¶ô","¶õ","¶ò","¶ö","¶ë","¶ó","¶ğ","öù","¶ê","Ø¬","ãµ","¶ï","ïÉ","ÛÑ","æ¹","ğÊ","İà","ÚÌ","İ­","ëñ","ï°","ò¦","ßÀ","åí","ÜÃ","éî"
},
shuang=
{
"Ë«","Ë¬","Ëª","æ×","ãñ"
},
rang=
{
"ÈÃ","ÈÀ","ÈÁ","ÈÂ","È¿","ğ¦","ìü"
},
qie=
{
"ÇĞ","ÇÒ","ÇÔ","ÇÑ","Æö","ïÆ","ÇÓ","Ù¤","ã«","æª","êü","Û§","óæ","ã»"
},
pian=
{
"±ã","Æ¬","Æª","Æ«","Æ­","ôæ","±â","æé","ëİ","õä","ÚÒ","êú","çÂ"
},
kong=
{
"¿Õ","¿Ø","¿×","¿Ö","ÙÅ","áÇ","óí"
},
ni=
{
"Äã","Äá","ÄØ","Äà","Äâ","Äò","Äæ","Äß","Äİ","Äå","Ää","ÄŞ","Äç","ì»","êÇ","Ûè","îê","öò","Ù£","âõ","íş","ìò","â¥","í«"
},
ceng=
{
"²ã","Ôø","²ä"
},
huang=
{
"»Æ","»Ä","»Í","»Ê","»Ë","»Å","»Î","äê","»Ñ","»Ì","»É","è«","»Ğ","»Ï","äÒ","»È","»Ç","Úò","áå","åØ","ëÁ","óò","öü","ó¨","ñ¥"
},
suan=
{
"Ëã","Ëá","Ëâ","â¡"
},
po=
{
"ÆÆ","·±","ÆÂ","ÆÈ","ÆÄ","ÆÓ","²´","ÆÅ","ÆÃ","ÆÇ","ÆÉ","Û¶","çê","Úé","îà","ØÏ","óÍ","ãø","ğ«","îÇ","îŞ","ê·"
},
tie=
{
"Ìú","Ìù","Ìû","÷Ñ","İÆ"
},
man=
{
"Âú","Âı","Âü","Âş","Âû","Â÷","Âù","÷©","Âø","á£","Ã¡","òı","ì×","çÏ","ïÜ","ò©","Ü¬","÷´"
},
ai=
{
"°®","°£","°¬","°­","°©","´ô","°§","°¤","°«","°¯","°ª","°¦","°¨","°¥","ö°","Şß","êÓ","æÈ","àÈ","è¨","àÉ","ïÍ","íÁ"
},
rong=
{
"Èİ","ÈÙ","ÈÚ","ÈŞ","ÈÜ","ÈØ","ÈÛ","ÈÖ","éÅ","È×","Èß","áÉ","ëÀ","áõ","òî"
},
chen=
{
"³Æ","³Â","Éò","³Á","³¿","è¡","³¼","³¾","³½","³Ä","³Ã","³À","³»","å·","ÚÈ","í×","àÁ","ŞÓ","é´","Ø÷","Úß","ö³"
},
pai=
{
"ÅÆ","ÅÅ","ÅÉ","ÅÄ","ÆÈ","ÅÇ","ÅÈ","Ù½","ßß","İå"
},
cu=
{
"´Ù","´Ö","´Ø","´×","×ä","õí","â§","õ¾","õ¡","İı","éã","áŞ"
},
kun=
{
"À§","À¥","À¤","À¦","çû","ï¿","öï","õ«","÷Õ","ã§","ãÍ"
},
chao=
{
"³¬","³¯","³±","³´","³®","³­","³²","³³","½Ë","´Â","³°","êË","ìÌ","ñé","â÷"
},
sui=
{
"Ëæ","Ëê","Ëä","Ëé","Äò","Ëí","Ëì","Ëè","Ëë","Ëç","Ëå","åä","î¡","Ëî","å¡","ìİ","ÚÇ","íõ","İ´"
},
chun=
{
"´º","´¿","´¼","´¾","´½","´»","´À","ğÈ","İ»","òí"
},
kuo=
{
"ÊÊ","À©","À¨","À«","Àª","èé","òÒ"
},
hong=
{
"ºì","ºê","ºé","ºä","ºç","ºè","ºë","ºå","ºæ","ãü","Ùê","Ş®","ãÈ","Ú§","İ¦","Ùä","Ş°"
},
mai=
{
"Âò","Âô","Âó","Âõ","Âö","Âñ","ö²","İ¤","Û½"
},
xiu=
{
"ĞŞ","Ğã","Ğİ","ËŞ","Ğä","Ğå","³ô","Ğà","Ğâ","Ğß","Ğá","á¶","äå","âÓ","âÊ","ßİ","÷Û","ğ¼","õ÷"
},
qin=
{
"Ç×","ÇÚ","ÇÖ","ÇØ","ÇÕ","ÇÙ","Çİ","ÇÛ","Çß","ÇŞ","ÇÜ","ñû","àß","ñæ","àº","Şì","äÚ","ÜË","ôÀ","âÛ","ï·","ßÄ","éÕ","òû"
},
cuo=
{
"´ë","´í","´è","´ì","´ê","´é","õã","ï±","ØÈ","áÏ","ğî","ïó","ğû","ëâ","õº"
},
long=
{
"Áú","Â¡","Åª","Â¢","Áı","Â£","Áû","Â¤","ëÊ","çç","Áş","Ü×","Áü","íÃ","Ûâ","ãñ","èĞ","ñª"
},
dun=
{
"¶Ö","¶Ù","¶Ü","¶Ø","¶×","¶Õ","¶Ú","ãç","¶Û","ìÀ","íï","¶İ","õ»","í»","ïæ","íâ"
},
kang=
{
"¿µ","¿¹","¿¸","¿¶","¿»","¿º","¿·","Øø","îÖ","ãÊ"
},
pu=
{
"ÆÕ","±©","ÆÌ","ÆÖ","ÆÓ","±¤","ÆÏ","Æ×","ÆÒ","ÆË","ÆÍ","ÆÑ","ÆØ","ÆÙ","äß","ÆÎ","ÆÔ","è±","å§","ÆĞ","¸¬","õë","Ùé","àÛ","ë«","ïè","ïä"
},
reng=
{
"ÈÔ","ÈÓ"
},
bo=
{
"²¨","²©","²¥","²ª","²¦","±¡","²®","²£","²«","°Ø","²´","²°","°ş","²³","ÆÇ","²·","²µ","²±","²²","ô¤","²¤","íç","²­","êş","²¬","Ùñ","²§","²¯","ë¢","âÄ","õË","îà","õÀ","éŞ","à£","ğ¾","ØÃ","õÛ"
},
lan=
{
"À¼","ÀÀ","À¶","Àº","À¸","á°","ÀÃ","ÀÄ","ÀÂ","À¿","À½","À¹","ÀÁ","é­","ìµ","À·","À»","ñÜ","î½","À¾","ïç","äí"
},
piao=
{
"Æ±","ÆÓ","Æ¯","Æ®","æÎ","Æ°","Øâ","çÎ","éè","î©","æô","àÑ","İ³","óª"
},
sun=
{
"Ëğ","Ëï","Ëñ","İ¥","é¾","öÀ","áø","â¸"
},
ning=
{
"Äş","Äı","ÜÑ","Å¡","Å¢","Äû","ßÌ","Äü","Øú","ñ÷","å¸"
},
ku=
{
"¿à","¿â","¿Ş","¿á","¿ã","¿İ","¿ß","÷¼","Ü¥","ç«","ØÚ","à·"
},
nao=
{
"Å¬","ÄÔ","ÄÖ","ÄÕ","ÄÓ","è§","Ä×","Ø«","Ûñ","îó","ßÎ","íĞ","â®","òÍ"
},
tao=
{
"Ì×","ÌÖ","ÌÕ","ÌÎ","ÌÓ","ÌÒ","ÌÑ","ÌÔ","ÌÍ","ÌÏ","èº","ß¶","ìâ","ä¬","ßû","ÌĞ","÷Ò","Ø»"
},
song=
{
"ËÍ","ËÉ","ËÎ","ËÏ","ËÌ","ËÊ","ËĞ","áÔ","äÁ","ËË","ã¤","áÂ","Ú¡","âì","ñµ","İ¿"
},
mou=
{
"Ä³","Ä±","Ä²","çÑ","íø","ßè","òú","öÊ","òÖ","Ù°"
},
pa=
{
"ÅÉ","ÅÂ","ÅÁ","ÅÀ","°Ç","Å¿","ÅÃ","Å¾","İâ","°Ò","èË","îÙ","óá"
},
lue=
{
"ÂÔ","ÂÓ","ï²"
},
hei=
{
"ºÚ","ºÙ"
},
chai=
{
"²î","²ğ","²ñ","îÎ","²ò","Ù­","ò²","ğû"
},
a=
{
"°¢","°¡","ºÇ","ëç","àÄ","ß¹","ï¹"
},
ting=
{
"Ìı","Í¥","Í£","Ìü","Í¢","Í¦","Í¤","Í§","æÃ","Í¡","îú","Ìş","öª","î®","òÑ","İã","èè","Üğ"
},
sha=
{
"É³","ÏÃ","É±","É´","É°","É¶","É¯","É²","É¼","Éµ","É·","öè","ö®","àÄ","ğğ","ôÄ","êı","ï¡","ßş","ì¦"
},
tuo=
{
"ÍĞ","ÍÑ","ÍØ","ÍÏ","Í×","ÆÇ","ÍÕ","ÍÓ","ãû","ÍÒ","¶æ","ÍÔ","ÍÙ","ÍÖ","Ûç","Ù¢","íÈ","õÉ","âÕ","èŞ","éÒ","Ø±","îè","õ¢","ö¾","óê","èØ"
},
pan=
{
"ÅĞ","ÅÌ","·¬","ÅË","ÅÊ","ÅÎ","ŞÕ","ÅÏ","ÅÖ","ÅÑ","õç","ÅÍ","ãİ","ó´","ãú","ñÈ","ñá"
},
gua=
{
"À¨","¹Ò","¹Ï","¹Î","¹Ñ","ØÔ","ßÉ","¹Ó","¹Ğ","ëÒ","Ú´","ğ»","èé"
},
lou=
{
"Â¥","Â¶","Â©","Âª","Â¦","Â§","Â¨","à¶","ïÎ","ÙÍ","ğü","÷Ã","ñï","ò÷","áĞ","İä"
},
han=
{
"ºº","º«","º¬","ºµ","º®","º¹","º­","º¯","º°","º¶","º±","º¸","º²","ºª","º³","å«","º©","º´","º¨","º·","ãÛ","÷ı","Úõ","ò¥","òÀ","êÏ","İÕ","ñü","ìÊ","Şş"
},
cao=
{
"²İ","²Ù","²Ü","²Û","²Ú","àĞ","äî","ó©","ô½"
},
cang=
{
"²Ø","²Ö","²Ô","²×","²Õ"
},
zang=
{
"²Ø","Ôà","Ôá","Ôß","ê°","ŞÊ","æà"
},
shun=
{
"Ë³","Ë²","Ë´","Ë±"
},
ka=
{
"¿¨","¿¦","¿§","ßÇ","¿©","Øû","ëÌ"
},
qia=
{
"¿¨","Ç¡","Ç¢","Ù¤","Æş","÷Ä","ñÊ","İÖ"
},
qiao=
{
"ÇÅ","ÇÇ","ÇÈ","ÇÉ","ÇÄ","ÇÃ","ÇÎ","¿Ç","È¸","½¶","ÇÆ","ÇÌ","ÇÏ","ÇÍ","ÇÂ","ÇË","Üñ","õÎ","éÔ","ã¾","ÇÊ","ÇÁ","á½","Ú½","ÚÛ","ã¸","÷³","íÍ","Øä","çØ"
},
fou=
{
"·ñ","ó¾"
},
bang=
{
"°ï","°î","°ñ","°ô","°ò","°÷","°ó","°ø","°õ","°ö","°ù","°ğ","äº","İò"
},
ao=
{
"°Â","°Ä","°Á","°¾","°¼","Ïù","÷¡","°½","åÛ","÷é","°À","Ûê","°¿","à»","ŞÖ","°Ã","á®","òü","æñ","éá","öË","æÁ","âÚ","ñú"
},
zhai=
{
"Õ®","Ôñ","Õ¬","Õ¯","²à","Õª","Õ­","Õ«","¼À","µÔ","íÎ","ñ©"
},
zhui=
{
"×·","×¹","×º","×µ","×¶","×¸","ã·","æí","çÄ"
},
chou=
{
"³ï","³é","³ñ","³ê","³î","³ó","³ô","³ğ","³ë","³í","³ò","³ì","ã°","Ù±","ñ¬","öÅ","àü"
},
zen=
{
"Ôõ","ÚÚ"
},
kui=
{
"¿÷","¿ü","À¢","¿ı","À¡","À£","ØÑ","¿û","¿ú","¿ø","åÓ","î¥","Ø¸","ñù","à°","Ùç","óñ","¿ù","à­","Şñ","Úó","¿ş","êÒ","õÍ","İŞ","ã´","ã¦","òñ"
},
ha=
{
"¹ş","Ïº","¸ò","îş"
},
za=
{
"ÔÓ","Ôú","ÔÛ","ÔÒ","Õ¦","ÔÑ","ßÆ"
},
luan=
{
"ÂÒ","ÂÑ","ÂĞ","ÂÍ","ğ½","èï","öÇ","ÂÎ","ÂÏ","Ùõ","æ®"
},
xiong=
{
"ĞÛ","ĞÖ","ĞÜ","ĞØ","Ğ×","ĞÙ","ĞÚ","Üº"
},
ne=
{
"ÄØ","ÄÄ","ÄÅ","Ú«"
},
zan=
{
"ÔŞ","Ôİ","ÔÛ","ÔÜ","êÃ","ô¢","ôØ","è¶","öÉ","ôõ","ŞÙ"
},
rui=
{
"Èğ","Èñ","î£","ÜÇ","Èï","Ş¨","ò¸","èÄ"
},
tang=
{
"ÌÃ","ÌÆ","ÌÇ","ÌÀ","ÌÁ","ÌÉ","ÌË","ÌÈ","ÌÄ","ÌÌ","ÌÊ","ÌÅ","ÌÂ","ïÛ","ÙÎ","ó«","äç","àû","ôÊ","éÌ","õ±","ó¥","ñí","ï¦","è©"
},
run=
{
"Èó","Èò"
},
kua=
{
"¿ç","¿ä","¿å","¿æ","¿è","Ù¨"
},
wa=
{
"Íß","ÍÚ","ÍŞ","Íİ","Íà","ÍÜ","°¼","ÍÛ","Øô","æ´","ëğ"
},
meng=
{
"ÃÉ","ÃË","ÃÎ","ÃÍ","ÃÏ","ÃÈ","Ã¥","ëü","ÃÌ","ÃÊ","ÛÂ","ãÂ","òì","òµ","ó·","ô¿","İù","ô»","Ş«","íæ"
},
bin=
{
"±ö","±õ","±ó","±ò","±ô","éë","çÍ","÷Ş","éÄ","±÷","ë÷","çã","ïÙ","áÙ","÷Æ","ÙÏ"
},
leng=
{
"Àä","ã¶","Àâ","Àã","Ü¨"
},
peng=
{
"Åô","Åó","Åí","Åò","Åî","Åö","Åï","Åõ","Åë","Åñ","Åì","Åê","Åğ","âñ","Åé","àØ","ó²","Ü¡"
},
niu=
{
"Å£","Å¦","Å¤","Å¥","ŞÖ","æ¤","âî","áğ"
},
rou=
{
"Èâ","Èá","Èà","ôÛ","÷·","õå"
},
ruo=
{
"Èô","Èõ","Ù¼"
},
sen=
{
"É­"
},
sa=
{
"Èø","È÷","Èö","ìª","Ø¦","Øí","êı","ëÛ"
},
juan=
{
"¾í","¾è","¿¡","¾ì","¾ê","¾ë","¾î","öÁ","ïÔ","ä¸","¾é","Û²","îÃ","áú","ïÃ","èğ"
},
pao=
{
"ÅÜ","ÅÚ","Åİ","Å×","ÅÙ","ÅÛ","ÅØ","ğå","âÒ","áó","ŞË","ëã"
},
ruan=
{
"Èí","Èî","ëÃ"
},
lang=
{
"ÀË","ÀÊ","ÀÉ","ÀÈ","ÀÇ","ÀÅ","ÀÆ","òë","ãÏ","ï¶","İ¹","à¥","İõ","ïü"
},
zun=
{
"×ğ","×ñ","÷®","é×","ß¤"
},
ken=
{
"¿Ï","¿Ñ","¿Ò","¿Ğ","ñÌ"
},
hun=
{
"»é","»ì","»ê","»ë","»è","»ç","âÆ","Ú»","äã","ãÔ"
},
en=
{
"¶÷","àÅ","Şô","İì"
},
qiong=
{
"Çî","Çí","ñ·","Úö","Üä","óÌ","õ¼","òË","öÆ"
},
rao=
{
"ÈÆ","ÈÅ","ÈÄ","æ¬","èã","Üé"
},
mang=
{
"Ã¦","Ã¤","Ã£","Ã¢","Ã¥","Ã§","òş","Úø","íË","äİ"
},
nuo=
{
"Åµ","Å²","ÄÈ","Å´","Å³","ÙĞ","ßö","Şù","ï»"
},
teng=
{
"ÌÚ","ÌÛ","ÌÙ","ëø","ÌÜ"
},
nin=
{
"Äú"
},
miao=
{
"Ãç","Ãë","Ãî","Ãè","Ãí","Ãé","çÑ","Ãì","íµ","Ãê","ç¿","åã","ğÅ","èÂ","íğ","ß÷"
},
mie=
{
"Ãğ","Ãï","óú","Ø¿","ßã","óº"
},
niang=
{
"Äï"
},
nai=
{
"ÄË","ÄÌ","ÄÍ","ÄÎ","Ø¾","İÁ","ÄÊ","èÍ","Üµ"
},
sang=
{
"É£","É¥","É¤","Şú","òª","íß"
},
ca=
{
"²ğ","²Á","àê","íå"
},
sao=
{
"É¨","É§","É©","ÉÒ","çÒ","É¦","ğş","ëı","Ü£","çØ","öş"
},
zuan=
{
"×ê","×¬","×ë","ß¬","çÚ","õò"
},
shua=
{
"Ë¢","Ë£","à§"
},
gun=
{
"¹ö","¹÷","¹õ","Ùò","íŞ","öç","çµ"
},
guai=
{
"¹Ö","¹Õ","¹Ô"
},
pang=
{
"ÅÔ","ÅÓ","ÅÒ","°ò","ÅÖ","°õ","ó¦","áİ","äè","åÌ","ÅÕ"
},
nuan=
{
"Å¯"
},
shuai=
{
"Ë¥","Ë§","Ë¤","Ë¦","ó°"
},
cui=
{
"Ë¥","´ß","´Ş","´à","´ä","İÍ","´â","´İ","è­","´á","ã²","´ã","ßı","ö¿","ë¥","éÁ"
},
niao=
{
"Äñ","Äò","Äç","ôÁ","ëå","Üà","æÕ"
},
die=
{
"µø","µş","µû","µü","µú","µù","µı","ëº","ñó","à©","õÚ","Ü¦","ğ¬","öø","Ûì","Şé","õŞ"
},
pen=
{
"Åç","Åè","äÔ"
},
chui=
{
"´µ","´¹","´¸","´¶","×µ","Úï","é³","´·","é¢"
},
ang=
{
"°º","°»","°¹"
},
keng=
{
"¿Ó","ï¬","¿Ô"
},
tun=
{
"ÍÌ","ÍÍ","¶Ú","ÍÊ","ëà","ÍÎ","â½","êÕ","ÙÛ"
},
diu=
{
"¶ª","îû"
},
weng=
{
"ÎÌ","ÎË","ÎÍ","İî","Ş³"
},
sou=
{
"ËÒ","ËÑ","ËÓ","ËÔ","à²","ÛÅ","âÈ","Ş´","ì¬","àÕ","äÑ","ïË","òô","î¤"
},
ga=
{
"¼Ğ","¸Â","ŞÎ","¸ì","¸Á","ê¸","æØ","îÅ","æÙ"
},
lia=
{
"Á©"
},
nen=
{
"ÄÛ","í¥"
},
nang=
{
"ÄÒ","âÎ","àì","êÙ","ß­"
},
nie=
{
"Äô","Äó","Äù","Äø","Äõ","ŞÁ","Äö","õæ","à¿","ô«","Ä÷","ò¨","Ø¿","Úí"
},
beng=
{
"±Ã","±À","°ö","±Ä","±Å","±Á","±Â","àÔ","ê´"
},
cou=
{
"´Õ","ê£","ëí","é¨"
},
pou=
{
"ÆÊ","Şå","Ùö"
},
seng=
{
"É®"
},
nue=
{
"Å°"
},
cuan=
{
"´Ü","ÔÜ","´Û","´Ú","ß¥","ìà","Ùà","ïé"
},
chuo=
{
"ê¡","´Â","´Á","à¨","öº","õÖ"
},
chuai=
{
"´§","õß","à¨","àÜ","Şõ","ëú"
},
jiong=
{
"¾½","¾¼","åÄ","êÁ","ìç"
},
shuan=
{
"Ë¨","Ë©","äÌ","ãÅ"
},
zei=
{
"Ôô"
},
pie=
{
"Æ³","Æ²","ÜÖ","ë­","Ø¯"
},
miu=
{
"Ãı"
},
o=
{
"Å¶","àŞ","à¸"
},
dia=
{
"àÇ"
},
nou=
{
"ññ"
},
ei=
{
"ÚÀ"
},
}

	local T2=T1[pinyin]
	if T2==nil then 			--Èç¹ûÊäÈëµÄÆ´ÒôÎŞÆ¥ÅäÏî
		Cls()
		DrawStrBox(x,y,"²éÎŞ´Ë×Ö£¬ÇëÖØĞÂÊäÈë",C_GOLD,24) 
		lib.ShowSurface(0)
		lib.Delay(2000)
		return ""
	end
	local page=0				--Ñ¡×ÖÒ³Ãæ£¬³õÊ¼µ±È»ÊÇµÚÒ»Ò³ÁË
	local str=""				--ÓÃÓÚ±£´æºòÑ¡×Ö·û
	while true do
		str="";
		for i=1,9 do
			if(T2[i+9*page]==nil) then 
				break;
			else 
				str=str..i..". "..T2[i+9*page].."  ";
			end
		end		
		ShowPinyin(x,y,word,pinyin,str)
	    local keypress=WaitKey();
        lib.Delay(100);
		if keypress==61 and T2[9*(page+1)+1]~=nil then
			page=page+1;
		elseif keypress==45 and page>0 then
			page=page-1;
		elseif keypress==27 then 
			return "";
		elseif keypress>48 and keypress<58 then
			return T2[page*9+keypress-48];
		end
	
	end
end

function GetPinyin(x,y,word)--ÊäÈëÆ´Òô
	local T3={"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"}
	local T4={"£°","£±","£²","£³","£´","£µ","£¶","£·","£¸","£¹"}
	local str=""
	while true do
		ShowPinyin(x,y,word,str)
	    local keypress=WaitKey();
        lib.Delay(100);
		if keypress>96 and keypress<123 then
			str=str..T3[keypress-96]
		elseif keypress==8 then
			if string.len(str)==0 then word=string.sub(word,1,-3)
			else str=string.sub(str,1,-2)
			end
		elseif keypress>47 and keypress<58 then
			return-1,word..T4[keypress-47];
		elseif keypress==VK_RETURN and str=="" then
			return "finish";
		elseif keypress==VK_SPACE or keypress==VK_RETURN then
			return str,word;
		elseif keypress==VK_ESCAPE then
			return -1;
		end
	end
end

function ShowPinyin(x,y,str1,str2,str3)
	Cls()
	local size=24
	DrawBox(x,y+size,640-x,y+5*size,C_ORANGE)
	if str3==nil then						--ÊäÈëÆ´Òô×´Ì¬
		DrawStrBox(x,y-size/2,"ÇëÊäÈë(Æ´)",C_WHITE,size)
	else									--Ñ¡×Ö×´Ì¬
		DrawStrBox(x,y-size/2,"ÇëÑ¡Ôñ",C_WHITE,size)
		DrawString(x+15,y+size*3.5,str3,C_WHITE,size)
	end
	lib.DrawRect(x+10,y+size*3,630-x,y+size*3+2,C_WHITE)
	DrawString(x+20,y+size*1.6,str1,C_RED,size)
	DrawString(x+20+size*string.len(str1)/2,y+size*1.6,str2,C_GOLD,size)
	lib.ShowSurface(0)
end


function YesorNo(str)
	local yesword={"ÊÇ","ºÃ","ĞĞ","¿ÉÒÔ","Í¬Òâ","Ô¸Òâ","Ã»ÎÊÌâ","µ±È»","Òª","½ÓÊÜ","µãÍ·","²»¾Ü¾ø"}
	local noword={"²»","·ñ","²»ĞĞ","²»ºÃ","²»¿ÉÒÔ","²»Í¬Òâ","²»Ô¸Òâ","Ò¡Í·","ÓĞÎÊÌâ","¾Ü¾ø","²»ÓÃ","²»Òª"}
	local firstword={"","ÎÒ","ÎÒÃÇ","°³","ÔÛÃÇ","ÔÚÏÂ","Ğ¡Éú","Ğ¡×Ó","ÀÏ×Ó","àÅ","¶÷","ßí"}
	local lastword={"","µÄ","ÁË","°É"}
	for i=1,12 do
		for a=1,12 do
			for b=1,4 do
				if str==firstword[a]..yesword[i]..lastword[b] then return 1 end
				if str==firstword[a]..noword[i]..lastword[b] then return 2 end
			end
		end
	end
	return 0
end




--ĞÂ¶Ô»°·½Ê½
--¼ÓÈë¿ØÖÆ×Ö·û
--ÔİÍ££¬ÈÎÒâ¼üºó¼ÌĞø£¬£ğ
--¿ØÖÆÑÕÉ« £Ò=red£Ç=gold£Â=black£×=white£Ï=orange
--¿ØÖÆ×Ö·ûÏÔÊ¾ËÙ¶È£°£­£¹
--¿ØÖÆ×ÖÌå£Á£Ó£Ä£Æ
--¿ØÖÆ»»ĞĞ£È·ÖÒ³£Ğ
function say(s,headid,flag)          --¸öÈËĞÂ¶Ô»°
    local picw=100;       --×î´óÍ·ÏñÍ¼Æ¬¿í¸ß
	local pich=100;
	local talkxnum=18;         --¶Ô»°Ò»ĞĞ×ÖÊı
	local talkynum=3;          --¶Ô»°ĞĞÊı
	local dx=2;
	local dy=2;
    local boxpicw=picw+10;
	local boxpich=pich+10;
	local boxtalkw=talkxnum*CC.DefaultFont+10;
	local boxtalkh=boxpich;

    local talkBorder=(pich-talkynum*CC.DefaultFont)/(talkynum+1);

	--ÏÔÊ¾Í·ÏñºÍ¶Ô»°µÄ×ø±ê
    local xy={ [0]={headx=dx,heady=dy,
	                talkx=dx+boxpicw+2,talky=dy,
					showhead=1},
                   {headx=CC.ScreenW-1-dx-boxpicw,heady=CC.ScreenH-dy-boxpich,
				    talkx=CC.ScreenW-1-dx-boxpicw-boxtalkw-2,talky= CC.ScreenH-dy-boxpich,
					showhead=1},
                   {headx=dx,heady=dy,
				   talkx=dx+boxpicw+2,talky=dy,
				   showhead=0},
                   {headx=CC.ScreenW-1-dx-boxpicw,heady=CC.ScreenH-dy-boxpich,
				   talkx=CC.ScreenW-1-dx-boxpicw-boxtalkw-2,talky= CC.ScreenH-dy-boxpich,
					showhead=1},
                   {headx=CC.ScreenW-1-dx-boxpicw,heady=dy,
				    talkx=CC.ScreenW-1-dx-boxpicw-boxtalkw-2,talky=dy,showhead=1},
                   {headx=dx,heady=CC.ScreenH-dy-boxpich,talkx=dx+boxpicw+2,talky=CC.ScreenH-dy-boxpich,showhead=1}, }

    if flag<0 or flag>5 then
        flag=0;
    end
	headid=JY.Person[headid]["Í·Ïñ´úºÅ"]
    if xy[flag].showhead==0 then
        headid=-1;
    end


    if CONFIG.KeyRepeat==0 then
	     lib.EnableKeyRepeat(0,CONFIG.KeyRepeatInterval);
	end
    lib.GetKey();
	
	local function readstr(str)
		local T1={"£°","£±","£²","£³","£´","£µ","£¶","£·","£¸","£¹"}
		local T2={{"£Ò",C_RED},{"£Ç",C_GOLD},{"£Â",C_BLACK},{"£×",C_WHITE},{"£Ï",C_ORANGE}}
		local T3={{"£Á",CC.FontName},{"£Ó",Font_Xihei},{"£Ä",Font_Qiti},{"£Æ"}}
		--ÃÀ¹ÛÆğ¼û£¬Õë¶Ô²»Í¬×ÖÌåÍ¬Ò»ĞĞÏÔÊ¾£¬ĞèÒªÎ¢µ÷£ù×ø±ê£¬ÒÔ¼°×ÖºÅ
		--ÒÔÄ¬ÈÏµÄ×ÖÌåÎª±ê×¼£¬ÆôÌåĞèÏÂÒÆ£¬Ï¸ºÚĞèÉÏÒÆ
		for i=0,9 do
			if T1[i+1]==str then return 1,i*50 end
		end
		for i=1,5 do
			if T2[i][1]==str then return 2,T2[i][2] end
		end
		for i=1,3 do
			if T3[i][1]==str then return 3,T3[i][2] end
		end
		return 0
	end
	
	local function mydelay(t)
		if t<=0 then return end
		lib.ShowSurface(0)
		lib.Delay(t)
	end
	
	local page,cy,cx=0,0,0
	local color,t,font=C_WHITE,0,CC.FontName
	while string.len(s)>1 do
		if page==0 then				--ĞÂµÄÒ»Ò³£¬ÇåÆÁ£¬ÏÔÊ¾Í·Ïñ
			Cls()
            if headid>=0 then
                DrawBox(xy[flag].headx, xy[flag].heady, xy[flag].headx + boxpicw, xy[flag].heady + boxpich,C_WHITE);
				local w,h=lib.PicGetXY(1,headid*2);
                local x=(picw-w)/2;
				local y=(pich-h)/2;
				lib.PicLoadCache(1,headid*2,xy[flag].headx+5+x,xy[flag].heady+5+y,1);
            end
            DrawBox(xy[flag].talkx, xy[flag].talky, xy[flag].talkx +boxtalkw, xy[flag].talky + boxtalkh,C_WHITE);			
			page=1
		end
		local str=string.sub(s,1,2)
		s=string.sub(s,3,-1)
		--¿ªÊ¼¿ØÖÆÂß¼­
		if str=="£È" then
			cx=0
			cy=cy+1
			if cy==3 then
				cy=0
				page=0
			end
		elseif str=="£Ğ" then
			cx=0
			cy=0
			page=0
		elseif str=="£ğ" then
			ShowScreen();
			WaitKey();	
			lib.Delay(100)		
		else 
			local kz1,kz2=readstr(str)
			if kz1==1 then
				t=kz2
			elseif kz1==2 then
				color=kz2
			elseif kz1==3 then
				font=kz2
			else
				lib.DrawStr(xy[flag].talkx+CC.DefaultFont*cx+5,
							xy[flag].talky+(CC.DefaultFont+talkBorder)*cy+talkBorder,
							str,color,CC.DefaultFont,font,0,0)
				mydelay(t)
				cx=cx+1
				if cx==talkxnum then
					cx=0
					cy=cy+1
					if cy==talkynum then
						cy=0
						page=0
					end
				end
			end
		end
		--Èç¹û»»Ò³£¬ÔòÏÔÊ¾£¬µÈ´ı°´¼ü
		if page==0 or string.len(s)<2 then
			ShowScreen();
			WaitKey();
			lib.Delay(100)
		end
	end


    if CONFIG.KeyRepeat==0 then
	     lib.EnableKeyRepeat(CONFIG.KeyRepeatDelay,CONFIG.KeyRepeatInterval);
	end

	Cls();
end


function fenjie(num)
	local a,b,c
	a=div100(num)
	b=math.modf(math.fmod(num,100)/10)
	c=math.fmod(num,10)
	return a,b,c
end


function drawname(x,y,name,size)
	x=x-math.modf(size/2)
	local namelen=string.len(name)/2
	local zi={}		
	for i=1,namelen do
		zi[i]=string.sub(name,i*2-1,i*2)
		DrawString(x,y,zi[i],C_WHITE,size)
		y=y+size
	end
end
	
function WAR_CALLEVENT(num)
	local war={}
	war[0]=1
	war[136]=1
	war[137]=1
	
	
	if war[num]==nil then return 0
	else	
		local eventfilename=string.format("warevent%d.lua",num);
		lib.Debug(eventfilename);
		return dofile(CONFIG.ScriptPath.."war\\" .. eventfilename) or 0;
	end
end



function War_WugongCure(id,emeny,magic,wugong,level)
	local pid=WAR.Person[id]["ÈËÎï±àºÅ"]
	local eid=WAR.Person[emeny]["ÈËÎï±àºÅ"]
	--Ò½ÁÆ
	--¾ßÌåµÄ¹«Ê½»¹Ã»×ĞÏ¸¿¼ÂÇ¹ı
	--³õ²½´òËã¿ÉÒÔ£º¼ÓÑª£¬¼ÓÄÚÁ¦£¬¼ÓÌåÁ¦£¬¼õÖĞ¶¾£¬¼õÊÜÉË
	--Õë¶Ô²»Í¬µÄ×÷ÓÃ£¬¿ÉÒÔ²»Í¬µÄÑÕÉ«ÏÔÊ¾
	--µ«ÊÇ£¬Èç¹û¶à¸ö×÷ÓÃ¹²´æ£¬ÔòÖ»ÄÜÏÔÊ¾Ò»ÖÖÑÕÉ«£¬³õ²½¿¼ÂÇÉúÃüÊÇ×îÓÅÏÈµÄ
	--¿ÉÒÔ¿¼ÂÇ¼ÓÉÏÎÄ×Ö£¬À´ÏÔÊ¾ÊÇ¼ÓÁËÊ²Ã´
	--ÔİÊ±²»¿¼ÂÇÄÇÃ´¶à°É£¬¹ÃÇÒµ±È»Ö»ÄÜÆğÒ»¸ö×÷ÓÃ
	local kind=JY.Wugong[wugong]["Îä¹¦ÀàĞÍ"]
	if kind==1 then
		local maxlife,curlife=JY.Person[eid]["ÉúÃü×î´óÖµ"],JY.Person[eid]["ÉúÃü"]
		JY.Person[eid]["ÉúÃü"]=curlife+JY.Wugong[wugong]["¹¥»÷"]*level
		if JY.Person[eid]["ÉúÃü"]>JY.Person[eid]["ÉúÃü×î´óÖµ"] then JY.Person[eid]["ÉúÃü"]=JY.Person[eid]["ÉúÃü×î´óÖµ"] end
		WAR.Person[emeny]["µãÊı"]=JY.Person[eid]["ÉúÃü"]-curlife
		WAR.Effect=3;
		--lib.Debug('123')
	elseif kind==2 then
		
	elseif kind==3 then
		
	elseif kind==4 then
		
	elseif kind==5 then
		
	else return end;
end


function KfSort(pid)
	local kfnum=0
	local kf={}
	local set={}
	--¶Á³öÔ­ÓĞ×°±¸Îä¹¦
	local nei=JY.Person[pid]["Îä¹¦"][JY.Person[pid]["ÄÚ¹¦"]]
	local qing=JY.Person[pid]["Îä¹¦"][JY.Person[pid]["Çá¹¦"]]
	local te=JY.Person[pid]["Îä¹¦"][JY.Person[pid]["ÌØ¼¼"]]
	
	
	--[[
	for i=1,CC.Kungfunum-1 do
		for j=i+1,CC.Kungfunum do
			if JY.Person[pid]["Îä¹¦"][i]==nil or JY.Person[pid]["Îä¹¦"][i][1]>JY.Person[pid]["Îä¹¦"][j][1] or JY.Person[pid]["Îä¹¦"][i][1]==0 then
				JY.Person[pid]["Îä¹¦"][i],JY.Person[pid]["Îä¹¦"][j]=JY.Person[pid]["Îä¹¦"][j],JY.Person[pid]["Îä¹¦"][i]
			end
		end
	end
	]]--
	--¶Á³öÔ­ÓĞÎä¹¦
	for i=1,CC.Kungfunum do
		local id=JY.Person[pid]["Îä¹¦"][i] or {0,0}
		if id[1]>0 then
		 kf[i]=id
		 kfnum=kfnum+1
		end
	end
	--ÅÅĞò,°´Îä¹¦±àºÅ
	for i=1,kfnum-1 do
		for j=i+1,kfnum do
			if kf[i][1]>kf[j][1] then
				kf[i],kf[j]=kf[j],kf[i]
			end
		end
	end
	--ÖØĞÂĞ´Èë
	for i=1,CC.Kungfunum do
		if i>kfnum then
			JY.Person[pid]["Îä¹¦"][i]={0,0}
		else
			JY.Person[pid]["Îä¹¦"][i]=kf[i]	
		end
	end
	--ÖØĞÂĞ´Èë×°±¸Îä¹¦
	for i=1,CC.Kungfunum do
		if JY.Person[pid]["Îä¹¦"][i]==nil or JY.Person[pid]["Îä¹¦"][i][1]==0 then break
		elseif JY.Person[pid]["Îä¹¦"][i][1]==nei then JY.Person[pid]["ÄÚ¹¦"]=i
		elseif JY.Person[pid]["Îä¹¦"][i][1]==nei then JY.Person[pid]["ÄÚ¹¦"]=i
		elseif JY.Person[pid]["Îä¹¦"][i][1]==nei then JY.Person[pid]["ÄÚ¹¦"]=i 
		end
	end
	

end
















------Õ½¶·ÊÂ¼şÖĞÊ¹ÓÃµÄ²¿·Öº¯Êı----È«²¿ÒÔWE_¿ªÍ·
function WE_xy(x,y,id)			--»ñÈ¡ÀëÄ¿±êxy×î½Ó½üµÄ¿ÉĞĞ×ø±ê
--ÊäÈëidÊ±£¬ÊÊÓÃÓÚÒÆ¶¯
--²»ÊäÈëÊ±£¬ÊÊÓÃÓÚ³öÏÖ
	if id~=nil then
		War_CalMoveStep(id,128,0)
	end
	if GetWarMap(x,y,3)~=255 and War_CanMoveXY(x,y,0) then
		return x,y
	else
		for s=1,128 do
			for i=1,s do
				local j=s-i
				if i>=1 and j>=1 then
					if i<63 and j<63 then
						if GetWarMap(x+i,y+j,3)~=255 and War_CanMoveXY(x+i,y+j,0) then
							return x+i,y+j
						end
						if GetWarMap(x-j,y+i,3)~=255 and War_CanMoveXY(x-j,y+i,0) then
							return x-j,y+i
						end
						if GetWarMap(x-i,y-j,3)~=255 and War_CanMoveXY(x-i,y-j,0) then
							return x-i,y-j	
						end
						if GetWarMap(x+j,y-i,3)~=255 and War_CanMoveXY(x+j,y-i,0) then
							return x+j,y-i	
						end						
					end
				end
			end
		end		
	end
end	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	--[[
	
	if GetWarMap(x,y,3)~=255 and War_CanMoveXY(x,y,0) then
		return x,y
	else
		CleanWarMap(4,0)
		local steparray={};     --ÓÃÊı×é±£´æµÚn²½µÄ×ø±ê¡£
		
			steparray.num=1;
			steparray.x={};
			steparray.y={};
		
		steparray.x[1]=x;
		steparray.y[1]=y;
		SetWarMap(x,y,4,1) 
		x,y=WE_FindNextxy(steparray)
		CleanWarMap(4,0)
		return x,y
	end
end


function WE_FindNextxy(steparray)
	local num=0
	for i=1,steparray.num do
	    local x=steparray.x[i];
	    local y=steparray.y[i];
	--lib.Debug("a"..(x)..','..y..','..GetWarMap(x,y,4))
	    if x+1<CC.WarWidth-1 and GetWarMap(x+1,y,4)==0 then                        --µ±Ç°²½ÊıµÄÏàÁÚ¸ñ
			if GetWarMap(x+1,y,3)==255 or War_CanMoveXY(x+1,y,0)==false then
                num=num+1;
                steparray.x[num]=x+1;
                steparray.y[num]=y;
				SetWarMap(x+1,y,4,1) 
	--lib.Debug((x)..','..y..','..GetWarMap(x,y,4))
			else return x+1,y
			end
		end
	    if x-1>=0 and GetWarMap(x-1,y,4)==0 then                        --µ±Ç°²½ÊıµÄÏàÁÚ¸ñ
			if GetWarMap(x-1,y,3)==255 or War_CanMoveXY(x-1,y,0)==false then
                num=num+1;
                steparray.x[num]=x-1;
                steparray.y[num]=y;
				SetWarMap(x-1,y,4,1) 
			else return x-1,y
			end
		end
	    if y+1<CC.WarWidth-1 and GetWarMap(x,y+1,4)==0 then                        --µ±Ç°²½ÊıµÄÏàÁÚ¸ñ
			if GetWarMap(x,y+1,3)==255 or War_CanMoveXY(x,y+1,0)==false then
                num=num+1;
                steparray.x[num]=x;
                steparray.y[num]=y+1;
				SetWarMap(x,y+1,4,1) 
			else return x,y+1
			end
		end
	    if y-1>=0 and GetWarMap(x,y-1,4)==0 then                        --µ±Ç°²½ÊıµÄÏàÁÚ¸ñ
			if GetWarMap(x,y-1,3)==255 or War_CanMoveXY(x,y-1,0)==false then
                num=num+1;
                steparray.x[num]=x;
                steparray.y[num]=y-1;
				SetWarMap(x,y-1,4,1) 
			else return x,y-1
			end
		end	
	--lib.Debug("b"..(x)..','..y..','..GetWarMap(x,y,4))
	end
	steparray.num=num
	return WE_FindNextxy(steparray)
	--local nx,ny=WE_FindNextxy(steparray)
	--return nx,ny
end

--]]
function WE_getwarid(pid)
	for i=0,WAR.PersonNum-1 do
		if WAR.Person[i]["ÈËÎï±àºÅ"]==pid then return i end
	end
	return -1
end

function WE_move(pid,x,y)
--pid,ÈËÎï±àºÅ
--x,y,Ä¿µÄ×ø±êÓë×ø±êµÄÏà¶ÔÖµ
	local id=WE_getwarid(pid)
	if id==-1 then return end
	WAR.CurID=id
	local cx,cy=WAR.Person[id]["×ø±êX"],WAR.Person[id]["×ø±êY"]
	local nx,ny=WE_xy(cx+x,cy+y,id)
	--lib.Debug(x..','..y..','..nx..','..ny)
	War_MovePerson(nx,ny)
	lib.Delay(100)
end

function WE_moveto(pid,x,y)
--pid,ÈËÎï±àºÅ
--x,y,Ä¿µÄ×ø±ê
	local id=WE_getwarid(pid)
	if id==-1 then return end
	WAR.CurID=id
	local nx,ny=WE_xy(x,y,id)
	--lib.Debug(x..','..y..','..nx..','..ny)
	War_MovePerson(nx,ny)
	lib.Delay(100)
end

function WE_follow(pid,eid)
--pid,ÈËÎï±àºÅ
--id,Ä¿±êÈËÎï£¬ÒÆ¶¯µ½ÀëÄ¿±êÈËÎï×î½üµÄÎ»ÖÃ
	local a=WE_getwarid(pid)
	local b=WE_getwarid(eid)
	--lib.Debug(a..','..b)
	if a==-1 or b==-1 then return end
	WAR.CurID=a
	local x,y=WAR.Person[b]["×ø±êX"],WAR.Person[b]["×ø±êY"]
	local nx,ny=WE_xy(x,y,a)
	--lib.Debug(pid..','..eid..','..a..','..b..','..x..','..y..','..nx..','..ny)
	War_MovePerson(nx,ny)
	lib.Delay(100)
end

function WE_addperson(id,x,y,faseto,flag)
--id,Õ½³¡ÉÏĞÂ¼ÓµÄÈËÎïµÄÈËÎï±àºÅ
--x,y,³öÏÖÎ»ÖÃ
--flag,µĞÎÒ±êÊ¶
--facetoÈËÎï·½Ïò£º0ÓÒÉÏ1ÓÒÏÂ2×óÉÏ3×óÏÂ
	local cx,cy=WE_xy(x,y)
	WAR.Person[WAR.PersonNum]["ÈËÎï±àºÅ"]=id;
	WAR.Person[WAR.PersonNum]["ÎÒ·½"]=flag;
	WAR.Person[WAR.PersonNum]["×ø±êX"]=cx;
	WAR.Person[WAR.PersonNum]["×ø±êY"]=cy;
	WAR.Person[WAR.PersonNum]["ËÀÍö"]=false;
	WAR.Person[WAR.PersonNum]["ÈË·½Ïò"]=faseto;
	WAR.Person[WAR.PersonNum]["ÌùÍ¼"]=WarCalPersonPic(WAR.PersonNum);
		--WAR.Person[i]["ÌùÍ¼"]=WarCalPersonPic(i);
	WAR.Person[WAR.PersonNum]["AI"]=2;
	SetWarMap(cx,cy,2,WAR.PersonNum);
	SetWarMap(cx,cy,5,WAR.Person[WAR.PersonNum]["ÌùÍ¼"]);
	lib.PicLoadFile(string.format(CC.FightPicFile[1],JY.Person[id]["Í·Ïñ´úºÅ"]),string.format(CC.FightPicFile[2],JY.Person[id]["Í·Ïñ´úºÅ"]),4+WAR.PersonNum);
	WAR.Person[WAR.PersonNum]["Çá¹¦"]=GetSpeed(id)
	WAR.Person[WAR.PersonNum]["ÒÆ¶¯²½Êı"]=math.modf(WAR.Person[WAR.PersonNum]["Çá¹¦"]/20)--JY.Person[id]["ÊÜÉË³Ì¶È"]/40);
	WAR.PersonNum=WAR.PersonNum+1
	--WAR.CurID=WAR.PersonNum-1
end

function WE_sort()
--¼¯ÖĞ´¦ÀíÉèÖÃĞÂ¼ÓÈËÎï
--ÈçÉèÖÃÌùÍ¼£¬Çá¹¦ÅÅĞòµÈ
--Î´¿¼ÂÇÖÜÈ«	
--ÏÖÔÚÕâ¸öº¯Êı»ù±¾Ã»ÓÃÁË£¬ÔİÇÒ±£Áô°É
	WarPersonSort(1)
	for i=0,WAR.PersonNum-1 do
		local pid=WAR.Person[i]["ÈËÎï±àºÅ"]
		lib.PicLoadFile(string.format(CC.FightPicFile[1],JY.Person[pid]["Í·Ïñ´úºÅ"]),string.format(CC.FightPicFile[2],JY.Person[pid]["Í·Ïñ´úºÅ"]),4+i);
		end
end

function WE_atk(id,cx,cy,kfid,lv,flag)
--²¥·ÅÎä¹¦¶¯»­
--Èç¹ûlvÎª¿Õ£¬ÔòÖ»²¥·ÅÈËÎï¹¥»÷¶¯×÷
	CleanWarMap(4,0)
	local cid=WE_getwarid(id)
	local x0=WAR.Person[cid]["×ø±êX"];
	local y0=WAR.Person[cid]["×ø±êY"];
	WAR.Person[cid]["ÈË·½Ïò"]=War_Direct(0,0,cx,cy) or WAR.Person[cid]["ÈË·½Ïò"]
	if lv~=nil then
		local kind,len1,len2=fenjie(JY.Wugong[kfid]["·¶Î§"..math.modf((lv+2)/3)])
		WarDrawAtt(x0+cx,y0+cy,kind,len1,len2,3,x0,y0)
	end
	local tmp=WAR.CurID
	WAR.CurID=cid
	War_ShowFight(id,kfid,JY.Wugong[kfid]["Îä¹¦ÀàĞÍ"],lv,x0+cx,y0+cy,JY.Wugong[kfid]["Îä¹¦¶¯»­&ÒôĞ§"],0,0,0);
	WAR.CurID=tmp
	CleanWarMap(4,0)
end

function WE_close(id1,id2,len)
--ÅĞ¶ÏÁ½¸öidÖ®¼äµÄ¾àÀë£¬Èç¹ûĞ¡ÓÚµÈÓÚlenÔò·´»ØÕæ
--Èç¹ûlenÎª¿ÕÔò·µ»ØÁ½ÈËµÄ¾àÀë
	len=len or 1
	local cid1=WE_getwarid(id1)
	local cid2=WE_getwarid(id2)
	local x1,y1=WAR.Person[cid1]["×ø±êX"],WAR.Person[cid1]["×ø±êY"]
	local x2,y2=WAR.Person[cid2]["×ø±êX"],WAR.Person[cid2]["×ø±êY"]
	local s=math.abs(x1-x2)+math.abs(y1-y2)
	if len==nil then return s
	elseif s<=len then return true
	else return false
	end
end

function WE_chuxian(id,x,y)
	local pid=WE_getwarid(id)
	local cx,cy=WE_xy(x,y)
	SetWarMap(cx,cy,2,pid);
	SetWarMap(cx,cy,5,WAR.Person[pid]["ÌùÍ¼"]);
	WAR.Person[pid]["×ø±êX"]=cx
	WAR.Person[pid]["×ø±êY"]=cy
end

function WE_xiaoshi(id)
	local pid=WE_getwarid(id)
	local cx,cy=WAR.Person[pid]["×ø±êX"],WAR.Person[pid]["×ø±êY"]
	SetWarMap(cx,cy,2,-1);
	SetWarMap(cx,cy,5,-1);
end
