local question={}
question={
					[0]=245,
					[1]='锄禾日当午，汗滴禾下土。',
					[2]='谁知盘中餐，粒粒皆辛苦。',
					[3]='春眠不觉晓，处处闻啼鸟。',
					[4]='夜来风雨声，花落知多少。',
					[5]='白日依山尽，黄河入海流。',
					[6]='欲穷千里目，更上一层楼。',
					[7]='魂随南翥鸟，泪尽北枝花。',
					[8]='露重飞难进，风多响易沉。',
					[9]='无人信高洁，谁为表予心？',
					[10]='城阙辅三秦，风烟望五津。',
					[11]='海内存知己，天涯若比邻。',
					[12]='汉地草应绿，胡庭沙正飞。',
					[13]='宁为百夫长，胜作一书生。',
					[14]='前不见古人，后不见来者。',
					[15]='念天地之悠悠，独怆然而涕下。',
					[16]='谁为含愁独不见，更教明月照流黄。',
					[17]='红豆生南国，春来发几枝。',
					[18]='愿君多采撷，此物最相思。',
					[19]='独在异乡为异客，每逢佳节倍思亲。',
					[20]='遥知兄弟登高处，遍插茱萸少一人。',
					[21]='兰叶春葳蕤，桂华秋皎洁。',
					[22]='草木有本心，何求美人折？',
					[23]='海上生明月，天涯共此时。',
					[24]='长安一片月，万户捣衣声。',
					[25]='秋风吹不尽，总是玉关情。',
					[26]='妾发初覆额，折花门前剧。',
					[27]='郎骑竹马来，绕床弄青梅。',
					[28]='春风不相识，何事入罗帏？',
					[29]='翠影红霞映朝日，鸟飞不到吴天长。',
					[30]='天姥连天向天横，势拔五岳掩赤城。',
					[31]='安能摧眉折腰事权贵，使我不得开心颜！',
					[32]='风吹柳花满店香，吴姬压酒劝客尝。',
					[33]='抽刀断水水更流，举杯销愁愁更愁。',
					[34]='峨眉山月半轮秋，影入平羌江水流。',
					[35]='长风破浪会有时，直挂云帆济沧海。',
					[36]='昭王白骨萦蔓草，谁人更扫黄金台？',
					[37]='愿将腰下剑，直为斩楼兰。',
					[38]='人生得意须尽欢，莫使金樽空对月。',
					[39]='天生我材必有用，千金散尽还复来。',
					[40]='吾爱孟夫子，风流天下闻。',
					[41]='红颜弃轩冕，白首卧松云。',
					[42]='月下飞天镜，云生结海楼。',
					[43]='挥手自兹去，萧萧班马鸣。',
					[44]='床前明月光，疑是地上霜。',
					[45]='举头望明月，低头思故乡。',
					[46]='美人卷珠帘，深坐颦蛾眉。',
					[47]='故人西辞黄鹤楼，烟花三月下扬州。',
					[48]='孤帆远影碧空尽，唯见长江天际流。',
					[49]='朝辞白帝彩云间，千里江陵一日还。',
					[50]='云想衣裳花想容，春风拂槛露华浓。',
					[51]='一枝红艳露凝香，云雨巫山枉断肠。',
					[52]='花间一壶酒，独酌无相亲。',
					[53]='正是江南好风景，落花时节又逢君。',
					[54]='江流石不转，遗恨失吞吴。',
					[55]='三顾频烦天下计，两朝开济老臣心。',
					[56]='出师未捷身先死，长使英雄泪满襟。',
					[57]='花径不曾缘客扫，蓬门今始为君开。',
					[58]='此曲只应天上有，人间能有几回闻。',
					[59]='剑外忽传收蓟北，初闻涕泪满衣裳。',
					[60]='却看妻子愁何在，漫卷诗书喜欲狂。',
					[61]='风急天高猿啸哀，渚清沙白鸟飞回。',
					[62]='无边落木萧萧下，不尽长江滚滚来。',
					[63]='万里悲秋常作客，百年多病独登台。',
					[64]='艰难苦恨繁霜鬓，潦倒新停浊酒杯。',
					[65]='锦江春色来天地，玉垒浮云变古今。',
					[66]='北极朝庭终不改，西山寇盗莫相侵。',
					[67]='野哭几家闻战伐？夷歌数处起渔樵。',
					[68]='摇落深知宋玉悲，风流儒雅亦吾师。',
					[69]='画图省识春风面，环佩空归月夜魂。',
					[70]='三分割据纡筹策，万古云霄一羽毛。',
					[71]='感时花溅泪，恨别鸟惊心。',
					[72]='烽火连三月，家书抵万金。',
					[73]='翻手为云覆手雨，纷纷轻薄何须数。',
					[74]='露从今夜白，月是故乡明。',
					[75]='细草微风岸，危樯独夜舟。',
					[76]='星垂平野阔，月涌大江流。',
					[77]='名岂文章著？官应老病休。',
					[78]='飘飘何所似？天地一沙鸥。',
					[79]='吴楚东南坼，乾坤日夜浮。',
					[80]='新鬼烦冤旧鬼哭，天阴雨湿声啾啾。',
					[81]='岱宗夫如何？齐鲁青未了。',
					[82]='造化钟神秀，阴阳割昏晓。',
					[83]='荡胸生层云，决眦入归鸟。',
					[84]='会当凌绝顶，一览众山小。',
					[85]='绝代有佳人，幽居在空谷。',
					[86]='冠盖满京华，斯人独憔悴！',
					[87]='但去莫复问，白云无尽时。',
					[88]='洛阳女儿对门居，才可容颜十五余。',
					[89]='谁怜越女颜如玉，贫贱江头自浣纱！',
					[90]='渔舟逐水爱山春，两岸桃花夹去津。',
					[91]='春来遍是桃花水，不辨仙源何处寻。',
					[92]='空山新雨后，天气晚来秋。',
					[93]='明月松间照，清泉石上流。',
					[94]='松风吹解带，山月照弹琴。',
					[95]='泉声咽危石，日色冷青松。',
					[96]='楚塞三湘接，荆门九派通。',
					[97]='江流天地外，山色有无中。',
					[98]='空山不见人，但闻人语响。',
					[99]='返景入深林，复照青苔上。',
					[100]='深林人不知，明月来相照。',
					[101]='渭城朝雨浥轻尘，客舍青青柳色新。',
					[102]='劝君更尽一杯酒，西出阳关无故人。',
					[103]='愁因薄暮起，兴是清秋发。',
					[104]='气蒸云梦泽，波撼岳阳城。',
					[105]='不才明主弃，多病故人疏。',
					[106]='白发催年老，青阳逼岁除。',
					[107]='开轩面场圃，把酒话桑麻。',
					[108]='待到重阳日，还来就菊花。',
					[109]='风鸣两岸叶，月照一孤舟。',
					[110]='移舟泊烟渚，日暮客愁新。',
					[111]='野旷天低树，江清月近人。',
					[112]='寒雨连江夜入吴，平明送客楚山孤。',
					[113]='洛阳亲友如相问，一片冰心在玉壶。',
					[114]='秦时明月汉时关，万里长征人未还。',
					[115]='但使龙城飞将在，不教胡马度阴山。',
					[116]='闺中少妇不曾愁，春日凝妆上翠楼。',
					[117]='忽见陌头杨柳色，悔教夫婿觅封侯！',
					[118]='竹径通幽处，禅房花木深。',
					[119]='山光悦鸟性，潭影空人心。',
					[120]='忽如一夜春风来，千树万树梨花开。',
					[121]='故园东望路漫漫，双袖龙钟泪不干。',
					[122]='马上相逢无纸笔，凭君传语报平安。',
					[123]='楚江微雨里，建业暮钟时。',
					[124]='漠漠帆来重，冥冥鸟去迟。',
					[125]='独怜幽草涧边生，上有黄鹂深树鸣。',
					[126]='春潮带雨晚来急，野渡无人舟自横。',
					[127]='千山鸟飞绝，万径人踪灭。',
					[128]='孤舟蓑笠翁，独钓寒江雪。',
					[129]='波澜誓不起，妾心古井水。',
					[130]='慈母手中线，游子身上衣。',
					[131]='临行密密缝，意恐迟迟归。',
					[132]='谁言寸草心，报得三春晖。',
					[133]='前不见古人，后不见来者。',
					[134]='念天地之悠悠，独怆然而涕下。',
					[135]='今为羌笛出塞声，使我三军泪如雨。',
					[136]='醉卧不知白日暮，有时空望孤云高。',
					[137]='蔡女昔造胡笳声，一弹一十有八拍。',
					[138]='年年战骨埋荒外，空见蒲桃入汉家。',
					[139]='关城树色催寒近，御苑砧声向晚多。',
					[140]='莫见长安行乐处，空令岁月易蹉跎。',
					[141]='汉皇重色思倾国，御宇多年求不得。',
					[142]='回眸一笑百媚生，六宫粉黛无颜色。',
					[143]='云鬓花颜金步摇，芙蓉帐暖度春宵。',
					[144]='渔阳鼙鼓动地来，惊破霓裳羽衣曲。',
					[145]='芙蓉如面柳如眉，对此如何不泪垂。',
					[146]='梨园弟子白发新，椒房阿监青娥老。',
					[147]='云髻半偏新睡觉，花冠不整下堂来。',
					[148]='在天愿作比翼鸟，在地愿为连理枝。',
					[149]='天长地久有时尽，此恨绵绵无绝期。',
					[150]='浔阳江头夜送客，枫叶荻花秋瑟瑟。',
					[151]='大弦嘈嘈如急雨，小弦切切如私语。',
					[152]='弦弦掩抑声声思，似诉平生不得志。',
					[153]='忽闻水上琵琶声，主人忘归客不发。',
					[154]='五陵年少争缠头，一曲红绡不知数。',
					[155]='今年欢笑复明年，秋月春风等闲度。',
					[156]='同是天涯沦落人，相逢何必曾相识！',
					[157]='叹凤嗟身否，伤麟泣道穷。',
					[158]='独有宦游人，偏惊物候新。',
					[159]='云霞出海曙，梅柳渡江春。',
					[160]='少妇今春意，良人昨夜情。',
					[161]='万里寒光生积雪，三边曙色动危旌。',
					[162]='燕台一去客心惊，笳鼓喧喧汉将营。',
					[163]='沙场烽火连胡月，海畔云山拥蓟城。',
					[164]='少小虽非投笔吏，论功还欲请长缨。',
					[165]='潮平两岸阔，风正一帆悬。',
					[166]='独立三朝识，轻生一剑知。',
					[167]='泠泠七弦上，静听松风寒。',
					[168]='行人无限秋风思，隔水青山似故乡。',
					[169]='林暗草惊风，将军夜引弓。',
					[170]='平明寻白羽，没在石棱中。',
					[171]='月黑雁飞高，单于夜遁逃。',
					[172]='欲将轻骑逐，大雪满弓刀。',
					[173]='三湘衰鬓逢秋色，万里归心对月明。',
					[174]='早知潮有信，嫁与弄潮儿。',
					[175]='不知何处吹芦管，一夜征人尽望乡。',
					[176]='回乐烽前沙似雪，受降城外月如霜。',
					[177]='问姓惊初见，称名忆旧容。',
					[178]='朱雀桥边野草花，乌衣巷口夕阳斜。',
					[179]='旧时王谢堂前燕，飞入寻常百姓家。',
					[180]='天下英雄气，千秋尚凛然。',
					[181]='势分三足鼎，业复五铢钱。',
					[182]='得相能开国，生儿不象贤。',
					[183]='折戟沉沙铁未销，自将磨洗认前朝。',
					[184]='东风不与周郎便，铜雀春深锁二乔。',
					[185]='烟笼寒水月笼沙，夜泊秦淮近酒家。',
					[186]='商女不知亡国恨，隔江犹唱《后庭花》。',
					[187]='青山隐隐水迢迢，秋尽江南草未凋。',
					[188]='二十四桥明月夜，玉人何处教吹箫？',
					[189]='落魄江湖载酒行，楚腰纤细掌中轻。',
					[190]='十年一觉扬州梦，赢得青楼薄倖名。',
					[191]='银烛秋光冷画屏，轻罗小扇扑流萤。',
					[192]='天阶夜色凉如水，坐看牵牛织女星。',
					[193]='娉娉袅袅十三余，豆蔻梢头二月初。',
					[194]='春风十里扬州路，卷上珠帘总不如。',
					[195]='多情却似总无情，唯觉樽前笑不成。',
					[196]='蜡烛有心还惜别，替人垂泪到天明。',
					[197]='蜡烛有心还惜别，替人垂泪到天明。',
					[198]='锦瑟无端五十弦，一弦一柱思华年。',
					[199]='庄生晓梦迷蝴蝶，望帝春心托杜鹃。',
					[200]='沧海月明珠有泪，蓝田日暖玉生烟。',
					[201]='此情可待成追忆，只是当时已惘然。',
					[202]='昨夜星辰昨夜风，画楼西畔桂堂东。',
					[203]='身无彩凤双飞翼，心有灵犀一点通。',
					[204]='刘郎已恨蓬山远，更隔蓬山一万重。',
					[205]='春心莫共花争发，一寸相思一寸灰！',
					[206]='相见时难别亦难，东风无力百花残。',
					[207]='春蚕到死丝方尽，蜡炬成灰泪始干。',
					[208]='神女生涯原是梦，小姑居处本无郎。',
					[209]='向晚意不适，驱车登古原；',
					[210]='夕阳无限好，只是近黄昏。',
					[211]='君问归期未有期，巴山夜雨涨秋池。',
					[212]='何当共剪西窗烛，却话巴山夜雨时。',
					[213]='云母屏风烛影深，长河渐落晓星沉。',
					[214]='嫦娥应悔偷灵药，碧海青天夜夜心。',
					[215]='可怜夜半虚前席，不问苍生问鬼神。',
					[216]='昔人已乘黄鹤去，此地空余黄鹤楼。',
					[217]='黄鹤一去不复返，白云千载空悠悠。',
					[218]='晴川历历汉阳树，芳草萋萋鹦鹉洲。',
					[219]='日暮乡关何处是？烟波江上使人愁。',
					[220]='无情最是台城柳，依旧烟笼十里堤。',
					[221]='寥落古行宫，宫花寂寞红。',
					[222]='白头宫女在，闲坐说玄宗。',
					[223]='蓬门未识绮罗香，拟托良媒亦自伤。',
					[224]='谁爱风流高格调？共怜时世俭梳妆！',
					[225]='敢将十指夸针巧，不把双眉斗画长。',
					[226]='苦恨年年压金线，为他人作嫁衣裳！',
					[227]='黄河远上白云间，一片孤城万仞山。',
					[228]='羌笛何须怨杨柳，春风不度玉门关。',
					[229]='鸣筝金粟柱，素手玉房前。',
					[230]='欲得周郎顾，时时误拂弦。',
					[231]='未谙姑食性，先遣小姑尝。',
					[232]='故国三千里，深宫二十年。',
					[233]='一声《何满子》，双泪落君前。',
					[234]='潮落夜江斜月里，两三星火是瓜州。',
					[235]='只在此山中，云深不知处。',
					[236]='少小离家老大回，乡音无改鬓毛衰。',
					[237]='儿童相见不相识，笑问客从何处来。',
					[238]='葡萄美酒夜光杯，欲饮琵琶马上催。',
					[239]='醉卧沙场君莫笑，古来征战几人回！',
					[240]='月落乌啼霜满天，江枫渔火对愁眠。',
					[241]='姑苏城外寒山寺，夜半钟声到客船。',
					[242]='洞房昨夜停红烛，待晓堂前拜舅姑。',
					[243]='妆罢低声问夫婿：画眉深浅入时无？',
					[244]='可怜无定河边骨，犹是春闺梦里人。',
					[245]='多情只有春庭月，犹为离人照落花!',
				}
local cbz={}
cbz={
			['禾']={[0]=3,'木','术','本'},
			['日']={[0]=5,'曰','田','目','白','百',},
			['曰']={[0]=5,'百','日','目','白','田',},
			['目']={[0]=5,'曰','田','日','白','百',},
			['白']={[0]=5,'百','日','目','曰','田',},
			['田']={[0]=5,'曰','日','目','白','百',},
			['百']={[0]=5,'白','日','目','曰','田',},
			['午']={[0]=3,'牛','丰','中',},
			['丰']={[0]=3,'牛','午','中',},
			['中']={[0]=4,'牛','丰','午','申',},
			['牛']={[0]=3,'中','丰','午',},
			['汗']={[0]=3,'汉','憨','杆',},
			['滴']={[0]=3,'嫡','镝','熵',},
			['下']={[0]=2,'卜','不',},
			['不']={[0]=2,'卜','下',},
			['卜']={[0]=2,'下','不',},
			['土']={[0]=2,'十','士'},
			['谁']={[0]=2,'睡','随'},
			['睡']={[0]=2,'谁','随'},
			['随']={[0]=2,'睡','谁'},
			['知']={[0]=2,'痴','随'},
			['辛']={[0]=2,'幸','欣'},
			['春']={[0]=2,'椿','寿',},
			['眠']={[0]=2,'棉','眼',},
			['觉']={[0]=2,'绝','受',},
			['处']={[0]=2,'促','外',},
			['闻']={[0]=2,'问','阎',},
			['鸟']={[0]=2,'乌','马',},
			['来']={[0]=2,'米','央',},
			['风']={[0]=2,'夙','凤',},
			['少']={[0]=2,'土','小',},
			['入']={[0]=1,'人',},
			['人']={[0]=1,'入',},
			['海']={[0]=2,'悔','侮'},
			['流']={[0]=3,'硫','琉','慌'},
			['穷']={[0]=2,'穹','究',},
			['千']={[0]=3,'百','万','干',},
			['更']={[0]=2,'埂','曳',},
			['楼']={[0]=3,'搂','镂','偻',},
			['魂']={[0]=2,'浑','魄',},
			['南']={[0]=3,'冉','苒','蓝'},
			['泪']={[0]=2,'类','汩',},
			['枝']={[0]=2,'支','忮'},
			['露']={[0]=5,'霜','霞','霭','雾','霖'},
			['飞']={[0]=3,'菲','吠','戈',},
			['响']={[0]=3,'相','饷','咽'},
			['沉']={[0]=2,'沈','深'},
			['无']={[0]=2,'天','夫'},
			['天']={[0]=2,'无','夫'},
			['夫']={[0]=2,'天','无'},
			['信']={[0]=2,'佳','徨',},
			['高']={[0]=2,'宫','官'},
			['洁']={[0]=2,'沽','浩'},
			['为']={[0]=3,'未','刀','力',},
			['表']={[0]=3,'镖','标','麦',},
			['予']={[0]=3,'于','与','子',},
			['心']={[0]=3,'辛','芯','口',},
			['城']={[0]=2,'铖','诚'},
			['阙']={[0]=2,'阕','瘸'},
			['三']={[0]=3,'二','六','九'},
			['秦']={[0]=3,'琴','禽','泰'},
			['津']={[0]=3,'缙','侵','肆'},
			['内']={[0]=2,'冉','冄'},
			['己']={[0]=3,'已','乙','几'},
			['已']={[0]=3,'己','乙','几'},
			['涯']={[0]=4,'崖','睚','雅','岸'},
			['岸']={[0]=4,'崖','睚','雅','涯'},
			['雅']={[0]=4,'崖','睚','岸','涯'},
			['若']={[0]=3,'弱','偌','苦'},
			['比']={[0]=3,'碧','避','北'},
			['邻']={[0]=3,'临','玲','岭'},
			['汉']={[0]=3,'汗','旱','汊'},
			['草']={[0]=3,'曹','辛','早'},
			['应']={[0]=3,'庄','床','庆'},
			['绿']={[0]=3,'红','蓝','禄'},
			['正']={[0]=2,'上','止'},
			['庭']={[0]=3,'莛','铤','延'},
			['宁']={[0]=3,'您','灵','宋'},
			['长']={[0]=3,'厂','常','米'},
			['作']={[0]=3,'祚','做','昨'},
			['生']={[0]=2,'升','主'},
			['前']={[0]=2,'箭','剪'},
			['见']={[0]=3,'贝','具','且'},
			['古']={[0]=2,'苗','沽'},
			['者']={[0]=2,'着','著'},
			['念']={[0]=3,'练','廿','恋'},
			['之']={[0]=2,'乙','已'},
			['独']={[0]=2,'狐','狙'},
			['怆']={[0]=3,'抢','枪','伦'},
			['而']={[0]=3,'耳','贰','雨'},
			['涕']={[0]=2,'啼','梯'},
			['含']={[0]=3,'喊','焊','焓'},
			['教']={[0]=2,'较','矫'},
			['明']={[0]=3,'鸣','洺','朋'},
			['月']={[0]=2,'日','目'},
			['黄']={[0]=3,'皇','慌','寅'},
			['红']={[0]=2,'杠','洪'},
			['豆']={[0]=3,'斗','逗','浢'},
			['国']={[0]=3,'固','囚','田'},
			['几']={[0]=3,'己','姬','儿'},
			['儿']={[0]=3,'而','尔','几'},
			['愿']={[0]=2,'原','源'},
			['君']={[0]=2,'者','尹'},
			['采']={[0]=3,'採','彩','菜'},
			['思']={[0]=3,'是','司','缌'},
			['相']={[0]=4,'象','湘','想','湘'},
			['异']={[0]=3,'一','意','邑'},
			['客']={[0]=2,'恪','碦'},
			['每']={[0]=2,'母','毋'},
			['佳']={[0]=3,'圭','桂','家'},
			['倍']={[0]=3,'贝','呗','钡'},
			['亲']={[0]=2,'幸','妾'},
			['遥']={[0]=3,'瑶','药','摇'},
			['兄']={[0]=2,'兕','弟'},
			['插']={[0]=3,'查','汊','锸'},
			['茱']={[0]=3,'猪','朱','诛'},
			['兰']={[0]=3,'蓝','岚','主'},
			['叶']={[0]=2,'咽','页'},
			['华']={[0]=3,'画','花','化'},
			['秋']={[0]=4,'春','球','湫','虬'},
			['皎']={[0]=3,'矫','胶','蛟'},
			['木']={[0]=4,'禾','米','本','术'},
			['本']={[0]=3,'木','术','禾'},
			['何']={[0]=3,'河','诃','呵'},
			['河']={[0]=5,'江','湖','何','诃','呵'},
			['折']={[0]=2,'柘','枝'},
			['安']={[0]=2,'胺','铵'},
			['片']={[0]=3,'偏','遍','篇'},
			['万']={[0]=3,'方','丸','千'},
			['户']={[0]=3,'厂','广','产'},
			['衣']={[0]=2,'乙','表'},
			['吹']={[0]=2,'炊','刮'},
			['玉']={[0]=3,'王','主','丰'},
			['关']={[0]=3,'羊','美','夫'},
			['妾']={[0]=2,'亲','幸'},
			['初']={[0]=2,'除','粗'},
			['门']={[0]=4,'口','们','扪','闷'},
			['骑']={[0]=3,'骐','旗','棋'},
			['床']={[0]=3,'闯','怆','船',},
			['青']={[0]=3,'菁','情','清'},
			['梅']={[0]=3,'悔','侮','每'},
			['姥']={[0]=2,'老','铑'},
			['连']={[0]=3,'恋','莲','联'},
			['向']={[0]=2,'问','回'},
			['横']={[0]=3,'佷','亨','衡'},
			['岳']={[0]=2,'月','粤'},
			['赤']={[0]=2,'齿','斥'},
			['摧']={[0]=3,'捶','催','陲'},
			['腰']={[0]=3,'药','窑','妖'},
			['事']={[0]=3,'使','式','是'},
			['贵']={[0]=3,'归','圭','鬼'},
			['使']={[0]=3,'是','施','史'},
			['得']={[0]=2,'的','地'},
			['的']={[0]=2,'得','地'},
			['地']={[0]=2,'得','的'},
			['开']={[0]=3,'凯','恺','井'},
			['柳']={[0]=2,'浏','琉'},
			['满']={[0]=2,'瞒','幔'},
			['店']={[0]=3,'电','典','殿'},
			['香']={[0]=3,'响','享','臭'},
			['吴']={[0]=3,'无','昊','吕'},
			['压']={[0]=2,'岸','押'},
			['酒']={[0]=3,'救','玖','洒'},
			['洒']={[0]=3,'啥','砂','酒'},
			['唤']={[0]=2,'换','涣'},
			['尝']={[0]=3,'长','昌','常'},
			['抽']={[0]=2,'仇','拔'},
			['刀']={[0]=8,'力','剑','棍','枪','戟','斧','钩','叉'},
			['水']={[0]=3,'税','谁','木'},
			['杯']={[0]=2,'怀','坏'},
			['销']={[0]=3,'晓','潇','消'},
			['半']={[0]=4,'平','米','丰','羊'},
			['平']={[0]=4,'来','半','丰','米'},
			['羌']={[0]=3,'墙','蔷','无'},
			['江']={[0]=5,'河','湖','海','供','洪'},
			['浪']={[0]=4,'狼','朗','蒗','烺'},
			['会']={[0]=2,'云','宋'},
			['时']={[0]=3,'使','市','明'},
			['直']={[0]=4,'且','目','白','百'},
			['云']={[0]=4,'允','会','三','丰'},
			['骨']={[0]=2,'谷','鼓'},
			['台']={[0]=2,'抬','苔'},
			['剑']={[0]=7,'刀','棍','枪','戟','斧','钩','叉'},
			['空']={[0]=3,'穷','孔','悾'},
			['金']={[0]=5,'银','铜','今','津','全'},
			['用']={[0]=5,'甩','庸','月','勇','甬'},
			['松']={[0]=2,'送','悚'},
			['挥']={[0]=2,'辉','恢'},
			['手']={[0]=2,'丰','半'},
			['自']={[0]=4,'白','百','目','日'},
			['去']={[0]=2,'取','区'},
			['马']={[0]=2,'鸟','乌'},
			['举']={[0]=2,'聚','抬'},
			['头']={[0]=2,'太','大'},
			['低']={[0]=2,'抵','底'},
			['美']={[0]=2,'每','羡'},
			['珠']={[0]=2,'朱','蛛'},
			['深']={[0]=3,'沈','沉','伸'},
			['眉']={[0]=3,'煤','湄','梅'},
			['未']={[0]=2,'末','来'},
			['先']={[0]=3,'县','仙','生'},
			['英']={[0]=2,'映','莺'},
			['泪']={[0]=3,'雷','肋','汩'},
			['妻']={[0]=2,'凄','欺'},
			['子']={[0]=3,'于','予','儿'},
			['在']={[0]=2,'再','冉'},
			['诗']={[0]=3,'式','师','史'},
			['书']={[0]=2,'输','姝'},
			['狂']={[0]=2,'矿','旷'},
			['鬓']={[0]=3,'斌','缤','鬟'},
			['霜']={[0]=2,'露','霆'},
			['新']={[0]=3,'心','鑫','欣',},
			['倒']={[0]=2,'到','道'},
			['莫']={[0]=2,'要','墨'},
			['哭']={[0]=3,'器','苦','窟'},
			['战']={[0]=3,'站','粘','斩'},
			['歌']={[0]=3,'哥','鸽','葛'},
			['数']={[0]=3,'姝','树','熟'},
			['恨']={[0]=5,'很','恒','狠','拫','佷'},
			['别']={[0]=3,'拐','莂','另'},
			['惊']={[0]=3,'京','靖','经'},
			['火']={[0]=2,'大','犬'},
			['舟']={[0]=2,'丹','船'},
			['文']={[0]=3,'问','闻','丈'},
			['官']={[0]=2,'宫','宦'},
			['休']={[0]=3,'修','秀','体'},
			['似']={[0]=3,'四','司','是'},
			['飘']={[0]=3,'瓢','缥','漂'},
			['地']={[0]=3,'低','底','堤'},
			['鬼']={[0]=3,'怪','魂','魄'},
			['化']={[0]=3,'华','花','画'},
			['花']={[0]=3,'华','化','画'},
			['神']={[0]=3,'沈','慎','灵'},
			['秀']={[0]=3,'修','锈','羞'},
			['阴']={[0]=3,'荫','因','音'},
			['阳']={[0]=3,'杨','洋','鸯'},
			['昏']={[0]=2,'婚','诨'},
			['众']={[0]=2,'纵','总'},
			['绝']={[0]=3,'决','觉','诀'},
			['顶']={[0]=3,'鼎','定','盯'},
			['小']={[0]=5,'少','不','晓','卜','大'},
			['斯']={[0]=3,'诗','师','施'},
			['五']={[0]=3,'六','七','午'},
			['九']={[0]=3,'七','八','十'},
			['接']={[0]=3,'街','截','揭'},
			['因']={[0]=3,'应','音','引'},
			['起']={[0]=3,'骑','气','妻'},
			['才']={[0]=3,'材','财','踩'},
			['主']={[0]=3,'王','玉','丰'},
			['面']={[0]=2,'缅','而'},
			['把']={[0]=3,'拔','握','提'},
			['话']={[0]=2,'画','化'},
			['园']={[0]=2,'圆','源'},
			['东']={[0]=3,'西','南','北'},
			['西']={[0]=4,'东','南','北','酉'},
			['南']={[0]=3,'西','东','北'},
			['北']={[0]=4,'西','南','东','比'},
			['双']={[0]=3,'单','三','霜'},
			['龙']={[0]=3,'陇','珑','垄'},
			['里']={[0]=3,'外','内','丽'},
			['暮']={[0]=3,'墓','幕','慕'},
			['帆']={[0]=3,'犯','返','翻'},
			['立']={[0]=3,'李','利','里'},
			['钓']={[0]=2,'吊','叼'},
			['寒']={[0]=3,'韩','汉','旱'},
			['雪']={[0]=3,'血','穴','学'},
			['行']={[0]=2,'走','形'},
			['意']={[0]=3,'忆','衣','亿'},
			['归']={[0]=3,'规','闺','诡'},
			['今']={[0]=3,'令','金','命'},
			['令']={[0]=3,'金','命','今'},
			['昔']={[0]=3,'惜','息','夕'},
			['胡']={[0]=3,'湖','狐','葫'},
			['八']={[0]=3,'六','七','九'},
			['六']={[0]=3,'三','五','七'},
			['弦']={[0]=4,'炫','线','眩','铉'},
			['如']={[0]=3,'茹','筎','若','似'},
			['叹']={[0]=3,'谈','弹','探'},
			['否']={[0]=2,'缶','不'},
			['伤']={[0]=3,'熵','上','尚'},
			['泣']={[0]=3,'哭','歌','凄'},
			['黑']={[0]=2,'雷','嘿'},
			['将']={[0]=2,'江','姜'},
			['笑']={[0]=3,'哭','夭','芙'},
			['单']={[0]=3,'双','丹','旦'},
			['于']={[0]=3,'子','予','与'},
			['与']={[0]=3,'于','予','子'},
			['足']={[0]=2,'族','组'},
			['五']={[0]=3,'三','六','九'},
			['蝴']={[0]=2,'湖','葫'},
			['蝶']={[0]=2,'碟','叠'},
			['鹃']={[0]=2,'捐','卷'},
			['忆']={[0]=3,'乙','仪','义'},
			['然']={[0]=2,'燃','髯'},
			['干']={[0]=3,'丰','甘','杆'},
			['烛']={[0]=3,'祝','竹','株'},
			['洞']={[0]=2,'动','冬'},
			['盘']={[0]=2,'磐','碗'},
			['声']={[0]=2,'升','省'},
			['复']={[0]=3,'负','富','阜'},
			['分']={[0]=3,'份','芬','纷'},
			['蚕']={[0]=3,'残','蝉','禅'},
			['灰']={[0]=2,'卉','悔'},
			['著']={[0]=3,'者','筑','煮'},
			['病']={[0]=3,'丙','疾','弱'},
			['解']={[0]=3,'截','洁','皆'},
			['琴']={[0]=3,'筝','瑟','萧'},
			['悦']={[0]=3,'说','乐','跃'},
			['迟']={[0]=3,'吃','池','驰'},
			['宦']={[0]=3,'官','宫','涣'},
			['虽']={[0]=3,'纵','却','随'},
			['晴']={[0]=3,'清','请','情'},
			['宫']={[0]=3,'官','宦','恭'},
			['琵']={[0]=3,'琶','琴','瑟'},
			['琶']={[0]=3,'琴','瑟','琵'},
			['覆']={[0]=3,'傅','复','腹'},
			['愁']={[0]=3,'筹','仇','忧'},
		}
local function wrongstr(str)
	local len=string.len(str)
	local newstr="";
	local changed=false
	for i=1,len,2 do
		local s=string.sub(str,i,i+1)
		if cbz[s]~=nil then
			if math.random(10)<3 then
				local n=cbz[s][0]
				if n==1 then
					s=cbz[s][1]
				else
					s=cbz[s][math.random(n)]
				end
				changed=true
			end
		end
		newstr=newstr..s
	end
	if changed then
		return newstr
	else
		return wrongstr(str)
	end
end
local rightNO=0;
local lx=0;
local lxmax=0;
local lxc=0;
local lxcmax=0;
local totaltime=0;
local mintime=100;
local function QS(n)
Cls()
local ss={}
ss[4]=question[math.random(question[0])]
local menu
local right=math.random(4)
local size=24
ss[1]=wrongstr(ss[4])
while true do
	ss[2]=wrongstr(ss[4])
	if ss[2]~=ss[1] then 
		break
	end
end
while true do
	ss[3]=wrongstr(ss[4])
	if ss[3]~=ss[1] and ss[3]~=ss[2] then 
		break
	end
end
local x=math.modf((CC.ScreenW-size*string.len(ss[1])/2)/2);
local y=CC.ScreenH-size*9
if right==1 then
	ss[1],ss[4]=ss[4],ss[1]
elseif right==2 then
	ss[2],ss[4]=ss[4],ss[2]
elseif right==3 then
	ss[3],ss[4]=ss[4],ss[3]
end
local select=0;
for t=1,100 do
	Cls()
	DrawStrBox(x-6,y,string.format("第%d题",n),C_WHITE,size)
	DrawStrBox(x-6,y+34,ss[right],C_STARTMENU,size,C_WHITE)
	DrawBox_1((CC.ScreenW-400)/2,y+180,(CC.ScreenW-400)/2+400,y+210,C_WHITE)
	DrawBox((CC.ScreenW-400)/2,y+180,(CC.ScreenW-400)/2+t*4,y+210,C_WHITE,C_ORANGE)
	DrawStrBox(x-6+size*4,y,string.format("答对题数：%d/20",rightNO),C_WHITE,size)
	for i=1,4 do
		local color=C_WHITE
		if i==select then
			color=C_ORANGE
		end
		DrawString(x,y+40+i*(size+4),ss[i],color,size)
	end
	ShowScreen()
	lib.Delay(50)
    local eventtype,key,mx,my = getkey();
    if eventtype == 1 then
		if key==VK_UP then
			select=select-1
		elseif key==VK_DOWN then
			select=select+1
		elseif key==888 then
			select=select-1
		elseif key==999 then
			select=select+1
		elseif key==VK_RETURN or key==VK_SPACE then
			if select>0 and select<5 then
				totaltime=totaltime+t
				if lx>0 and select==right and t<mintime then
					mintime=t;
				end
				break
			end
		end
    end
	select=limitX(select,0,5)
	if select==-1 then
		select=4
	elseif select==5 then
		select=0
	end
	if t==100 then
		select=0
		totaltime=totaltime+t
	end
end
Cls()
if right==select then
	rightNO=rightNO+1;
	lx=lx+1;
	lxc=0;
	if lx>lxmax then
		lxmax=lx;
	end
	DrawStrBoxWaitKey("回答正确！",C_ORANGE,CC.Fontbig);
	--DrawString(0,0,'Congratulations!',C_RED,36)
else
	--DrawString(0,0,'Wrong!',C_RED,36)
	DrawStrBoxWaitKey("回答错误！",C_ORANGE,CC.Fontbig);
	lx=0;
	lxc=lxc+1;
	if lxc>lxcmax then
		lxcmax=lxc;
	end
end
--ShowScreen()
--WaitKey()
end

	for qsNO=1,20 do
		QS(qsNO);
	end
	return rightNO,lxmax,lxcmax,totaltime,mintime;
--[[
menu={
		{s1,nil,1},
		{s2,nil,1},
		{s3,nil,1},
		{ss,nil,1},
	}
if right==ShowMenu(menu,4,0,x,120,0,0,1,0,24,C_WHITE,C_ORANGE) then
	Cls()
	DrawString(0,0,'Congratulations!',C_RED,36)
	ShowScreen()
	WaitKey()
end]]--
--[[
local function wrongnum(str)
	local len=string.len(str)
	local newstr=''
	local changed=false
	local x,y=0,0
	for i=1,len,2 do
		local s=string.sub(str,i,i+1)
		if cbz[s]~=nil then
			x=x+1
			y=y+cbz[s][0]
		end
	end
	return x*y
end]]--
--[[
for i=1,question[0] do
	if wrongnum(question[i])<100 then
		print(question[i])
	end
end]]--
--[[
local ss=question[math.random(question[0])]
a=a+1
local s1,s2,s3
s1=wrongstr(ss)
while true do
	s2=wrongstr(ss)
	if s2~=s1 then 
		break
	end
end
while true do
	s3=wrongstr(ss)
	if s3~=s1 and s3~=s2 then 
		break
	end
end
print(ss)
print(s1)
print(s2)
print(s3)]]--