--[[
	00	无
	01	提高生命百分比
	02	战斗经验上升
	03	每回合恢复生命
	04	每回合恢复内力
	05	每回合恢复受伤
	06	两次攻击
	07	水上飘
	08	生命为0后，复活
	...
	11	攻击伤害提高百分比
	12	攻击时带毒
	13	攻击时带受伤
	14	攻击时吸取内力（吸心）
	15	攻击时化去内力（化工）
	16	攻击时杀体力
	17	攻击时吸取生命
	18
	19
	20
	21	受到伤害降低百分比
	22	受到伤害反弹百分比
	23	受到伤害反击
	24	闪避	
	25	抵抗敌人特技
	-----NEW!-----
	00	无
	-->此部分特效必须存在于特定类型的武功上
	01	提高生命百分比(打算去掉这个)
	02	战斗经验上升
	03	每回合恢复生命
	04	每回合恢复内力
	05	提高恢复状态的几率
	06	两次攻击(特技)
	07	水上飘(轻功)
	08	生命为0后，复活(内功)
	09	生命低下时，提高伤害百分比(外功)
	10	生命低下时，降低伤害百分比
	11	降低被攻击的几率
	12	提高被攻击的几率
	13	所有属性提高，但不受控制，AI低下
	14	
	-->此部分特效可存在于所有类型武功上,并且效果叠加(每类武功的特效只取一个)
	21	额外提高伤害
	22	提高伤害百分比
	23	攻击时附加状态
	24	攻击时吸内
	25	攻击时化去内力
	26	攻击时吸血
	27	攻击时杀体力
	28	攻击时杀集气
	29
	30
	31	提高医疗效果
	32	
	-->此部分特效可存在于除攻击武功外所有类型武功上,但是效果不能叠加,只取一个
	41	受到伤害降低
	42	受到伤害降低百分比
	43	受到伤害反弹百分比
	45	反击
	46	抵抗异常状态
	47	抵抗特技
	48	
	49
	50
	51	提高被医疗效果
]]--